OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PA.0 MFP */
#define SYS_GPA_MFP0_PA0MFP_GPIO              (0x0UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for GPIO               */
#define SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0       (0x3UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for QSPI0_MOSI0        */
#define SYS_GPA_MFP0_PA0MFP_SPI0_MOSI         (0x4UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for SPI0_MOSI          */
#define SYS_GPA_MFP0_PA0MFP_SD1_DAT0          (0x5UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for SD1_DAT0           */
#define SYS_GPA_MFP0_PA0MFP_SC0_CLK           (0x6UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for SC0_CLK            */
#define SYS_GPA_MFP0_PA0MFP_UART0_RXD         (0x7UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for UART0_RXD          */
#define SYS_GPA_MFP0_PA0MFP_UART1_nRTS        (0x8UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for UART1_nRTS         */
#define SYS_GPA_MFP0_PA0MFP_I2C2_SDA          (0x9UL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for I2C2_SDA           */
#define SYS_GPA_MFP0_PA0MFP_CCAP_DATA6        (0xAUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for CCAP_DATA6         */
#define SYS_GPA_MFP0_PA0MFP_I3C0_SDA          (0xBUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for I3C0_SDA           */
#define SYS_GPA_MFP0_PA0MFP_BPWM0_CH0         (0xCUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for BPWM0_CH0          */
#define SYS_GPA_MFP0_PA0MFP_EPWM0_CH5         (0xDUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for EPWM0_CH5          */
#define SYS_GPA_MFP0_PA0MFP_EQEI3_B           (0xEUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for EQEI3_B            */
#define SYS_GPA_MFP0_PA0MFP_DAC0_ST           (0xFUL<<SYS_GPA_MFP0_PA0MFP_Pos)    /*!< GPA_MFP0 PA0 setting for DAC0_ST            */
#define SYS_GPA_MFP0_PA0MFP_PSIO0_CH7         (0x11UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for PSIO0_CH7          */
#define SYS_GPA_MFP0_PA0MFP_UTCPD0_VCNEN1     (0x13UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for UTCPD0_VCNEN1      */
#define SYS_GPA_MFP0_PA0MFP_LPSPI0_MOSI       (0x14UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPSPI0_MOSI        */
#define SYS_GPA_MFP0_PA0MFP_LPUART0_RXD       (0x15UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPUART0_RXD        */
#define SYS_GPA_MFP0_PA0MFP_LPIO0             (0x17UL<<SYS_GPA_MFP0_PA0MFP_Pos)   /*!< GPA_MFP0 PA0 setting for LPIO0              */

/* PA.1 MFP */
#define SYS_GPA_MFP0_PA1MFP_GPIO              (0x0UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for GPIO               */
#define SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0       (0x3UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for QSPI0_MISO0        */
#define SYS_GPA_MFP0_PA1MFP_SPI0_MISO         (0x4UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for SPI0_MISO          */
#define SYS_GPA_MFP0_PA1MFP_SD1_DAT1          (0x5UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for SD1_DAT1           */
#define SYS_GPA_MFP0_PA1MFP_SC0_DAT           (0x6UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for SC0_DAT            */
#define SYS_GPA_MFP0_PA1MFP_UART0_TXD         (0x7UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for UART0_TXD          */
#define SYS_GPA_MFP0_PA1MFP_UART1_nCTS        (0x8UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for UART1_nCTS         */
#define SYS_GPA_MFP0_PA1MFP_I2C2_SCL          (0x9UL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for I2C2_SCL           */
#define SYS_GPA_MFP0_PA1MFP_CCAP_DATA7        (0xAUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for CCAP_DATA7         */
#define SYS_GPA_MFP0_PA1MFP_I3C0_SCL          (0xBUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for I3C0_SCL           */
#define SYS_GPA_MFP0_PA1MFP_BPWM0_CH1         (0xCUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for BPWM0_CH1          */
#define SYS_GPA_MFP0_PA1MFP_EPWM0_CH4         (0xDUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for EPWM0_CH4          */
#define SYS_GPA_MFP0_PA1MFP_EQEI3_A           (0xEUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for EQEI3_A            */
#define SYS_GPA_MFP0_PA1MFP_DAC1_ST           (0xFUL<<SYS_GPA_MFP0_PA1MFP_Pos)    /*!< GPA_MFP0 PA1 setting for DAC1_ST            */
#define SYS_GPA_MFP0_PA1MFP_DMIC1_CLK         (0x10UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for DMIC1_CLK          */
#define SYS_GPA_MFP0_PA1MFP_PSIO0_CH6         (0x11UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for PSIO0_CH6          */
#define SYS_GPA_MFP0_PA1MFP_UTCPD0_DISCHG     (0x12UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for UTCPD0_DISCHG      */
#define SYS_GPA_MFP0_PA1MFP_UTCPD0_FRSTX1     (0x13UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for UTCPD0_FRSTX1      */
#define SYS_GPA_MFP0_PA1MFP_LPSPI0_MISO       (0x14UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPSPI0_MISO        */
#define SYS_GPA_MFP0_PA1MFP_LPUART0_TXD       (0x15UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPUART0_TXD        */
#define SYS_GPA_MFP0_PA1MFP_LPIO1             (0x17UL<<SYS_GPA_MFP0_PA1MFP_Pos)   /*!< GPA_MFP0 PA1 setting for LPIO1              */

/* PA.2 MFP */
#define SYS_GPA_MFP0_PA2MFP_GPIO              (0x0UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for GPIO               */
#define SYS_GPA_MFP0_PA2MFP_QSPI0_CLK         (0x3UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for QSPI0_CLK          */
#define SYS_GPA_MFP0_PA2MFP_SPI0_CLK          (0x4UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for SPI0_CLK           */
#define SYS_GPA_MFP0_PA2MFP_SD1_DAT2          (0x5UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for SD1_DAT2           */
#define SYS_GPA_MFP0_PA2MFP_SC0_RST           (0x6UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for SC0_RST            */
#define SYS_GPA_MFP0_PA2MFP_UART4_RXD         (0x7UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for UART4_RXD          */
#define SYS_GPA_MFP0_PA2MFP_UART1_RXD         (0x8UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for UART1_RXD          */
#define SYS_GPA_MFP0_PA2MFP_I2C1_SDA          (0x9UL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for I2C1_SDA           */
#define SYS_GPA_MFP0_PA2MFP_I2C0_SMBSUS       (0xAUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for I2C0_SMBSUS        */
#define SYS_GPA_MFP0_PA2MFP_CCAP_DATA2        (0xBUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for CCAP_DATA2         */
#define SYS_GPA_MFP0_PA2MFP_BPWM0_CH2         (0xCUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for BPWM0_CH2          */
#define SYS_GPA_MFP0_PA2MFP_EPWM0_CH3         (0xDUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for EPWM0_CH3          */
#define SYS_GPA_MFP0_PA2MFP_EQEI3_INDEX       (0xEUL<<SYS_GPA_MFP0_PA2MFP_Pos)    /*!< GPA_MFP0 PA2 setting for EQEI3_INDEX        */
#define SYS_GPA_MFP0_PA2MFP_DMIC1_DAT         (0x10UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for DMIC1_DAT          */
#define SYS_GPA_MFP0_PA2MFP_PSIO0_CH5         (0x11UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for PSIO0_CH5          */
#define SYS_GPA_MFP0_PA2MFP_I3C0_PUPEN        (0x12UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for I3C0_PUPEN         */
#define SYS_GPA_MFP0_PA2MFP_UTCPD0_VBSRCEN    (0x13UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for UTCPD0_VBSRCEN     */
#define SYS_GPA_MFP0_PA2MFP_LPSPI0_CLK        (0x14UL<<SYS_GPA_MFP0_PA2MFP_Pos)   /*!< GPA_MFP0 PA2 setting for LPSPI0_CLK         */

/* PA.3 MFP */
#define SYS_GPA_MFP0_PA3MFP_GPIO              (0x0UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for GPIO               */
#define SYS_GPA_MFP0_PA3MFP_QSPI0_SS          (0x3UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for QSPI0_SS           */
#define SYS_GPA_MFP0_PA3MFP_SPI0_SS           (0x4UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for SPI0_SS            */
#define SYS_GPA_MFP0_PA3MFP_SD1_DAT3          (0x5UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for SD1_DAT3           */
#define SYS_GPA_MFP0_PA3MFP_SC0_PWR           (0x6UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for SC0_PWR            */
#define SYS_GPA_MFP0_PA3MFP_UART4_TXD         (0x7UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for UART4_TXD          */
#define SYS_GPA_MFP0_PA3MFP_UART1_TXD         (0x8UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for UART1_TXD          */
#define SYS_GPA_MFP0_PA3MFP_I2C1_SCL          (0x9UL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for I2C1_SCL           */
#define SYS_GPA_MFP0_PA3MFP_I2C0_SMBAL        (0xAUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for I2C0_SMBAL         */
#define SYS_GPA_MFP0_PA3MFP_CCAP_DATA3        (0xBUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for CCAP_DATA3         */
#define SYS_GPA_MFP0_PA3MFP_BPWM0_CH3         (0xCUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for BPWM0_CH3          */
#define SYS_GPA_MFP0_PA3MFP_EPWM0_CH2         (0xDUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EPWM0_CH2          */
#define SYS_GPA_MFP0_PA3MFP_EQEI0_B           (0xEUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EQEI0_B            */
#define SYS_GPA_MFP0_PA3MFP_EPWM1_BRAKE1      (0xFUL<<SYS_GPA_MFP0_PA3MFP_Pos)    /*!< GPA_MFP0 PA3 setting for EPWM1_BRAKE1       */
#define SYS_GPA_MFP0_PA3MFP_DMIC0_CLKLP       (0x10UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for DMIC0_CLKLP        */
#define SYS_GPA_MFP0_PA3MFP_PSIO0_CH4         (0x11UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for PSIO0_CH4          */
#define SYS_GPA_MFP0_PA3MFP_UTCPD0_VBSNKEN    (0x13UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for UTCPD0_VBSNKEN     */
#define SYS_GPA_MFP0_PA3MFP_LPSPI0_SS         (0x14UL<<SYS_GPA_MFP0_PA3MFP_Pos)   /*!< GPA_MFP0 PA3 setting for LPSPI0_SS          */

/* PA.4 MFP */
#define SYS_GPA_MFP1_PA4MFP_GPIO              (0x0UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for GPIO               */
#define SYS_GPA_MFP1_PA4MFP_EBI_AD1           (0x2UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for EBI_AD1            */
#define SYS_GPA_MFP1_PA4MFP_QSPI0_MOSI1       (0x3UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for QSPI0_MOSI1        */
#define SYS_GPA_MFP1_PA4MFP_SPI0_I2SMCLK      (0x4UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for SPI0_I2SMCLK       */
#define SYS_GPA_MFP1_PA4MFP_SD1_CLK           (0x5UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for SD1_CLK            */
#define SYS_GPA_MFP1_PA4MFP_SC0_nCD           (0x6UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for SC0_nCD            */
#define SYS_GPA_MFP1_PA4MFP_UART0_nRTS        (0x7UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART0_nRTS         */
#define SYS_GPA_MFP1_PA4MFP_UART5_RXD         (0x8UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART5_RXD          */
#define SYS_GPA_MFP1_PA4MFP_I2C0_SDA          (0x9UL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for I2C0_SDA           */
#define SYS_GPA_MFP1_PA4MFP_CANFD0_RXD        (0xAUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for CANFD0_RXD         */
#define SYS_GPA_MFP1_PA4MFP_UART0_RXD         (0xBUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for UART0_RXD          */
#define SYS_GPA_MFP1_PA4MFP_BPWM0_CH4         (0xCUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for BPWM0_CH4          */
#define SYS_GPA_MFP1_PA4MFP_EPWM0_CH1         (0xDUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for EPWM0_CH1          */
#define SYS_GPA_MFP1_PA4MFP_EQEI0_A           (0xEUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for EQEI0_A            */
#define SYS_GPA_MFP1_PA4MFP_CCAP_SCLK         (0xFUL<<SYS_GPA_MFP1_PA4MFP_Pos)    /*!< GPA_MFP1 PA4 setting for CCAP_SCLK          */
#define SYS_GPA_MFP1_PA4MFP_DMIC0_CLK         (0x10UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for DMIC0_CLK          */
#define SYS_GPA_MFP1_PA4MFP_I3C0_SDA          (0x11UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for I3C0_SDA           */
#define SYS_GPA_MFP1_PA4MFP_UTCPD0_VBSRCEN    (0x13UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for UTCPD0_VBSRCEN     */
#define SYS_GPA_MFP1_PA4MFP_LPUART0_RXD       (0x14UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPUART0_RXD        */
#define SYS_GPA_MFP1_PA4MFP_LPUART0_nRTS      (0x15UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPUART0_nRTS       */
#define SYS_GPA_MFP1_PA4MFP_LPI2C0_SDA        (0x16UL<<SYS_GPA_MFP1_PA4MFP_Pos)   /*!< GPA_MFP1 PA4 setting for LPI2C0_SDA         */

