OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PB.6 MFP */
#define SYS_GPB_MFP1_PB6MFP_GPIO              (0x0UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for GPIO               */
#define SYS_GPB_MFP1_PB6MFP_ACMP2_N           (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for ACMP2_N            */
#define SYS_GPB_MFP1_PB6MFP_EADC0_CH6         (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EADC0_CH6          */
#define SYS_GPB_MFP1_PB6MFP_LPADC0_CH6        (0x1UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for LPADC0_CH6         */
#define SYS_GPB_MFP1_PB6MFP_EBI_nWRH          (0x2UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EBI_nWRH           */
#define SYS_GPB_MFP1_PB6MFP_EMAC0_PPS         (0x3UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EMAC0_PPS          */
#define SYS_GPB_MFP1_PB6MFP_CANFD1_RXD        (0x5UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for CANFD1_RXD         */
#define SYS_GPB_MFP1_PB6MFP_UART1_RXD         (0x6UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for UART1_RXD          */
#define SYS_GPB_MFP1_PB6MFP_SD1_CLK           (0x7UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for SD1_CLK            */
#define SYS_GPB_MFP1_PB6MFP_EBI_nCS1          (0x8UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EBI_nCS1           */
#define SYS_GPB_MFP1_PB6MFP_SPI0_CLK          (0x9UL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for SPI0_CLK           */
#define SYS_GPB_MFP1_PB6MFP_BPWM1_CH5         (0xAUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for BPWM1_CH5          */
#define SYS_GPB_MFP1_PB6MFP_EPWM1_BRAKE1      (0xBUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EPWM1_BRAKE1       */
#define SYS_GPB_MFP1_PB6MFP_EPWM1_CH5         (0xCUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for EPWM1_CH5          */
#define SYS_GPB_MFP1_PB6MFP_INT4              (0xDUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for INT4               */
#define SYS_GPB_MFP1_PB6MFP_USB_VBUS_EN       (0xEUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for USB_VBUS_EN        */
#define SYS_GPB_MFP1_PB6MFP_ACMP1_O           (0xFUL<<SYS_GPB_MFP1_PB6MFP_Pos)    /*!< GPB_MFP1 PB6 setting for ACMP1_O            */
#define SYS_GPB_MFP1_PB6MFP_DMIC0_CLKLP       (0x10UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for DMIC0_CLKLP        */
#define SYS_GPB_MFP1_PB6MFP_EPWM0_SYNC_IN     (0x11UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for EPWM0_SYNC_IN      */
#define SYS_GPB_MFP1_PB6MFP_KPI_COL5          (0x12UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for KPI_COL5           */
#define SYS_GPB_MFP1_PB6MFP_SC1_nCD           (0x13UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for SC1_nCD            */
#define SYS_GPB_MFP1_PB6MFP_HSUSB_VBUS_EN     (0x14UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for HSUSB_VBUS_EN      */
#define SYS_GPB_MFP1_PB6MFP_TM1               (0x16UL<<SYS_GPB_MFP1_PB6MFP_Pos)   /*!< GPB_MFP1 PB6 setting for TM1                */

/* PB.7 MFP */
#define SYS_GPB_MFP1_PB7MFP_GPIO              (0x0UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for GPIO               */
#define SYS_GPB_MFP1_PB7MFP_ACMP2_P0          (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for ACMP2_P0           */
#define SYS_GPB_MFP1_PB7MFP_EADC0_CH7         (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EADC0_CH7          */
#define SYS_GPB_MFP1_PB7MFP_LPADC0_CH7        (0x1UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for LPADC0_CH7         */
#define SYS_GPB_MFP1_PB7MFP_EBI_nWRL          (0x2UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EBI_nWRL           */
#define SYS_GPB_MFP1_PB7MFP_EMAC0_RMII_TXEN   (0x3UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EMAC0_RMII_TXEN    */
#define SYS_GPB_MFP1_PB7MFP_CCAP_DATA0        (0x4UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for CCAP_DATA0         */
#define SYS_GPB_MFP1_PB7MFP_CANFD1_TXD        (0x5UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for CANFD1_TXD         */
#define SYS_GPB_MFP1_PB7MFP_UART1_TXD         (0x6UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for UART1_TXD          */
#define SYS_GPB_MFP1_PB7MFP_SD1_CMD           (0x7UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for SD1_CMD            */
#define SYS_GPB_MFP1_PB7MFP_EBI_nCS0          (0x8UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EBI_nCS0           */
#define SYS_GPB_MFP1_PB7MFP_SPI0_SS           (0x9UL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for SPI0_SS            */
#define SYS_GPB_MFP1_PB7MFP_BPWM1_CH4         (0xAUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for BPWM1_CH4          */
#define SYS_GPB_MFP1_PB7MFP_EPWM1_BRAKE0      (0xBUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EPWM1_BRAKE0       */
#define SYS_GPB_MFP1_PB7MFP_EPWM1_CH4         (0xCUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for EPWM1_CH4          */
#define SYS_GPB_MFP1_PB7MFP_INT5              (0xDUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for INT5               */
#define SYS_GPB_MFP1_PB7MFP_USB_VBUS_ST       (0xEUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for USB_VBUS_ST        */
#define SYS_GPB_MFP1_PB7MFP_ACMP0_O           (0xFUL<<SYS_GPB_MFP1_PB7MFP_Pos)    /*!< GPB_MFP1 PB7 setting for ACMP0_O            */
#define SYS_GPB_MFP1_PB7MFP_ETMC_TRACE_DATA3  (0x10UL<<SYS_GPB_MFP1_PB7MFP_Pos)   /*!< GPB_MFP1 PB7 setting for ETMC_TRACE_DATA3   */
#define SYS_GPB_MFP1_PB7MFP_KPI_COL4          (0x12UL<<SYS_GPB_MFP1_PB7MFP_Pos)   /*!< GPB_MFP1 PB7 setting for KPI_COL4           */
#define SYS_GPB_MFP1_PB7MFP_TRACE_SWO         (0x13UL<<SYS_GPB_MFP1_PB7MFP_Pos)   /*!< GPB_MFP1 PB7 setting for TRACE_SWO          */
#define SYS_GPB_MFP1_PB7MFP_HSUSB_VBUS_ST     (0x14UL<<SYS_GPB_MFP1_PB7MFP_Pos)   /*!< GPB_MFP1 PB7 setting for HSUSB_VBUS_ST      */

/* PB.8 MFP */
#define SYS_GPB_MFP2_PB8MFP_GPIO              (0x0UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for GPIO               */
#define SYS_GPB_MFP2_PB8MFP_ACMP2_P1          (0x1UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for ACMP2_P1           */
#define SYS_GPB_MFP2_PB8MFP_EADC0_CH8         (0x1UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for EADC0_CH8          */
#define SYS_GPB_MFP2_PB8MFP_LPADC0_CH8        (0x1UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for LPADC0_CH8         */
#define SYS_GPB_MFP2_PB8MFP_EBI_ADR19         (0x2UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for EBI_ADR19          */
#define SYS_GPB_MFP2_PB8MFP_EMAC0_RMII_TXD1   (0x3UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for EMAC0_RMII_TXD1    */
#define SYS_GPB_MFP2_PB8MFP_CCAP_DATA1        (0x4UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for CCAP_DATA1         */
#define SYS_GPB_MFP2_PB8MFP_UART0_RXD         (0x5UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART0_RXD          */
#define SYS_GPB_MFP2_PB8MFP_UART1_nRTS        (0x6UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART1_nRTS         */
#define SYS_GPB_MFP2_PB8MFP_I2C1_SMBSUS       (0x7UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for I2C1_SMBSUS        */
#define SYS_GPB_MFP2_PB8MFP_UART7_RXD         (0x8UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for UART7_RXD          */
#define SYS_GPB_MFP2_PB8MFP_I2C0_SDA          (0x9UL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for I2C0_SDA           */
#define SYS_GPB_MFP2_PB8MFP_BPWM1_CH3         (0xAUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for BPWM1_CH3          */
#define SYS_GPB_MFP2_PB8MFP_SPI3_MOSI         (0xBUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for SPI3_MOSI          */
#define SYS_GPB_MFP2_PB8MFP_INT6              (0xDUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for INT6               */
#define SYS_GPB_MFP2_PB8MFP_USB_VBUS_ST       (0xEUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for USB_VBUS_ST        */
#define SYS_GPB_MFP2_PB8MFP_USB_VBUS_EN       (0xFUL<<SYS_GPB_MFP2_PB8MFP_Pos)    /*!< GPB_MFP2 PB8 setting for USB_VBUS_EN        */
#define SYS_GPB_MFP2_PB8MFP_ETMC_TRACE_DATA2  (0x10UL<<SYS_GPB_MFP2_PB8MFP_Pos)   /*!< GPB_MFP2 PB8 setting for ETMC_TRACE_DATA2   */
#define SYS_GPB_MFP2_PB8MFP_LPUART0_RXD       (0x15UL<<SYS_GPB_MFP2_PB8MFP_Pos)   /*!< GPB_MFP2 PB8 setting for LPUART0_RXD        */

