OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PC.7 MFP */
#define SYS_GPC_MFP1_PC7MFP_GPIO              (0x0UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for GPIO               */
#define SYS_GPC_MFP1_PC7MFP_EBI_AD9           (0x2UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for EBI_AD9            */
#define SYS_GPC_MFP1_PC7MFP_EMAC0_RMII_RXD0   (0x3UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for EMAC0_RMII_RXD0    */
#define SYS_GPC_MFP1_PC7MFP_SPI1_MISO         (0x4UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for SPI1_MISO          */
#define SYS_GPC_MFP1_PC7MFP_UART4_TXD         (0x5UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for UART4_TXD          */
#define SYS_GPC_MFP1_PC7MFP_SC2_PWR           (0x6UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for SC2_PWR            */
#define SYS_GPC_MFP1_PC7MFP_UART0_nCTS        (0x7UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for UART0_nCTS         */
#define SYS_GPC_MFP1_PC7MFP_I2C1_SMBAL        (0x8UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for I2C1_SMBAL         */
#define SYS_GPC_MFP1_PC7MFP_UART6_TXD         (0x9UL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for UART6_TXD          */
#define SYS_GPC_MFP1_PC7MFP_ACMP2_WLAT        (0xAUL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for ACMP2_WLAT         */
#define SYS_GPC_MFP1_PC7MFP_EPWM1_CH2         (0xBUL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for EPWM1_CH2          */
#define SYS_GPC_MFP1_PC7MFP_BPWM1_CH0         (0xCUL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for BPWM1_CH0          */
#define SYS_GPC_MFP1_PC7MFP_TM0               (0xEUL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for TM0                */
#define SYS_GPC_MFP1_PC7MFP_INT3              (0xFUL<<SYS_GPC_MFP1_PC7MFP_Pos)    /*!< GPC_MFP1 PC7 setting for INT3               */
#define SYS_GPC_MFP1_PC7MFP_KPI_COL3          (0x12UL<<SYS_GPC_MFP1_PC7MFP_Pos)   /*!< GPC_MFP1 PC7 setting for KPI_COL3           */
#define SYS_GPC_MFP1_PC7MFP_LPUART0_nCTS      (0x15UL<<SYS_GPC_MFP1_PC7MFP_Pos)   /*!< GPC_MFP1 PC7 setting for LPUART0_nCTS       */
#define SYS_GPC_MFP1_PC7MFP_LPTM0             (0x17UL<<SYS_GPC_MFP1_PC7MFP_Pos)   /*!< GPC_MFP1 PC7 setting for LPTM0              */

/* PC.8 MFP */
#define SYS_GPC_MFP2_PC8MFP_GPIO              (0x0UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for GPIO               */
#define SYS_GPC_MFP2_PC8MFP_EBI_ADR16         (0x2UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for EBI_ADR16          */
#define SYS_GPC_MFP2_PC8MFP_EMAC0_RMII_REFCLK (0x3UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for EMAC0_RMII_REFCLK  */
#define SYS_GPC_MFP2_PC8MFP_I2C0_SDA          (0x4UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for I2C0_SDA           */
#define SYS_GPC_MFP2_PC8MFP_UART4_nCTS        (0x5UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for UART4_nCTS         */
#define SYS_GPC_MFP2_PC8MFP_UART1_RXD         (0x8UL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for UART1_RXD          */
#define SYS_GPC_MFP2_PC8MFP_EPWM1_CH1         (0xBUL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for EPWM1_CH1          */
#define SYS_GPC_MFP2_PC8MFP_BPWM1_CH4         (0xCUL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for BPWM1_CH4          */
#define SYS_GPC_MFP2_PC8MFP_SWODEC_SWO        (0xEUL<<SYS_GPC_MFP2_PC8MFP_Pos)    /*!< GPC_MFP2 PC8 setting for SWODEC_SWO         */
#define SYS_GPC_MFP2_PC8MFP_KPI_COL4          (0x12UL<<SYS_GPC_MFP2_PC8MFP_Pos)   /*!< GPC_MFP2 PC8 setting for KPI_COL4           */
#define SYS_GPC_MFP2_PC8MFP_LPI2C0_SDA        (0x16UL<<SYS_GPC_MFP2_PC8MFP_Pos)   /*!< GPC_MFP2 PC8 setting for LPI2C0_SDA         */

/* PC.9 MFP */
#define SYS_GPC_MFP2_PC9MFP_GPIO              (0x0UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for GPIO               */
#define SYS_GPC_MFP2_PC9MFP_ACMP3_P1          (0x1UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for ACMP3_P1           */
#define SYS_GPC_MFP2_PC9MFP_EBI_ADR7          (0x2UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for EBI_ADR7           */
#define SYS_GPC_MFP2_PC9MFP_UART6_nCTS        (0x5UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for UART6_nCTS         */
#define SYS_GPC_MFP2_PC9MFP_SPI3_SS           (0x6UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for SPI3_SS            */
#define SYS_GPC_MFP2_PC9MFP_UART3_RXD         (0x7UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for UART3_RXD          */
#define SYS_GPC_MFP2_PC9MFP_CANFD1_RXD        (0x9UL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for CANFD1_RXD         */
#define SYS_GPC_MFP2_PC9MFP_EPWM1_CH3         (0xCUL<<SYS_GPC_MFP2_PC9MFP_Pos)    /*!< GPC_MFP2 PC9 setting for EPWM1_CH3          */
#define SYS_GPC_MFP2_PC9MFP_I3C0_PUPEN        (0x12UL<<SYS_GPC_MFP2_PC9MFP_Pos)   /*!< GPC_MFP2 PC9 setting for I3C0_PUPEN         */

/* PC.10 MFP */
#define SYS_GPC_MFP2_PC10MFP_GPIO             (0x0UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for GPIO              */
#define SYS_GPC_MFP2_PC10MFP_ACMP3_P2         (0x1UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for ACMP3_P2          */
#define SYS_GPC_MFP2_PC10MFP_EBI_ADR6         (0x2UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for EBI_ADR6          */
#define SYS_GPC_MFP2_PC10MFP_UART6_nRTS       (0x5UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for UART6_nRTS        */
#define SYS_GPC_MFP2_PC10MFP_SPI3_CLK         (0x6UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for SPI3_CLK          */
#define SYS_GPC_MFP2_PC10MFP_UART3_TXD        (0x7UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for UART3_TXD         */
#define SYS_GPC_MFP2_PC10MFP_CANFD1_TXD       (0x9UL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for CANFD1_TXD        */
#define SYS_GPC_MFP2_PC10MFP_ECAP1_IC0        (0xBUL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for ECAP1_IC0         */
#define SYS_GPC_MFP2_PC10MFP_EPWM1_CH2        (0xCUL<<SYS_GPC_MFP2_PC10MFP_Pos)   /*!< GPC_MFP2 PC10 setting for EPWM1_CH2         */

/* PC.11 MFP */
#define SYS_GPC_MFP2_PC11MFP_GPIO             (0x0UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for GPIO              */
#define SYS_GPC_MFP2_PC11MFP_ACMP3_P3         (0x1UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for ACMP3_P3          */
#define SYS_GPC_MFP2_PC11MFP_EBI_ADR5         (0x2UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for EBI_ADR5          */
#define SYS_GPC_MFP2_PC11MFP_UART0_RXD        (0x3UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for UART0_RXD         */
#define SYS_GPC_MFP2_PC11MFP_I2C0_SDA         (0x4UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for I2C0_SDA          */
#define SYS_GPC_MFP2_PC11MFP_UART6_RXD        (0x5UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for UART6_RXD         */
#define SYS_GPC_MFP2_PC11MFP_SPI3_MOSI        (0x6UL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for SPI3_MOSI         */
#define SYS_GPC_MFP2_PC11MFP_ECAP1_IC1        (0xBUL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for ECAP1_IC1         */
#define SYS_GPC_MFP2_PC11MFP_EPWM1_CH1        (0xCUL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for EPWM1_CH1         */
#define SYS_GPC_MFP2_PC11MFP_ACMP1_O          (0xEUL<<SYS_GPC_MFP2_PC11MFP_Pos)   /*!< GPC_MFP2 PC11 setting for ACMP1_O           */
#define SYS_GPC_MFP2_PC11MFP_LPUART0_RXD      (0x15UL<<SYS_GPC_MFP2_PC11MFP_Pos)  /*!< GPC_MFP2 PC11 setting for LPUART0_RXD       */
#define SYS_GPC_MFP2_PC11MFP_LPI2C0_SDA       (0x16UL<<SYS_GPC_MFP2_PC11MFP_Pos)  /*!< GPC_MFP2 PC11 setting for LPI2C0_SDA        */

/* PC.12 MFP */
#define SYS_GPC_MFP3_PC12MFP_GPIO             (0x0UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for GPIO              */
#define SYS_GPC_MFP3_PC12MFP_EBI_ADR4         (0x2UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for EBI_ADR4          */
#define SYS_GPC_MFP3_PC12MFP_UART0_TXD        (0x3UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for UART0_TXD         */
#define SYS_GPC_MFP3_PC12MFP_I2C0_SCL         (0x4UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for I2C0_SCL          */
#define SYS_GPC_MFP3_PC12MFP_UART6_TXD        (0x5UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for UART6_TXD         */
#define SYS_GPC_MFP3_PC12MFP_SPI3_MISO        (0x6UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for SPI3_MISO         */
#define SYS_GPC_MFP3_PC12MFP_SC0_nCD          (0x9UL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for SC0_nCD           */
#define SYS_GPC_MFP3_PC12MFP_ECAP1_IC2        (0xBUL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for ECAP1_IC2         */
#define SYS_GPC_MFP3_PC12MFP_EPWM1_CH0        (0xCUL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for EPWM1_CH0         */
#define SYS_GPC_MFP3_PC12MFP_ACMP0_O          (0xEUL<<SYS_GPC_MFP3_PC12MFP_Pos)   /*!< GPC_MFP3 PC12 setting for ACMP0_O           */
#define SYS_GPC_MFP3_PC12MFP_LPUART0_TXD      (0x15UL<<SYS_GPC_MFP3_PC12MFP_Pos)  /*!< GPC_MFP3 PC12 setting for LPUART0_TXD       */
#define SYS_GPC_MFP3_PC12MFP_LPI2C0_SCL       (0x16UL<<SYS_GPC_MFP3_PC12MFP_Pos)  /*!< GPC_MFP3 PC12 setting for LPI2C0_SCL        */

