OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PD.5 MFP */
#define SYS_GPD_MFP1_PD5MFP_GPIO              (0x0UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for GPIO               */
#define SYS_GPD_MFP1_PD5MFP_EBI_AD15          (0x2UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for EBI_AD15           */
#define SYS_GPD_MFP1_PD5MFP_SD1_nCD           (0x3UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for SD1_nCD            */
#define SYS_GPD_MFP1_PD5MFP_EBI_nCS0          (0x4UL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for EBI_nCS0           */
#define SYS_GPD_MFP1_PD5MFP_CLKO              (0xEUL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for CLKO               */
#define SYS_GPD_MFP1_PD5MFP_EADC0_ST          (0xFUL<<SYS_GPD_MFP1_PD5MFP_Pos)    /*!< GPD_MFP1 PD5 setting for EADC0_ST           */
#define SYS_GPD_MFP1_PD5MFP_LPADC0_ST         (0x17UL<<SYS_GPD_MFP1_PD5MFP_Pos)   /*!< GPD_MFP1 PD5 setting for LPADC0_ST          */

/* PD.6 MFP */
#define SYS_GPD_MFP1_PD6MFP_GPIO              (0x0UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for GPIO               */
#define SYS_GPD_MFP1_PD6MFP_EBI_AD5           (0x2UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for EBI_AD5            */
#define SYS_GPD_MFP1_PD6MFP_SD1_CLK           (0x3UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for SD1_CLK            */
#define SYS_GPD_MFP1_PD6MFP_QSPI1_MOSI0       (0x5UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for QSPI1_MOSI0        */
#define SYS_GPD_MFP1_PD6MFP_UART6_RXD         (0x6UL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for UART6_RXD          */
#define SYS_GPD_MFP1_PD6MFP_BPWM0_CH0         (0xCUL<<SYS_GPD_MFP1_PD6MFP_Pos)    /*!< GPD_MFP1 PD6 setting for BPWM0_CH0          */

/* PD.7 MFP */
#define SYS_GPD_MFP1_PD7MFP_GPIO              (0x0UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for GPIO               */
#define SYS_GPD_MFP1_PD7MFP_EBI_AD4           (0x2UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for EBI_AD4            */
#define SYS_GPD_MFP1_PD7MFP_SD1_CMD           (0x3UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for SD1_CMD            */
#define SYS_GPD_MFP1_PD7MFP_QSPI1_MISO0       (0x5UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for QSPI1_MISO0        */
#define SYS_GPD_MFP1_PD7MFP_UART6_TXD         (0x6UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for UART6_TXD          */
#define SYS_GPD_MFP1_PD7MFP_CCAP_HSYNC        (0x7UL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for CCAP_HSYNC         */
#define SYS_GPD_MFP1_PD7MFP_BPWM0_CH1         (0xCUL<<SYS_GPD_MFP1_PD7MFP_Pos)    /*!< GPD_MFP1 PD7 setting for BPWM0_CH1          */

/* PD.8 MFP */
#define SYS_GPD_MFP2_PD8MFP_GPIO              (0x0UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for GPIO               */
#define SYS_GPD_MFP2_PD8MFP_EBI_AD6           (0x2UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for EBI_AD6            */
#define SYS_GPD_MFP2_PD8MFP_I2C2_SDA          (0x3UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for I2C2_SDA           */
#define SYS_GPD_MFP2_PD8MFP_UART2_nRTS        (0x4UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for UART2_nRTS         */
#define SYS_GPD_MFP2_PD8MFP_UART7_RXD         (0x5UL<<SYS_GPD_MFP2_PD8MFP_Pos)    /*!< GPD_MFP2 PD8 setting for UART7_RXD          */
#define SYS_GPD_MFP2_PD8MFP_PSIO0_CH3         (0x11UL<<SYS_GPD_MFP2_PD8MFP_Pos)   /*!< GPD_MFP2 PD8 setting for PSIO0_CH3          */

/* PD.9 MFP */
#define SYS_GPD_MFP2_PD9MFP_GPIO              (0x0UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for GPIO               */
#define SYS_GPD_MFP2_PD9MFP_EBI_AD7           (0x2UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for EBI_AD7            */
#define SYS_GPD_MFP2_PD9MFP_I2C2_SCL          (0x3UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for I2C2_SCL           */
#define SYS_GPD_MFP2_PD9MFP_UART2_nCTS        (0x4UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for UART2_nCTS         */
#define SYS_GPD_MFP2_PD9MFP_UART7_TXD         (0x5UL<<SYS_GPD_MFP2_PD9MFP_Pos)    /*!< GPD_MFP2 PD9 setting for UART7_TXD          */
#define SYS_GPD_MFP2_PD9MFP_PSIO0_CH2         (0x11UL<<SYS_GPD_MFP2_PD9MFP_Pos)   /*!< GPD_MFP2 PD9 setting for PSIO0_CH2          */

/* PD.10 MFP */
#define SYS_GPD_MFP2_PD10MFP_GPIO             (0x0UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for GPIO              */
#define SYS_GPD_MFP2_PD10MFP_EADC0_CH16       (0x1UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for EADC0_CH16        */
#define SYS_GPD_MFP2_PD10MFP_LPADC0_CH16      (0x1UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for LPADC0_CH16       */
#define SYS_GPD_MFP2_PD10MFP_EBI_nCS2         (0x2UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for EBI_nCS2          */
#define SYS_GPD_MFP2_PD10MFP_UART1_RXD        (0x3UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for UART1_RXD         */
#define SYS_GPD_MFP2_PD10MFP_CANFD0_RXD       (0x4UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for CANFD0_RXD        */
#define SYS_GPD_MFP2_PD10MFP_UART8_RXD        (0x8UL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for UART8_RXD         */
#define SYS_GPD_MFP2_PD10MFP_EQEI0_B          (0xAUL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for EQEI0_B           */
#define SYS_GPD_MFP2_PD10MFP_ECAP3_IC2        (0xBUL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for ECAP3_IC2         */
#define SYS_GPD_MFP2_PD10MFP_INT7             (0xFUL<<SYS_GPD_MFP2_PD10MFP_Pos)   /*!< GPD_MFP2 PD10 setting for INT7              */

/* PD.11 MFP */
#define SYS_GPD_MFP2_PD11MFP_GPIO             (0x0UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for GPIO              */
#define SYS_GPD_MFP2_PD11MFP_EADC0_CH17       (0x1UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for EADC0_CH17        */
#define SYS_GPD_MFP2_PD11MFP_LPADC0_CH17      (0x1UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for LPADC0_CH17       */
#define SYS_GPD_MFP2_PD11MFP_EBI_nCS1         (0x2UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for EBI_nCS1          */
#define SYS_GPD_MFP2_PD11MFP_UART1_TXD        (0x3UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for UART1_TXD         */
#define SYS_GPD_MFP2_PD11MFP_CANFD0_TXD       (0x4UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for CANFD0_TXD        */
#define SYS_GPD_MFP2_PD11MFP_UART8_TXD        (0x8UL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for UART8_TXD         */
#define SYS_GPD_MFP2_PD11MFP_EQEI0_A          (0xAUL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for EQEI0_A           */
#define SYS_GPD_MFP2_PD11MFP_ECAP3_IC1        (0xBUL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for ECAP3_IC1         */
#define SYS_GPD_MFP2_PD11MFP_INT6             (0xFUL<<SYS_GPD_MFP2_PD11MFP_Pos)   /*!< GPD_MFP2 PD11 setting for INT6              */

/* PD.12 MFP */
#define SYS_GPD_MFP3_PD12MFP_GPIO             (0x0UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for GPIO              */
#define SYS_GPD_MFP3_PD12MFP_EADC0_CH18       (0x1UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EADC0_CH18        */
#define SYS_GPD_MFP3_PD12MFP_LPADC0_CH18      (0x1UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for LPADC0_CH18       */
#define SYS_GPD_MFP3_PD12MFP_EBI_nCS0         (0x2UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EBI_nCS0          */
#define SYS_GPD_MFP3_PD12MFP_CANFD1_RXD       (0x5UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for CANFD1_RXD        */
#define SYS_GPD_MFP3_PD12MFP_UART2_RXD        (0x7UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for UART2_RXD         */
#define SYS_GPD_MFP3_PD12MFP_UART8_nRTS       (0x8UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for UART8_nRTS        */
#define SYS_GPD_MFP3_PD12MFP_BPWM0_CH5        (0x9UL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for BPWM0_CH5         */
#define SYS_GPD_MFP3_PD12MFP_EQEI0_INDEX      (0xAUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EQEI0_INDEX       */
#define SYS_GPD_MFP3_PD12MFP_ECAP3_IC0        (0xBUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for ECAP3_IC0         */
#define SYS_GPD_MFP3_PD12MFP_CLKO             (0xDUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for CLKO              */
#define SYS_GPD_MFP3_PD12MFP_EADC0_ST         (0xEUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for EADC0_ST          */
#define SYS_GPD_MFP3_PD12MFP_INT5             (0xFUL<<SYS_GPD_MFP3_PD12MFP_Pos)   /*!< GPD_MFP3 PD12 setting for INT5              */
#define SYS_GPD_MFP3_PD12MFP_LPADC0_ST        (0x17UL<<SYS_GPD_MFP3_PD12MFP_Pos)  /*!< GPD_MFP3 PD12 setting for LPADC0_ST         */

/* PD.13 MFP */
#define SYS_GPD_MFP3_PD13MFP_GPIO             (0x0UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for GPIO              */
#define SYS_GPD_MFP3_PD13MFP_EBI_AD10         (0x2UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for EBI_AD10          */
#define SYS_GPD_MFP3_PD13MFP_SD0_nCD          (0x3UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SD0_nCD           */
#define SYS_GPD_MFP3_PD13MFP_SPI0_I2SMCLK     (0x4UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SPI0_I2SMCLK      */
#define SYS_GPD_MFP3_PD13MFP_SPI1_I2SMCLK     (0x5UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SPI1_I2SMCLK      */
#define SYS_GPD_MFP3_PD13MFP_QSPI1_MOSI0      (0x6UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for QSPI1_MOSI0       */
#define SYS_GPD_MFP3_PD13MFP_SC2_nCD          (0x7UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SC2_nCD           */
#define SYS_GPD_MFP3_PD13MFP_SD1_CLK          (0x8UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for SD1_CLK           */
#define SYS_GPD_MFP3_PD13MFP_UART6_RXD        (0x9UL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for UART6_RXD         */
#define SYS_GPD_MFP3_PD13MFP_I2S1_LRCK        (0xAUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for I2S1_LRCK         */
#define SYS_GPD_MFP3_PD13MFP_BPWM0_CH0        (0xBUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for BPWM0_CH0         */
#define SYS_GPD_MFP3_PD13MFP_EQEI2_B          (0xCUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for EQEI2_B           */
#define SYS_GPD_MFP3_PD13MFP_ECAP2_IC2        (0xDUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for ECAP2_IC2         */
#define SYS_GPD_MFP3_PD13MFP_CLKO             (0xEUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for CLKO              */
#define SYS_GPD_MFP3_PD13MFP_EADC0_ST         (0xFUL<<SYS_GPD_MFP3_PD13MFP_Pos)   /*!< GPD_MFP3 PD13 setting for EADC0_ST          */
#define SYS_GPD_MFP3_PD13MFP_LPADC0_ST        (0x17UL<<SYS_GPD_MFP3_PD13MFP_Pos)  /*!< GPD_MFP3 PD13 setting for LPADC0_ST         */

/* PD.14 MFP */
#define SYS_GPD_MFP3_PD14MFP_GPIO             (0x0UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for GPIO              */
#define SYS_GPD_MFP3_PD14MFP_EBI_nCS0         (0x2UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for EBI_nCS0          */
#define SYS_GPD_MFP3_PD14MFP_SPI3_I2SMCLK     (0x3UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for SPI3_I2SMCLK      */
#define SYS_GPD_MFP3_PD14MFP_SC1_nCD          (0x4UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for SC1_nCD           */
#define SYS_GPD_MFP3_PD14MFP_SPI0_I2SMCLK     (0x5UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for SPI0_I2SMCLK      */
#define SYS_GPD_MFP3_PD14MFP_QSPI0_MOSI1      (0x6UL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for QSPI0_MOSI1       */
#define SYS_GPD_MFP3_PD14MFP_I2S1_BCLK        (0xAUL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for I2S1_BCLK         */
#define SYS_GPD_MFP3_PD14MFP_EPWM0_CH4        (0xBUL<<SYS_GPD_MFP3_PD14MFP_Pos)   /*!< GPD_MFP3 PD14 setting for EPWM0_CH4         */

/* PE.0 MFP */
#define SYS_GPE_MFP0_PE0MFP_GPIO              (0x0UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for GPIO               */
#define SYS_GPE_MFP0_PE0MFP_EBI_AD11          (0x2UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for EBI_AD11           */
#define SYS_GPE_MFP0_PE0MFP_QSPI0_MOSI0       (0x3UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for QSPI0_MOSI0        */
#define SYS_GPE_MFP0_PE0MFP_SC2_CLK           (0x4UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for SC2_CLK            */
#define SYS_GPE_MFP0_PE0MFP_I2S0_MCLK         (0x5UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for I2S0_MCLK          */
#define SYS_GPE_MFP0_PE0MFP_SPI1_MOSI         (0x6UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for SPI1_MOSI          */
#define SYS_GPE_MFP0_PE0MFP_UART3_RXD         (0x7UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for UART3_RXD          */
#define SYS_GPE_MFP0_PE0MFP_I2C1_SDA          (0x8UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for I2C1_SDA           */
#define SYS_GPE_MFP0_PE0MFP_UART4_nRTS        (0x9UL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for UART4_nRTS         */
#define SYS_GPE_MFP0_PE0MFP_UART8_RXD         (0xAUL<<SYS_GPE_MFP0_PE0MFP_Pos)    /*!< GPE_MFP0 PE0 setting for UART8_RXD          */
#define SYS_GPE_MFP0_PE0MFP_LPIO0             (0x17UL<<SYS_GPE_MFP0_PE0MFP_Pos)   /*!< GPE_MFP0 PE0 setting for LPIO0              */

