OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PE.1 MFP */
#define SYS_GPE_MFP0_PE1MFP_GPIO              (0x0UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for GPIO               */
#define SYS_GPE_MFP0_PE1MFP_EBI_AD10          (0x2UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for EBI_AD10           */
#define SYS_GPE_MFP0_PE1MFP_QSPI0_MISO0       (0x3UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for QSPI0_MISO0        */
#define SYS_GPE_MFP0_PE1MFP_SC2_DAT           (0x4UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for SC2_DAT            */
#define SYS_GPE_MFP0_PE1MFP_I2S0_BCLK         (0x5UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for I2S0_BCLK          */
#define SYS_GPE_MFP0_PE1MFP_SPI1_MISO         (0x6UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for SPI1_MISO          */
#define SYS_GPE_MFP0_PE1MFP_UART3_TXD         (0x7UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for UART3_TXD          */
#define SYS_GPE_MFP0_PE1MFP_I2C1_SCL          (0x8UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for I2C1_SCL           */
#define SYS_GPE_MFP0_PE1MFP_UART4_nCTS        (0x9UL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for UART4_nCTS         */
#define SYS_GPE_MFP0_PE1MFP_UART8_TXD         (0xAUL<<SYS_GPE_MFP0_PE1MFP_Pos)    /*!< GPE_MFP0 PE1 setting for UART8_TXD          */
#define SYS_GPE_MFP0_PE1MFP_LPIO1             (0x17UL<<SYS_GPE_MFP0_PE1MFP_Pos)   /*!< GPE_MFP0 PE1 setting for LPIO1              */

/* PE.2 MFP */
#define SYS_GPE_MFP0_PE2MFP_GPIO              (0x0UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for GPIO               */
#define SYS_GPE_MFP0_PE2MFP_EBI_ALE           (0x2UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for EBI_ALE            */
#define SYS_GPE_MFP0_PE2MFP_SD0_DAT0          (0x3UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for SD0_DAT0           */
#define SYS_GPE_MFP0_PE2MFP_SPI3_MOSI         (0x5UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for SPI3_MOSI          */
#define SYS_GPE_MFP0_PE2MFP_SC0_CLK           (0x6UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for SC0_CLK            */
#define SYS_GPE_MFP0_PE2MFP_USCI0_CLK         (0x7UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for USCI0_CLK          */
#define SYS_GPE_MFP0_PE2MFP_UART6_nCTS        (0x8UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for UART6_nCTS         */
#define SYS_GPE_MFP0_PE2MFP_UART7_RXD         (0x9UL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for UART7_RXD          */
#define SYS_GPE_MFP0_PE2MFP_UART8_nRTS        (0xAUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for UART8_nRTS         */
#define SYS_GPE_MFP0_PE2MFP_EQEI0_B           (0xBUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for EQEI0_B            */
#define SYS_GPE_MFP0_PE2MFP_EPWM0_CH5         (0xCUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for EPWM0_CH5          */
#define SYS_GPE_MFP0_PE2MFP_BPWM0_CH0         (0xDUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for BPWM0_CH0          */
#define SYS_GPE_MFP0_PE2MFP_I2S0_MCLK         (0xEUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for I2S0_MCLK          */
#define SYS_GPE_MFP0_PE2MFP_SC2_CLK           (0xFUL<<SYS_GPE_MFP0_PE2MFP_Pos)    /*!< GPE_MFP0 PE2 setting for SC2_CLK            */

/* PE.3 MFP */
#define SYS_GPE_MFP0_PE3MFP_GPIO              (0x0UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for GPIO               */
#define SYS_GPE_MFP0_PE3MFP_EBI_MCLK          (0x2UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for EBI_MCLK           */
#define SYS_GPE_MFP0_PE3MFP_SD0_DAT1          (0x3UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for SD0_DAT1           */
#define SYS_GPE_MFP0_PE3MFP_SPI3_MISO         (0x5UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for SPI3_MISO          */
#define SYS_GPE_MFP0_PE3MFP_SC0_DAT           (0x6UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for SC0_DAT            */
#define SYS_GPE_MFP0_PE3MFP_USCI0_DAT0        (0x7UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for USCI0_DAT0         */
#define SYS_GPE_MFP0_PE3MFP_UART6_nRTS        (0x8UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for UART6_nRTS         */
#define SYS_GPE_MFP0_PE3MFP_UART7_TXD         (0x9UL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for UART7_TXD          */
#define SYS_GPE_MFP0_PE3MFP_UART8_nCTS        (0xAUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for UART8_nCTS         */
#define SYS_GPE_MFP0_PE3MFP_EQEI0_A           (0xBUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for EQEI0_A            */
#define SYS_GPE_MFP0_PE3MFP_EPWM0_CH4         (0xCUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for EPWM0_CH4          */
#define SYS_GPE_MFP0_PE3MFP_BPWM0_CH1         (0xDUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for BPWM0_CH1          */
#define SYS_GPE_MFP0_PE3MFP_I2S0_BCLK         (0xEUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for I2S0_BCLK          */
#define SYS_GPE_MFP0_PE3MFP_SC2_DAT           (0xFUL<<SYS_GPE_MFP0_PE3MFP_Pos)    /*!< GPE_MFP0 PE3 setting for SC2_DAT            */

/* PE.4 MFP */
#define SYS_GPE_MFP1_PE4MFP_GPIO              (0x0UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for GPIO               */
#define SYS_GPE_MFP1_PE4MFP_EBI_nWR           (0x2UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for EBI_nWR            */
#define SYS_GPE_MFP1_PE4MFP_SD0_DAT2          (0x3UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for SD0_DAT2           */
#define SYS_GPE_MFP1_PE4MFP_SPI3_CLK          (0x5UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for SPI3_CLK           */
#define SYS_GPE_MFP1_PE4MFP_SC0_RST           (0x6UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for SC0_RST            */
#define SYS_GPE_MFP1_PE4MFP_USCI0_DAT1        (0x7UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for USCI0_DAT1         */
#define SYS_GPE_MFP1_PE4MFP_UART6_RXD         (0x8UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for UART6_RXD          */
#define SYS_GPE_MFP1_PE4MFP_UART7_nCTS        (0x9UL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for UART7_nCTS         */
#define SYS_GPE_MFP1_PE4MFP_UART9_RXD         (0xAUL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for UART9_RXD          */
#define SYS_GPE_MFP1_PE4MFP_EQEI0_INDEX       (0xBUL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for EQEI0_INDEX        */
#define SYS_GPE_MFP1_PE4MFP_EPWM0_CH3         (0xCUL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for EPWM0_CH3          */
#define SYS_GPE_MFP1_PE4MFP_BPWM0_CH2         (0xDUL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for BPWM0_CH2          */
#define SYS_GPE_MFP1_PE4MFP_SPI1_MOSI         (0xFUL<<SYS_GPE_MFP1_PE4MFP_Pos)    /*!< GPE_MFP1 PE4 setting for SPI1_MOSI          */
#define SYS_GPE_MFP1_PE4MFP_PSIO0_CH3         (0x11UL<<SYS_GPE_MFP1_PE4MFP_Pos)   /*!< GPE_MFP1 PE4 setting for PSIO0_CH3          */

/* PE.5 MFP */
#define SYS_GPE_MFP1_PE5MFP_GPIO              (0x0UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for GPIO               */
#define SYS_GPE_MFP1_PE5MFP_EBI_nRD           (0x2UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for EBI_nRD            */
#define SYS_GPE_MFP1_PE5MFP_SD0_DAT3          (0x3UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for SD0_DAT3           */
#define SYS_GPE_MFP1_PE5MFP_SPI3_SS           (0x5UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for SPI3_SS            */
#define SYS_GPE_MFP1_PE5MFP_SC0_PWR           (0x6UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for SC0_PWR            */
#define SYS_GPE_MFP1_PE5MFP_USCI0_CTL1        (0x7UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for USCI0_CTL1         */
#define SYS_GPE_MFP1_PE5MFP_UART6_TXD         (0x8UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for UART6_TXD          */
#define SYS_GPE_MFP1_PE5MFP_UART7_nRTS        (0x9UL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for UART7_nRTS         */
#define SYS_GPE_MFP1_PE5MFP_UART9_TXD         (0xAUL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for UART9_TXD          */
#define SYS_GPE_MFP1_PE5MFP_EQEI1_B           (0xBUL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for EQEI1_B            */
#define SYS_GPE_MFP1_PE5MFP_EPWM0_CH2         (0xCUL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for EPWM0_CH2          */
#define SYS_GPE_MFP1_PE5MFP_BPWM0_CH3         (0xDUL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for BPWM0_CH3          */
#define SYS_GPE_MFP1_PE5MFP_SPI1_MISO         (0xFUL<<SYS_GPE_MFP1_PE5MFP_Pos)    /*!< GPE_MFP1 PE5 setting for SPI1_MISO          */
#define SYS_GPE_MFP1_PE5MFP_PSIO0_CH2         (0x11UL<<SYS_GPE_MFP1_PE5MFP_Pos)   /*!< GPE_MFP1 PE5 setting for PSIO0_CH2          */

/* PE.6 MFP */
#define SYS_GPE_MFP1_PE6MFP_GPIO              (0x0UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for GPIO               */
#define SYS_GPE_MFP1_PE6MFP_EBI_AD11          (0x2UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for EBI_AD11           */
#define SYS_GPE_MFP1_PE6MFP_SD0_CLK           (0x3UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for SD0_CLK            */
#define SYS_GPE_MFP1_PE6MFP_SPI3_I2SMCLK      (0x5UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for SPI3_I2SMCLK       */
#define SYS_GPE_MFP1_PE6MFP_SC0_nCD           (0x6UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for SC0_nCD            */
#define SYS_GPE_MFP1_PE6MFP_USCI0_CTL0        (0x7UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for USCI0_CTL0         */
#define SYS_GPE_MFP1_PE6MFP_UART5_RXD         (0x8UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for UART5_RXD          */
#define SYS_GPE_MFP1_PE6MFP_CANFD1_RXD        (0x9UL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for CANFD1_RXD         */
#define SYS_GPE_MFP1_PE6MFP_UART9_nRTS        (0xAUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for UART9_nRTS         */
#define SYS_GPE_MFP1_PE6MFP_EQEI1_A           (0xBUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for EQEI1_A            */
#define SYS_GPE_MFP1_PE6MFP_EPWM0_CH1         (0xCUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for EPWM0_CH1          */
#define SYS_GPE_MFP1_PE6MFP_BPWM0_CH4         (0xDUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for BPWM0_CH4          */
#define SYS_GPE_MFP1_PE6MFP_ACMP3_O           (0xEUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for ACMP3_O            */
#define SYS_GPE_MFP1_PE6MFP_QSPI0_MOSI0       (0xFUL<<SYS_GPE_MFP1_PE6MFP_Pos)    /*!< GPE_MFP1 PE6 setting for QSPI0_MOSI0        */
#define SYS_GPE_MFP1_PE6MFP_PSIO0_CH1         (0x11UL<<SYS_GPE_MFP1_PE6MFP_Pos)   /*!< GPE_MFP1 PE6 setting for PSIO0_CH1          */

/* PE.7 MFP */
#define SYS_GPE_MFP1_PE7MFP_GPIO              (0x0UL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for GPIO               */
#define SYS_GPE_MFP1_PE7MFP_EBI_AD10          (0x2UL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for EBI_AD10           */
#define SYS_GPE_MFP1_PE7MFP_SD0_CMD           (0x3UL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for SD0_CMD            */
#define SYS_GPE_MFP1_PE7MFP_UART5_TXD         (0x8UL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for UART5_TXD          */
#define SYS_GPE_MFP1_PE7MFP_CANFD1_TXD        (0x9UL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for CANFD1_TXD         */
#define SYS_GPE_MFP1_PE7MFP_UART9_nCTS        (0xAUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for UART9_nCTS         */
#define SYS_GPE_MFP1_PE7MFP_EQEI1_INDEX       (0xBUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for EQEI1_INDEX        */
#define SYS_GPE_MFP1_PE7MFP_EPWM0_CH0         (0xCUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for EPWM0_CH0          */
#define SYS_GPE_MFP1_PE7MFP_BPWM0_CH5         (0xDUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for BPWM0_CH5          */
#define SYS_GPE_MFP1_PE7MFP_ACMP2_O           (0xEUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for ACMP2_O            */
#define SYS_GPE_MFP1_PE7MFP_QSPI0_MISO0       (0xFUL<<SYS_GPE_MFP1_PE7MFP_Pos)    /*!< GPE_MFP1 PE7 setting for QSPI0_MISO0        */
#define SYS_GPE_MFP1_PE7MFP_PSIO0_CH0         (0x11UL<<SYS_GPE_MFP1_PE7MFP_Pos)   /*!< GPE_MFP1 PE7 setting for PSIO0_CH0          */

/* PE.8 MFP */
#define SYS_GPE_MFP2_PE8MFP_GPIO              (0x0UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for GPIO               */
#define SYS_GPE_MFP2_PE8MFP_EBI_ADR10         (0x2UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for EBI_ADR10          */
#define SYS_GPE_MFP2_PE8MFP_EMAC0_RMII_MDC    (0x3UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for EMAC0_RMII_MDC     */
#define SYS_GPE_MFP2_PE8MFP_I2S0_BCLK         (0x4UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for I2S0_BCLK          */
#define SYS_GPE_MFP2_PE8MFP_SPI2_CLK          (0x5UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for SPI2_CLK           */
#define SYS_GPE_MFP2_PE8MFP_UART2_TXD         (0x7UL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for UART2_TXD          */
#define SYS_GPE_MFP2_PE8MFP_EPWM0_CH0         (0xAUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for EPWM0_CH0          */
#define SYS_GPE_MFP2_PE8MFP_EPWM0_BRAKE0      (0xBUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for EPWM0_BRAKE0       */
#define SYS_GPE_MFP2_PE8MFP_ECAP0_IC0         (0xCUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for ECAP0_IC0          */
#define SYS_GPE_MFP2_PE8MFP_EQEI2_INDEX       (0xDUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for EQEI2_INDEX        */
#define SYS_GPE_MFP2_PE8MFP_TRACE_DATA3       (0xEUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for TRACE_DATA3        */
#define SYS_GPE_MFP2_PE8MFP_ECAP3_IC0         (0xFUL<<SYS_GPE_MFP2_PE8MFP_Pos)    /*!< GPE_MFP2 PE8 setting for ECAP3_IC0          */
#define SYS_GPE_MFP2_PE8MFP_DMIC0_DAT         (0x10UL<<SYS_GPE_MFP2_PE8MFP_Pos)   /*!< GPE_MFP2 PE8 setting for DMIC0_DAT          */

/* PE.9 MFP */
#define SYS_GPE_MFP2_PE9MFP_GPIO              (0x0UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for GPIO               */
#define SYS_GPE_MFP2_PE9MFP_EBI_ADR11         (0x2UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for EBI_ADR11          */
#define SYS_GPE_MFP2_PE9MFP_EMAC0_RMII_MDIO   (0x3UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for EMAC0_RMII_MDIO    */
#define SYS_GPE_MFP2_PE9MFP_I2S0_MCLK         (0x4UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for I2S0_MCLK          */
#define SYS_GPE_MFP2_PE9MFP_SPI2_MISO         (0x5UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for SPI2_MISO          */
#define SYS_GPE_MFP2_PE9MFP_UART2_RXD         (0x7UL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for UART2_RXD          */
#define SYS_GPE_MFP2_PE9MFP_EPWM0_CH1         (0xAUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for EPWM0_CH1          */
#define SYS_GPE_MFP2_PE9MFP_EPWM0_BRAKE1      (0xBUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for EPWM0_BRAKE1       */
#define SYS_GPE_MFP2_PE9MFP_ECAP0_IC1         (0xCUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for ECAP0_IC1          */
#define SYS_GPE_MFP2_PE9MFP_EQEI2_A           (0xDUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for EQEI2_A            */
#define SYS_GPE_MFP2_PE9MFP_TRACE_DATA2       (0xEUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for TRACE_DATA2        */
#define SYS_GPE_MFP2_PE9MFP_ECAP3_IC1         (0xFUL<<SYS_GPE_MFP2_PE9MFP_Pos)    /*!< GPE_MFP2 PE9 setting for ECAP3_IC1          */
#define SYS_GPE_MFP2_PE9MFP_DMIC0_CLK         (0x10UL<<SYS_GPE_MFP2_PE9MFP_Pos)   /*!< GPE_MFP2 PE9 setting for DMIC0_CLK          */

