OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PF.2 MFP */
#define SYS_GPF_MFP0_PF2MFP_GPIO              (0x0UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for GPIO               */
#define SYS_GPF_MFP0_PF2MFP_EBI_nCS1          (0x2UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for EBI_nCS1           */
#define SYS_GPF_MFP0_PF2MFP_UART0_RXD         (0x3UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for UART0_RXD          */
#define SYS_GPF_MFP0_PF2MFP_I2C0_SDA          (0x4UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for I2C0_SDA           */
#define SYS_GPF_MFP0_PF2MFP_QSPI0_CLK         (0x5UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for QSPI0_CLK          */
#define SYS_GPF_MFP0_PF2MFP_UART9_RXD         (0x7UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for UART9_RXD          */
#define SYS_GPF_MFP0_PF2MFP_I2C2_SMBSUS       (0x8UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for I2C2_SMBSUS        */
#define SYS_GPF_MFP0_PF2MFP_EPWM1_CH1         (0x9UL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for EPWM1_CH1          */
#define SYS_GPF_MFP0_PF2MFP_XT1_OUT           (0xAUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for XT1_OUT            */
#define SYS_GPF_MFP0_PF2MFP_BPWM1_CH1         (0xBUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for BPWM1_CH1          */
#define SYS_GPF_MFP0_PF2MFP_ACMP3_O           (0xDUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for ACMP3_O            */
#define SYS_GPF_MFP0_PF2MFP_SC1_RST           (0xEUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for SC1_RST            */
#define SYS_GPF_MFP0_PF2MFP_TM1_EXT           (0xFUL<<SYS_GPF_MFP0_PF2MFP_Pos)    /*!< GPF_MFP0 PF2 setting for TM1_EXT            */
#define SYS_GPF_MFP0_PF2MFP_LPUART0_RXD       (0x15UL<<SYS_GPF_MFP0_PF2MFP_Pos)   /*!< GPF_MFP0 PF2 setting for LPUART0_RXD        */
#define SYS_GPF_MFP0_PF2MFP_LPI2C0_SDA        (0x16UL<<SYS_GPF_MFP0_PF2MFP_Pos)   /*!< GPF_MFP0 PF2 setting for LPI2C0_SDA         */

/* PF.3 MFP */
#define SYS_GPF_MFP0_PF3MFP_GPIO              (0x0UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for GPIO               */
#define SYS_GPF_MFP0_PF3MFP_EBI_nCS0          (0x2UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for EBI_nCS0           */
#define SYS_GPF_MFP0_PF3MFP_UART0_TXD         (0x3UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for UART0_TXD          */
#define SYS_GPF_MFP0_PF3MFP_I2C0_SCL          (0x4UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for I2C0_SCL           */
#define SYS_GPF_MFP0_PF3MFP_UART9_TXD         (0x7UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for UART9_TXD          */
#define SYS_GPF_MFP0_PF3MFP_I2C2_SMBAL        (0x8UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for I2C2_SMBAL         */
#define SYS_GPF_MFP0_PF3MFP_EPWM1_CH0         (0x9UL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for EPWM1_CH0          */
#define SYS_GPF_MFP0_PF3MFP_XT1_IN            (0xAUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for XT1_IN             */
#define SYS_GPF_MFP0_PF3MFP_BPWM1_CH0         (0xBUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for BPWM1_CH0          */
#define SYS_GPF_MFP0_PF3MFP_ACMP2_O           (0xDUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for ACMP2_O            */
#define SYS_GPF_MFP0_PF3MFP_SC1_PWR           (0xEUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for SC1_PWR            */
#define SYS_GPF_MFP0_PF3MFP_TM0_EXT           (0xFUL<<SYS_GPF_MFP0_PF3MFP_Pos)    /*!< GPF_MFP0 PF3 setting for TM0_EXT            */
#define SYS_GPF_MFP0_PF3MFP_LPUART0_TXD       (0x15UL<<SYS_GPF_MFP0_PF3MFP_Pos)   /*!< GPF_MFP0 PF3 setting for LPUART0_TXD        */
#define SYS_GPF_MFP0_PF3MFP_LPI2C0_SCL        (0x16UL<<SYS_GPF_MFP0_PF3MFP_Pos)   /*!< GPF_MFP0 PF3 setting for LPI2C0_SCL         */

/* PF.4 MFP */
#define SYS_GPF_MFP1_PF4MFP_GPIO              (0x0UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for GPIO               */
#define SYS_GPF_MFP1_PF4MFP_UART2_TXD         (0x2UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART2_TXD          */
#define SYS_GPF_MFP1_PF4MFP_EBI_AD0           (0x3UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for EBI_AD0            */
#define SYS_GPF_MFP1_PF4MFP_UART2_nRTS        (0x4UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART2_nRTS         */
#define SYS_GPF_MFP1_PF4MFP_UART0_nRTS        (0x5UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART0_nRTS         */
#define SYS_GPF_MFP1_PF4MFP_UART3_RXD         (0x6UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for UART3_RXD          */
#define SYS_GPF_MFP1_PF4MFP_EPWM0_CH1         (0x7UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for EPWM0_CH1          */
#define SYS_GPF_MFP1_PF4MFP_BPWM0_CH5         (0x8UL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for BPWM0_CH5          */
#define SYS_GPF_MFP1_PF4MFP_X32_OUT           (0xAUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for X32_OUT            */
#define SYS_GPF_MFP1_PF4MFP_EQEI2_B           (0xDUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for EQEI2_B            */
#define SYS_GPF_MFP1_PF4MFP_PSIO0_CH1         (0xEUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for PSIO0_CH1          */
#define SYS_GPF_MFP1_PF4MFP_KPI_COL1          (0xFUL<<SYS_GPF_MFP1_PF4MFP_Pos)    /*!< GPF_MFP1 PF4 setting for KPI_COL1           */
#define SYS_GPF_MFP1_PF4MFP_SWODEC_SWO        (0x10UL<<SYS_GPF_MFP1_PF4MFP_Pos)   /*!< GPF_MFP1 PF4 setting for SWODEC_SWO         */
#define SYS_GPF_MFP1_PF4MFP_UTCPD0_VBSRCEN    (0x11UL<<SYS_GPF_MFP1_PF4MFP_Pos)   /*!< GPF_MFP1 PF4 setting for UTCPD0_VBSRCEN     */

/* PF.5 MFP */
#define SYS_GPF_MFP1_PF5MFP_GPIO              (0x0UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for GPIO               */
#define SYS_GPF_MFP1_PF5MFP_UART2_RXD         (0x2UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART2_RXD          */
#define SYS_GPF_MFP1_PF5MFP_EBI_AD1           (0x3UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EBI_AD1            */
#define SYS_GPF_MFP1_PF5MFP_UART2_nCTS        (0x4UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART2_nCTS         */
#define SYS_GPF_MFP1_PF5MFP_UART0_nCTS        (0x5UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART0_nCTS         */
#define SYS_GPF_MFP1_PF5MFP_UART3_TXD         (0x6UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for UART3_TXD          */
#define SYS_GPF_MFP1_PF5MFP_EPWM0_CH0         (0x7UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EPWM0_CH0          */
#define SYS_GPF_MFP1_PF5MFP_BPWM0_CH4         (0x8UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for BPWM0_CH4          */
#define SYS_GPF_MFP1_PF5MFP_EPWM0_SYNC_OUT    (0x9UL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EPWM0_SYNC_OUT     */
#define SYS_GPF_MFP1_PF5MFP_X32_IN            (0xAUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for X32_IN             */
#define SYS_GPF_MFP1_PF5MFP_EADC0_ST          (0xBUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EADC0_ST           */
#define SYS_GPF_MFP1_PF5MFP_EQEI2_A           (0xDUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for EQEI2_A            */
#define SYS_GPF_MFP1_PF5MFP_PSIO0_CH0         (0xEUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for PSIO0_CH0          */
#define SYS_GPF_MFP1_PF5MFP_KPI_COL0          (0xFUL<<SYS_GPF_MFP1_PF5MFP_Pos)    /*!< GPF_MFP1 PF5 setting for KPI_COL0           */
#define SYS_GPF_MFP1_PF5MFP_UTCPD0_VBSNKEN    (0x11UL<<SYS_GPF_MFP1_PF5MFP_Pos)   /*!< GPF_MFP1 PF5 setting for UTCPD0_VBSNKEN     */
#define SYS_GPF_MFP1_PF5MFP_LPADC0_ST         (0x17UL<<SYS_GPF_MFP1_PF5MFP_Pos)   /*!< GPF_MFP1 PF5 setting for LPADC0_ST          */

/* PF.6 MFP */
#define SYS_GPF_MFP1_PF6MFP_GPIO              (0x0UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for GPIO               */
#define SYS_GPF_MFP1_PF6MFP_EBI_ADR19         (0x2UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EBI_ADR19          */
#define SYS_GPF_MFP1_PF6MFP_SC0_CLK           (0x3UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for SC0_CLK            */
#define SYS_GPF_MFP1_PF6MFP_I2S0_LRCK         (0x4UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for I2S0_LRCK          */
#define SYS_GPF_MFP1_PF6MFP_SPI0_MOSI         (0x5UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for SPI0_MOSI          */
#define SYS_GPF_MFP1_PF6MFP_UART4_RXD         (0x6UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for UART4_RXD          */
#define SYS_GPF_MFP1_PF6MFP_EBI_nCS0          (0x7UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EBI_nCS0           */
#define SYS_GPF_MFP1_PF6MFP_SPI3_I2SMCLK      (0x9UL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for SPI3_I2SMCLK       */
#define SYS_GPF_MFP1_PF6MFP_TAMPER0           (0xAUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for TAMPER0            */
#define SYS_GPF_MFP1_PF6MFP_EQEI2_INDEX       (0xDUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for EQEI2_INDEX        */
#define SYS_GPF_MFP1_PF6MFP_TRACE_SWO         (0xEUL<<SYS_GPF_MFP1_PF6MFP_Pos)    /*!< GPF_MFP1 PF6 setting for TRACE_SWO          */

