OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PF.7 MFP */
#define SYS_GPF_MFP1_PF7MFP_GPIO              (0x0UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for GPIO               */
#define SYS_GPF_MFP1_PF7MFP_EBI_ADR18         (0x2UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for EBI_ADR18          */
#define SYS_GPF_MFP1_PF7MFP_SC0_DAT           (0x3UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for SC0_DAT            */
#define SYS_GPF_MFP1_PF7MFP_I2S0_DO           (0x4UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for I2S0_DO            */
#define SYS_GPF_MFP1_PF7MFP_SPI0_MISO         (0x5UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for SPI0_MISO          */
#define SYS_GPF_MFP1_PF7MFP_UART4_TXD         (0x6UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for UART4_TXD          */
#define SYS_GPF_MFP1_PF7MFP_CCAP_DATA0        (0x7UL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for CCAP_DATA0         */
#define SYS_GPF_MFP1_PF7MFP_TAMPER1           (0xAUL<<SYS_GPF_MFP1_PF7MFP_Pos)    /*!< GPF_MFP1 PF7 setting for TAMPER1            */

/* PF.8 MFP */
#define SYS_GPF_MFP2_PF8MFP_GPIO              (0x0UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for GPIO               */
#define SYS_GPF_MFP2_PF8MFP_EBI_ADR17         (0x2UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for EBI_ADR17          */
#define SYS_GPF_MFP2_PF8MFP_SC0_RST           (0x3UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for SC0_RST            */
#define SYS_GPF_MFP2_PF8MFP_I2S0_DI           (0x4UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for I2S0_DI            */
#define SYS_GPF_MFP2_PF8MFP_SPI0_CLK          (0x5UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for SPI0_CLK           */
#define SYS_GPF_MFP2_PF8MFP_UART5_nCTS        (0x6UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for UART5_nCTS         */
#define SYS_GPF_MFP2_PF8MFP_CCAP_DATA1        (0x7UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for CCAP_DATA1         */
#define SYS_GPF_MFP2_PF8MFP_CANFD1_RXD        (0x8UL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for CANFD1_RXD         */
#define SYS_GPF_MFP2_PF8MFP_TAMPER2           (0xAUL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for TAMPER2            */
#define SYS_GPF_MFP2_PF8MFP_UART9_RXD         (0xBUL<<SYS_GPF_MFP2_PF8MFP_Pos)    /*!< GPF_MFP2 PF8 setting for UART9_RXD          */

/* PF.9 MFP */
#define SYS_GPF_MFP2_PF9MFP_GPIO              (0x0UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for GPIO               */
#define SYS_GPF_MFP2_PF9MFP_EBI_ADR16         (0x2UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for EBI_ADR16          */
#define SYS_GPF_MFP2_PF9MFP_SC0_PWR           (0x3UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for SC0_PWR            */
#define SYS_GPF_MFP2_PF9MFP_I2S0_MCLK         (0x4UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for I2S0_MCLK          */
#define SYS_GPF_MFP2_PF9MFP_SPI0_SS           (0x5UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for SPI0_SS            */
#define SYS_GPF_MFP2_PF9MFP_UART5_nRTS        (0x6UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for UART5_nRTS         */
#define SYS_GPF_MFP2_PF9MFP_CCAP_DATA2        (0x7UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for CCAP_DATA2         */
#define SYS_GPF_MFP2_PF9MFP_CANFD1_TXD        (0x8UL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for CANFD1_TXD         */
#define SYS_GPF_MFP2_PF9MFP_TAMPER3           (0xAUL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for TAMPER3            */
#define SYS_GPF_MFP2_PF9MFP_UART9_TXD         (0xBUL<<SYS_GPF_MFP2_PF9MFP_Pos)    /*!< GPF_MFP2 PF9 setting for UART9_TXD          */

/* PF.10 MFP */
#define SYS_GPF_MFP2_PF10MFP_GPIO             (0x0UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for GPIO              */
#define SYS_GPF_MFP2_PF10MFP_EBI_ADR15        (0x2UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for EBI_ADR15         */
#define SYS_GPF_MFP2_PF10MFP_SC0_nCD          (0x3UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for SC0_nCD           */
#define SYS_GPF_MFP2_PF10MFP_I2S0_BCLK        (0x4UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for I2S0_BCLK         */
#define SYS_GPF_MFP2_PF10MFP_SPI0_I2SMCLK     (0x5UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for SPI0_I2SMCLK      */
#define SYS_GPF_MFP2_PF10MFP_UART5_RXD        (0x6UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for UART5_RXD         */
#define SYS_GPF_MFP2_PF10MFP_CCAP_DATA3       (0x7UL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for CCAP_DATA3        */
#define SYS_GPF_MFP2_PF10MFP_TAMPER4          (0xAUL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for TAMPER4           */
#define SYS_GPF_MFP2_PF10MFP_UART9_nRTS       (0xBUL<<SYS_GPF_MFP2_PF10MFP_Pos)   /*!< GPF_MFP2 PF10 setting for UART9_nRTS        */

/* PF.11 MFP */
#define SYS_GPF_MFP2_PF11MFP_GPIO             (0x0UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for GPIO              */
#define SYS_GPF_MFP2_PF11MFP_EBI_ADR14        (0x2UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for EBI_ADR14         */
#define SYS_GPF_MFP2_PF11MFP_SPI2_MOSI        (0x3UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for SPI2_MOSI         */
#define SYS_GPF_MFP2_PF11MFP_UART5_TXD        (0x6UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for UART5_TXD         */
#define SYS_GPF_MFP2_PF11MFP_CCAP_DATA4       (0x7UL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for CCAP_DATA4        */
#define SYS_GPF_MFP2_PF11MFP_TAMPER5          (0xAUL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for TAMPER5           */
#define SYS_GPF_MFP2_PF11MFP_UART9_nCTS       (0xBUL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for UART9_nCTS        */
#define SYS_GPF_MFP2_PF11MFP_TM3              (0xDUL<<SYS_GPF_MFP2_PF11MFP_Pos)   /*!< GPF_MFP2 PF11 setting for TM3               */

/* PG.0 MFP */
#define SYS_GPG_MFP0_PG0MFP_GPIO              (0x0UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for GPIO               */
#define SYS_GPG_MFP0_PG0MFP_EBI_ADR8          (0x2UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for EBI_ADR8           */
#define SYS_GPG_MFP0_PG0MFP_I2C0_SCL          (0x4UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for I2C0_SCL           */
#define SYS_GPG_MFP0_PG0MFP_I2C1_SMBAL        (0x5UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for I2C1_SMBAL         */
#define SYS_GPG_MFP0_PG0MFP_UART2_RXD         (0x6UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for UART2_RXD          */
#define SYS_GPG_MFP0_PG0MFP_CANFD1_TXD        (0x7UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for CANFD1_TXD         */
#define SYS_GPG_MFP0_PG0MFP_UART1_TXD         (0x8UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for UART1_TXD          */
#define SYS_GPG_MFP0_PG0MFP_I2C3_SCL          (0x9UL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for I2C3_SCL           */
#define SYS_GPG_MFP0_PG0MFP_I2S1_DO           (0xAUL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for I2S1_DO            */
#define SYS_GPG_MFP0_PG0MFP_EPWM0_CH1         (0xBUL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for EPWM0_CH1          */
#define SYS_GPG_MFP0_PG0MFP_CCAP_PIXCLK       (0xCUL<<SYS_GPG_MFP0_PG0MFP_Pos)    /*!< GPG_MFP0 PG0 setting for CCAP_PIXCLK        */

/* PG.1 MFP */
#define SYS_GPG_MFP0_PG1MFP_GPIO              (0x0UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for GPIO               */
#define SYS_GPG_MFP0_PG1MFP_EBI_ADR9          (0x2UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for EBI_ADR9           */
#define SYS_GPG_MFP0_PG1MFP_SPI2_I2SMCLK      (0x3UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for SPI2_I2SMCLK       */
#define SYS_GPG_MFP0_PG1MFP_I2C0_SDA          (0x4UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for I2C0_SDA           */
#define SYS_GPG_MFP0_PG1MFP_I2C1_SMBSUS       (0x5UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for I2C1_SMBSUS        */
#define SYS_GPG_MFP0_PG1MFP_UART2_TXD         (0x6UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for UART2_TXD          */
#define SYS_GPG_MFP0_PG1MFP_CANFD1_RXD        (0x7UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for CANFD1_RXD         */
#define SYS_GPG_MFP0_PG1MFP_UART1_RXD         (0x8UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for UART1_RXD          */
#define SYS_GPG_MFP0_PG1MFP_I2C3_SDA          (0x9UL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for I2C3_SDA           */
#define SYS_GPG_MFP0_PG1MFP_I2S1_LRCK         (0xAUL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for I2S1_LRCK          */
#define SYS_GPG_MFP0_PG1MFP_EPWM0_CH0         (0xBUL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for EPWM0_CH0          */
#define SYS_GPG_MFP0_PG1MFP_CCAP_SCLK         (0xCUL<<SYS_GPG_MFP0_PG1MFP_Pos)    /*!< GPG_MFP0 PG1 setting for CCAP_SCLK          */

/* PG.2 MFP */
#define SYS_GPG_MFP0_PG2MFP_GPIO              (0x0UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for GPIO               */
#define SYS_GPG_MFP0_PG2MFP_EBI_ADR11         (0x2UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for EBI_ADR11          */
#define SYS_GPG_MFP0_PG2MFP_SPI2_SS           (0x3UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for SPI2_SS            */
#define SYS_GPG_MFP0_PG2MFP_I2C0_SMBAL        (0x4UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C0_SMBAL         */
#define SYS_GPG_MFP0_PG2MFP_I2C1_SCL          (0x5UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C1_SCL           */
#define SYS_GPG_MFP0_PG2MFP_CCAP_DATA7        (0x7UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for CCAP_DATA7         */
#define SYS_GPG_MFP0_PG2MFP_I2C3_SMBAL        (0x9UL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for I2C3_SMBAL         */
#define SYS_GPG_MFP0_PG2MFP_SC1_nCD           (0xAUL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for SC1_nCD            */
#define SYS_GPG_MFP0_PG2MFP_SPI0_I2SMCLK      (0xBUL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for SPI0_I2SMCLK       */
#define SYS_GPG_MFP0_PG2MFP_TM0               (0xDUL<<SYS_GPG_MFP0_PG2MFP_Pos)    /*!< GPG_MFP0 PG2 setting for TM0                */
#define SYS_GPG_MFP0_PG2MFP_LPTM0             (0x17UL<<SYS_GPG_MFP0_PG2MFP_Pos)   /*!< GPG_MFP0 PG2 setting for LPTM0              */

