OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PH.1 MFP */
#define SYS_GPH_MFP0_PH1MFP_GPIO              (0x0UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for GPIO               */
#define SYS_GPH_MFP0_PH1MFP_EBI_ADR6          (0x2UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for EBI_ADR6           */
#define SYS_GPH_MFP0_PH1MFP_SPI3_MOSI         (0x3UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for SPI3_MOSI          */
#define SYS_GPH_MFP0_PH1MFP_UART5_RXD         (0x4UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for UART5_RXD          */
#define SYS_GPH_MFP0_PH1MFP_SC1_CLK           (0x5UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for SC1_CLK            */
#define SYS_GPH_MFP0_PH1MFP_I2C3_SDA          (0x8UL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for I2C3_SDA           */
#define SYS_GPH_MFP0_PH1MFP_TM1_EXT           (0xDUL<<SYS_GPH_MFP0_PH1MFP_Pos)    /*!< GPH_MFP0 PH1 setting for TM1_EXT            */

/* PH.2 MFP */
#define SYS_GPH_MFP0_PH2MFP_GPIO              (0x0UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for GPIO               */
#define SYS_GPH_MFP0_PH2MFP_EBI_ADR5          (0x2UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for EBI_ADR5           */
#define SYS_GPH_MFP0_PH2MFP_UART5_nRTS        (0x4UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for UART5_nRTS         */
#define SYS_GPH_MFP0_PH2MFP_UART4_TXD         (0x5UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for UART4_TXD          */
#define SYS_GPH_MFP0_PH2MFP_I2C0_SCL          (0x6UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for I2C0_SCL           */
#define SYS_GPH_MFP0_PH2MFP_UART9_RXD         (0x7UL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for UART9_RXD          */
#define SYS_GPH_MFP0_PH2MFP_TM2_EXT           (0xDUL<<SYS_GPH_MFP0_PH2MFP_Pos)    /*!< GPH_MFP0 PH2 setting for TM2_EXT            */

/* PH.3 MFP */
#define SYS_GPH_MFP0_PH3MFP_GPIO              (0x0UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for GPIO               */
#define SYS_GPH_MFP0_PH3MFP_EBI_ADR4          (0x2UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for EBI_ADR4           */
#define SYS_GPH_MFP0_PH3MFP_SPI1_I2SMCLK      (0x3UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for SPI1_I2SMCLK       */
#define SYS_GPH_MFP0_PH3MFP_UART5_nCTS        (0x4UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for UART5_nCTS         */
#define SYS_GPH_MFP0_PH3MFP_UART4_RXD         (0x5UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for UART4_RXD          */
#define SYS_GPH_MFP0_PH3MFP_I2C0_SDA          (0x6UL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for I2C0_SDA           */
#define SYS_GPH_MFP0_PH3MFP_TM3_EXT           (0xDUL<<SYS_GPH_MFP0_PH3MFP_Pos)    /*!< GPH_MFP0 PH3 setting for TM3_EXT            */

/* PH.4 MFP */
#define SYS_GPH_MFP1_PH4MFP_GPIO              (0x0UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for GPIO               */
#define SYS_GPH_MFP1_PH4MFP_EBI_ADR3          (0x2UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for EBI_ADR3           */
#define SYS_GPH_MFP1_PH4MFP_SPI1_MISO         (0x3UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for SPI1_MISO          */
#define SYS_GPH_MFP1_PH4MFP_UART7_nRTS        (0x4UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for UART7_nRTS         */
#define SYS_GPH_MFP1_PH4MFP_UART6_TXD         (0x5UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for UART6_TXD          */
#define SYS_GPH_MFP1_PH4MFP_SPI3_I2SMCLK      (0x9UL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for SPI3_I2SMCLK       */
#define SYS_GPH_MFP1_PH4MFP_EPWM0_CH5         (0xBUL<<SYS_GPH_MFP1_PH4MFP_Pos)    /*!< GPH_MFP1 PH4 setting for EPWM0_CH5          */

/* PH.5 MFP */
#define SYS_GPH_MFP1_PH5MFP_GPIO              (0x0UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for GPIO               */
#define SYS_GPH_MFP1_PH5MFP_EBI_ADR2          (0x2UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for EBI_ADR2           */
#define SYS_GPH_MFP1_PH5MFP_SPI1_MOSI         (0x3UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for SPI1_MOSI          */
#define SYS_GPH_MFP1_PH5MFP_UART7_nCTS        (0x4UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for UART7_nCTS         */
#define SYS_GPH_MFP1_PH5MFP_UART6_RXD         (0x5UL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for UART6_RXD          */
#define SYS_GPH_MFP1_PH5MFP_EPWM0_CH4         (0xBUL<<SYS_GPH_MFP1_PH5MFP_Pos)    /*!< GPH_MFP1 PH5 setting for EPWM0_CH4          */

/* PH.6 MFP */
#define SYS_GPH_MFP1_PH6MFP_GPIO              (0x0UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for GPIO               */
#define SYS_GPH_MFP1_PH6MFP_EBI_ADR1          (0x2UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for EBI_ADR1           */
#define SYS_GPH_MFP1_PH6MFP_SPI1_CLK          (0x3UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for SPI1_CLK           */
#define SYS_GPH_MFP1_PH6MFP_UART7_TXD         (0x4UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for UART7_TXD          */
#define SYS_GPH_MFP1_PH6MFP_UART9_nCTS        (0x7UL<<SYS_GPH_MFP1_PH6MFP_Pos)    /*!< GPH_MFP1 PH6 setting for UART9_nCTS         */

/* PH.7 MFP */
#define SYS_GPH_MFP1_PH7MFP_GPIO              (0x0UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for GPIO               */
#define SYS_GPH_MFP1_PH7MFP_EBI_ADR0          (0x2UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for EBI_ADR0           */
#define SYS_GPH_MFP1_PH7MFP_SPI1_SS           (0x3UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for SPI1_SS            */
#define SYS_GPH_MFP1_PH7MFP_UART7_RXD         (0x4UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for UART7_RXD          */
#define SYS_GPH_MFP1_PH7MFP_UART9_nRTS        (0x7UL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for UART9_nRTS         */
#define SYS_GPH_MFP1_PH7MFP_I2S1_BCLK         (0xBUL<<SYS_GPH_MFP1_PH7MFP_Pos)    /*!< GPH_MFP1 PH7 setting for I2S1_BCLK          */

/* PH.8 MFP */
#define SYS_GPH_MFP2_PH8MFP_GPIO              (0x0UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for GPIO               */
#define SYS_GPH_MFP2_PH8MFP_EBI_AD12          (0x2UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for EBI_AD12           */
#define SYS_GPH_MFP2_PH8MFP_QSPI0_CLK         (0x3UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for QSPI0_CLK          */
#define SYS_GPH_MFP2_PH8MFP_SC2_PWR           (0x4UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for SC2_PWR            */
#define SYS_GPH_MFP2_PH8MFP_I2S0_DI           (0x5UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for I2S0_DI            */
#define SYS_GPH_MFP2_PH8MFP_SPI1_CLK          (0x6UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for SPI1_CLK           */
#define SYS_GPH_MFP2_PH8MFP_UART3_nRTS        (0x7UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for UART3_nRTS         */
#define SYS_GPH_MFP2_PH8MFP_I2C1_SMBAL        (0x8UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for I2C1_SMBAL         */
#define SYS_GPH_MFP2_PH8MFP_I2C2_SCL          (0x9UL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for I2C2_SCL           */
#define SYS_GPH_MFP2_PH8MFP_UART1_TXD         (0xAUL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for UART1_TXD          */
#define SYS_GPH_MFP2_PH8MFP_UART9_nCTS        (0xDUL<<SYS_GPH_MFP2_PH8MFP_Pos)    /*!< GPH_MFP2 PH8 setting for UART9_nCTS         */
#define SYS_GPH_MFP2_PH8MFP_I3C0_SCL          (0x10UL<<SYS_GPH_MFP2_PH8MFP_Pos)   /*!< GPH_MFP2 PH8 setting for I3C0_SCL           */

/* PH.9 MFP */
#define SYS_GPH_MFP2_PH9MFP_GPIO              (0x0UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for GPIO               */
#define SYS_GPH_MFP2_PH9MFP_EBI_AD13          (0x2UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for EBI_AD13           */
#define SYS_GPH_MFP2_PH9MFP_QSPI0_SS          (0x3UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for QSPI0_SS           */
#define SYS_GPH_MFP2_PH9MFP_SC2_RST           (0x4UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for SC2_RST            */
#define SYS_GPH_MFP2_PH9MFP_I2S0_DO           (0x5UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for I2S0_DO            */
#define SYS_GPH_MFP2_PH9MFP_SPI1_SS           (0x6UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for SPI1_SS            */
#define SYS_GPH_MFP2_PH9MFP_UART3_nCTS        (0x7UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for UART3_nCTS         */
#define SYS_GPH_MFP2_PH9MFP_I2C1_SMBSUS       (0x8UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for I2C1_SMBSUS        */
#define SYS_GPH_MFP2_PH9MFP_I2C2_SDA          (0x9UL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for I2C2_SDA           */
#define SYS_GPH_MFP2_PH9MFP_UART1_RXD         (0xAUL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for UART1_RXD          */
#define SYS_GPH_MFP2_PH9MFP_UART9_nRTS        (0xDUL<<SYS_GPH_MFP2_PH9MFP_Pos)    /*!< GPH_MFP2 PH9 setting for UART9_nRTS         */
#define SYS_GPH_MFP2_PH9MFP_I3C0_SDA          (0x10UL<<SYS_GPH_MFP2_PH9MFP_Pos)   /*!< GPH_MFP2 PH9 setting for I3C0_SDA           */

/* PH.10 MFP */
#define SYS_GPH_MFP2_PH10MFP_GPIO             (0x0UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for GPIO              */
#define SYS_GPH_MFP2_PH10MFP_EBI_AD14         (0x2UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for EBI_AD14          */
#define SYS_GPH_MFP2_PH10MFP_QSPI0_MISO1      (0x3UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for QSPI0_MISO1       */
#define SYS_GPH_MFP2_PH10MFP_SC2_nCD          (0x4UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for SC2_nCD           */
#define SYS_GPH_MFP2_PH10MFP_I2S0_LRCK        (0x5UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for I2S0_LRCK         */
#define SYS_GPH_MFP2_PH10MFP_SPI1_I2SMCLK     (0x6UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for SPI1_I2SMCLK      */
#define SYS_GPH_MFP2_PH10MFP_UART4_TXD        (0x7UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for UART4_TXD         */
#define SYS_GPH_MFP2_PH10MFP_UART0_TXD        (0x8UL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for UART0_TXD         */
#define SYS_GPH_MFP2_PH10MFP_UART9_TXD        (0xDUL<<SYS_GPH_MFP2_PH10MFP_Pos)   /*!< GPH_MFP2 PH10 setting for UART9_TXD         */
#define SYS_GPH_MFP2_PH10MFP_I3C0_PUPEN       (0x10UL<<SYS_GPH_MFP2_PH10MFP_Pos)  /*!< GPH_MFP2 PH10 setting for I3C0_PUPEN        */
#define SYS_GPH_MFP2_PH10MFP_LPUART0_TXD      (0x15UL<<SYS_GPH_MFP2_PH10MFP_Pos)  /*!< GPH_MFP2 PH10 setting for LPUART0_TXD       */

/* PH.11 MFP */
#define SYS_GPH_MFP2_PH11MFP_GPIO             (0x0UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for GPIO              */
#define SYS_GPH_MFP2_PH11MFP_EBI_AD15         (0x2UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for EBI_AD15          */
#define SYS_GPH_MFP2_PH11MFP_QSPI0_MOSI1      (0x3UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for QSPI0_MOSI1       */
#define SYS_GPH_MFP2_PH11MFP_UART4_RXD        (0x7UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for UART4_RXD         */
#define SYS_GPH_MFP2_PH11MFP_UART0_RXD        (0x8UL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for UART0_RXD         */
#define SYS_GPH_MFP2_PH11MFP_EPWM0_CH5        (0xBUL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for EPWM0_CH5         */
#define SYS_GPH_MFP2_PH11MFP_UART9_RXD        (0xDUL<<SYS_GPH_MFP2_PH11MFP_Pos)   /*!< GPH_MFP2 PH11 setting for UART9_RXD         */
#define SYS_GPH_MFP2_PH11MFP_LPUART0_RXD      (0x15UL<<SYS_GPH_MFP2_PH11MFP_Pos)  /*!< GPH_MFP2 PH11 setting for LPUART0_RXD       */

/* PH.12 MFP */
#define SYS_GPH_MFP3_PH12MFP_GPIO             (0x0UL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for GPIO              */
#define SYS_GPH_MFP3_PH12MFP_EBI_AD0          (0x2UL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for EBI_AD0           */
#define SYS_GPH_MFP3_PH12MFP_UART9_TXD        (0x3UL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for UART9_TXD         */
#define SYS_GPH_MFP3_PH12MFP_QSPI1_MISO1      (0x6UL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for QSPI1_MISO1       */
#define SYS_GPH_MFP3_PH12MFP_CCAP_PIXCLK      (0x7UL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for CCAP_PIXCLK       */
#define SYS_GPH_MFP3_PH12MFP_SPIM0_CLKN       (0xCUL<<SYS_GPH_MFP3_PH12MFP_Pos)   /*!< GPH_MFP3 PH12 setting for SPIM0_CLKN        */

