OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PH.13 MFP */
#define SYS_GPH_MFP3_PH13MFP_GPIO             (0x0UL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for GPIO              */
#define SYS_GPH_MFP3_PH13MFP_EBI_AD1          (0x2UL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for EBI_AD1           */
#define SYS_GPH_MFP3_PH13MFP_UART9_RXD        (0x3UL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for UART9_RXD         */
#define SYS_GPH_MFP3_PH13MFP_QSPI1_MOSI1      (0x6UL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for QSPI1_MOSI1       */
#define SYS_GPH_MFP3_PH13MFP_CCAP_SCLK        (0x7UL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for CCAP_SCLK         */
#define SYS_GPH_MFP3_PH13MFP_SPIM0_CLK        (0xCUL<<SYS_GPH_MFP3_PH13MFP_Pos)   /*!< GPH_MFP3 PH13 setting for SPIM0_CLK         */

/* PH.14 MFP */
#define SYS_GPH_MFP3_PH14MFP_GPIO             (0x0UL<<SYS_GPH_MFP3_PH14MFP_Pos)   /*!< GPH_MFP3 PH14 setting for GPIO              */
#define SYS_GPH_MFP3_PH14MFP_EBI_AD2          (0x2UL<<SYS_GPH_MFP3_PH14MFP_Pos)   /*!< GPH_MFP3 PH14 setting for EBI_AD2           */
#define SYS_GPH_MFP3_PH14MFP_QSPI1_SS         (0x6UL<<SYS_GPH_MFP3_PH14MFP_Pos)   /*!< GPH_MFP3 PH14 setting for QSPI1_SS          */
#define SYS_GPH_MFP3_PH14MFP_CCAP_SFIELD      (0x7UL<<SYS_GPH_MFP3_PH14MFP_Pos)   /*!< GPH_MFP3 PH14 setting for CCAP_SFIELD       */
#define SYS_GPH_MFP3_PH14MFP_SPIM0_D4         (0xCUL<<SYS_GPH_MFP3_PH14MFP_Pos)   /*!< GPH_MFP3 PH14 setting for SPIM0_D4          */

/* PH.15 MFP */
#define SYS_GPH_MFP3_PH15MFP_GPIO             (0x0UL<<SYS_GPH_MFP3_PH15MFP_Pos)   /*!< GPH_MFP3 PH15 setting for GPIO              */
#define SYS_GPH_MFP3_PH15MFP_EBI_AD3          (0x2UL<<SYS_GPH_MFP3_PH15MFP_Pos)   /*!< GPH_MFP3 PH15 setting for EBI_AD3           */
#define SYS_GPH_MFP3_PH15MFP_QSPI1_CLK        (0x6UL<<SYS_GPH_MFP3_PH15MFP_Pos)   /*!< GPH_MFP3 PH15 setting for QSPI1_CLK         */
#define SYS_GPH_MFP3_PH15MFP_CCAP_VSYNC       (0x7UL<<SYS_GPH_MFP3_PH15MFP_Pos)   /*!< GPH_MFP3 PH15 setting for CCAP_VSYNC        */
#define SYS_GPH_MFP3_PH15MFP_SPIM0_D5         (0xCUL<<SYS_GPH_MFP3_PH15MFP_Pos)   /*!< GPH_MFP3 PH15 setting for SPIM0_D5          */

/* PI.6 MFP */
#define SYS_GPI_MFP1_PI6MFP_GPIO              (0x0UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for GPIO               */
#define SYS_GPI_MFP1_PI6MFP_SC1_nCD           (0x5UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for SC1_nCD            */
#define SYS_GPI_MFP1_PI6MFP_I2S0_BCLK         (0x6UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for I2S0_BCLK          */
#define SYS_GPI_MFP1_PI6MFP_SPI1_I2SMCLK      (0x7UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for SPI1_I2SMCLK       */
#define SYS_GPI_MFP1_PI6MFP_UART2_TXD         (0x8UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for UART2_TXD          */
#define SYS_GPI_MFP1_PI6MFP_I2C1_SCL          (0x9UL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for I2C1_SCL           */
#define SYS_GPI_MFP1_PI6MFP_USB_VBUS_ST       (0xFUL<<SYS_GPI_MFP1_PI6MFP_Pos)    /*!< GPI_MFP1 PI6 setting for USB_VBUS_ST        */

/* PI.7 MFP */
#define SYS_GPI_MFP1_PI7MFP_GPIO              (0x0UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for GPIO               */
#define SYS_GPI_MFP1_PI7MFP_SC1_PWR           (0x5UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for SC1_PWR            */
#define SYS_GPI_MFP1_PI7MFP_I2S0_MCLK         (0x6UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for I2S0_MCLK          */
#define SYS_GPI_MFP1_PI7MFP_SPI1_MISO         (0x7UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for SPI1_MISO          */
#define SYS_GPI_MFP1_PI7MFP_UART2_RXD         (0x8UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for UART2_RXD          */
#define SYS_GPI_MFP1_PI7MFP_I2C1_SDA          (0x9UL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for I2C1_SDA           */
#define SYS_GPI_MFP1_PI7MFP_USB_VBUS_EN       (0xFUL<<SYS_GPI_MFP1_PI7MFP_Pos)    /*!< GPI_MFP1 PI7 setting for USB_VBUS_EN        */

/* PI.8 MFP */
#define SYS_GPI_MFP2_PI8MFP_GPIO              (0x0UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for GPIO               */
#define SYS_GPI_MFP2_PI8MFP_SC1_RST           (0x5UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for SC1_RST            */
#define SYS_GPI_MFP2_PI8MFP_I2S0_DI           (0x6UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for I2S0_DI            */
#define SYS_GPI_MFP2_PI8MFP_SPI1_MOSI         (0x7UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for SPI1_MOSI          */
#define SYS_GPI_MFP2_PI8MFP_UART2_nRTS        (0x8UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for UART2_nRTS         */
#define SYS_GPI_MFP2_PI8MFP_I2C0_SMBAL        (0x9UL<<SYS_GPI_MFP2_PI8MFP_Pos)    /*!< GPI_MFP2 PI8 setting for I2C0_SMBAL         */

/* PI.9 MFP */
#define SYS_GPI_MFP2_PI9MFP_GPIO              (0x0UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for GPIO               */
#define SYS_GPI_MFP2_PI9MFP_SC1_DAT           (0x5UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for SC1_DAT            */
#define SYS_GPI_MFP2_PI9MFP_I2S0_DO           (0x6UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for I2S0_DO            */
#define SYS_GPI_MFP2_PI9MFP_SPI1_CLK          (0x7UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for SPI1_CLK           */
#define SYS_GPI_MFP2_PI9MFP_UART2_nCTS        (0x8UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for UART2_nCTS         */
#define SYS_GPI_MFP2_PI9MFP_I2C0_SMBSUS       (0x9UL<<SYS_GPI_MFP2_PI9MFP_Pos)    /*!< GPI_MFP2 PI9 setting for I2C0_SMBSUS        */

/* PI.10 MFP */
#define SYS_GPI_MFP2_PI10MFP_GPIO             (0x0UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for GPIO              */
#define SYS_GPI_MFP2_PI10MFP_SC1_CLK          (0x5UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for SC1_CLK           */
#define SYS_GPI_MFP2_PI10MFP_I2S0_LRCK        (0x6UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for I2S0_LRCK         */
#define SYS_GPI_MFP2_PI10MFP_SPI1_SS          (0x7UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for SPI1_SS           */
#define SYS_GPI_MFP2_PI10MFP_UART2_TXD        (0x8UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for UART2_TXD         */
#define SYS_GPI_MFP2_PI10MFP_I2C0_SCL         (0x9UL<<SYS_GPI_MFP2_PI10MFP_Pos)   /*!< GPI_MFP2 PI10 setting for I2C0_SCL          */

/* PI.11 MFP */
#define SYS_GPI_MFP2_PI11MFP_GPIO             (0x0UL<<SYS_GPI_MFP2_PI11MFP_Pos)   /*!< GPI_MFP2 PI11 setting for GPIO              */
#define SYS_GPI_MFP2_PI11MFP_UART2_RXD        (0x8UL<<SYS_GPI_MFP2_PI11MFP_Pos)   /*!< GPI_MFP2 PI11 setting for UART2_RXD         */
#define SYS_GPI_MFP2_PI11MFP_I2C0_SDA         (0x9UL<<SYS_GPI_MFP2_PI11MFP_Pos)   /*!< GPI_MFP2 PI11 setting for I2C0_SDA          */

/* PI.12 MFP */
#define SYS_GPI_MFP3_PI12MFP_GPIO             (0x0UL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for GPIO              */
#define SYS_GPI_MFP3_PI12MFP_QSPI0_MISO1      (0x4UL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for QSPI0_MISO1       */
#define SYS_GPI_MFP3_PI12MFP_CANFD0_TXD       (0xAUL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for CANFD0_TXD        */
#define SYS_GPI_MFP3_PI12MFP_UART4_TXD        (0xBUL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for UART4_TXD         */
#define SYS_GPI_MFP3_PI12MFP_EPWM1_CH0        (0xCUL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for EPWM1_CH0         */
#define SYS_GPI_MFP3_PI12MFP_I2C3_SMBAL       (0xFUL<<SYS_GPI_MFP3_PI12MFP_Pos)   /*!< GPI_MFP3 PI12 setting for I2C3_SMBAL        */

