OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PI.13 MFP */
#define SYS_GPI_MFP3_PI13MFP_GPIO             (0x0UL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for GPIO              */
#define SYS_GPI_MFP3_PI13MFP_QSPI0_MOSI1      (0x4UL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for QSPI0_MOSI1       */
#define SYS_GPI_MFP3_PI13MFP_CANFD0_RXD       (0xAUL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for CANFD0_RXD        */
#define SYS_GPI_MFP3_PI13MFP_UART4_RXD        (0xBUL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for UART4_RXD         */
#define SYS_GPI_MFP3_PI13MFP_EPWM1_CH1        (0xCUL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for EPWM1_CH1         */
#define SYS_GPI_MFP3_PI13MFP_I2C3_SMBSUS      (0xFUL<<SYS_GPI_MFP3_PI13MFP_Pos)   /*!< GPI_MFP3 PI13 setting for I2C3_SMBSUS       */

/* PI.14 MFP */
#define SYS_GPI_MFP3_PI14MFP_GPIO             (0x0UL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for GPIO              */
#define SYS_GPI_MFP3_PI14MFP_QSPI0_SS         (0x4UL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for QSPI0_SS          */
#define SYS_GPI_MFP3_PI14MFP_UART8_nCTS       (0x7UL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for UART8_nCTS        */
#define SYS_GPI_MFP3_PI14MFP_CANFD1_TXD       (0xAUL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for CANFD1_TXD        */
#define SYS_GPI_MFP3_PI14MFP_UART3_TXD        (0xBUL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for UART3_TXD         */
#define SYS_GPI_MFP3_PI14MFP_EPWM1_CH2        (0xCUL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for EPWM1_CH2         */
#define SYS_GPI_MFP3_PI14MFP_I2C3_SCL         (0xFUL<<SYS_GPI_MFP3_PI14MFP_Pos)   /*!< GPI_MFP3 PI14 setting for I2C3_SCL          */

/* PI.15 MFP */
#define SYS_GPI_MFP3_PI15MFP_GPIO             (0x0UL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for GPIO              */
#define SYS_GPI_MFP3_PI15MFP_QSPI0_CLK        (0x4UL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for QSPI0_CLK         */
#define SYS_GPI_MFP3_PI15MFP_UART8_nRTS       (0x7UL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for UART8_nRTS        */
#define SYS_GPI_MFP3_PI15MFP_CANFD1_RXD       (0xAUL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for CANFD1_RXD        */
#define SYS_GPI_MFP3_PI15MFP_UART3_RXD        (0xBUL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for UART3_RXD         */
#define SYS_GPI_MFP3_PI15MFP_EPWM1_CH3        (0xCUL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for EPWM1_CH3         */
#define SYS_GPI_MFP3_PI15MFP_I2C3_SDA         (0xFUL<<SYS_GPI_MFP3_PI15MFP_Pos)   /*!< GPI_MFP3 PI15 setting for I2C3_SDA          */

/* PJ.0 MFP */
#define SYS_GPJ_MFP0_PJ0MFP_GPIO              (0x0UL<<SYS_GPJ_MFP0_PJ0MFP_Pos)    /*!< GPJ_MFP0 PJ0 setting for GPIO               */
#define SYS_GPJ_MFP0_PJ0MFP_UTCPD0_DISCHG     (0x2UL<<SYS_GPJ_MFP0_PJ0MFP_Pos)    /*!< GPJ_MFP0 PJ0 setting for UTCPD0_DISCHG      */
#define SYS_GPJ_MFP0_PJ0MFP_QSPI0_MISO0       (0x4UL<<SYS_GPJ_MFP0_PJ0MFP_Pos)    /*!< GPJ_MFP0 PJ0 setting for QSPI0_MISO0        */
#define SYS_GPJ_MFP0_PJ0MFP_UART8_TXD         (0x7UL<<SYS_GPJ_MFP0_PJ0MFP_Pos)    /*!< GPJ_MFP0 PJ0 setting for UART8_TXD          */
#define SYS_GPJ_MFP0_PJ0MFP_EPWM1_CH4         (0xCUL<<SYS_GPJ_MFP0_PJ0MFP_Pos)    /*!< GPJ_MFP0 PJ0 setting for EPWM1_CH4          */

/* PJ.1 MFP */
#define SYS_GPJ_MFP0_PJ1MFP_GPIO              (0x0UL<<SYS_GPJ_MFP0_PJ1MFP_Pos)    /*!< GPJ_MFP0 PJ1 setting for GPIO               */
#define SYS_GPJ_MFP0_PJ1MFP_QSPI0_MOSI0       (0x4UL<<SYS_GPJ_MFP0_PJ1MFP_Pos)    /*!< GPJ_MFP0 PJ1 setting for QSPI0_MOSI0        */
#define SYS_GPJ_MFP0_PJ1MFP_UART8_RXD         (0x7UL<<SYS_GPJ_MFP0_PJ1MFP_Pos)    /*!< GPJ_MFP0 PJ1 setting for UART8_RXD          */
#define SYS_GPJ_MFP0_PJ1MFP_EPWM1_CH5         (0xCUL<<SYS_GPJ_MFP0_PJ1MFP_Pos)    /*!< GPJ_MFP0 PJ1 setting for EPWM1_CH5          */

/* PJ.2 MFP */
#define SYS_GPJ_MFP0_PJ2MFP_GPIO              (0x0UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for GPIO               */
#define SYS_GPJ_MFP0_PJ2MFP_EBI_AD5           (0x2UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for EBI_AD5            */
#define SYS_GPJ_MFP0_PJ2MFP_UART8_nCTS        (0x3UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for UART8_nCTS         */
#define SYS_GPJ_MFP0_PJ2MFP_I2C3_SMBAL        (0x5UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for I2C3_SMBAL         */
#define SYS_GPJ_MFP0_PJ2MFP_QSPI1_SS          (0x6UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for QSPI1_SS           */
#define SYS_GPJ_MFP0_PJ2MFP_CCAP_DATA5        (0x7UL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for CCAP_DATA5         */
#define SYS_GPJ_MFP0_PJ2MFP_CANFD0_TXD        (0xAUL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for CANFD0_TXD         */
#define SYS_GPJ_MFP0_PJ2MFP_SPIM0_RESETN      (0xCUL<<SYS_GPJ_MFP0_PJ2MFP_Pos)    /*!< GPJ_MFP0 PJ2 setting for SPIM0_RESETN       */

/* PJ.3 MFP */
#define SYS_GPJ_MFP0_PJ3MFP_GPIO              (0x0UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for GPIO               */
#define SYS_GPJ_MFP0_PJ3MFP_EBI_AD4           (0x2UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for EBI_AD4            */
#define SYS_GPJ_MFP0_PJ3MFP_UART8_nRTS        (0x3UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for UART8_nRTS         */
#define SYS_GPJ_MFP0_PJ3MFP_I2C3_SMBSUS       (0x5UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for I2C3_SMBSUS        */
#define SYS_GPJ_MFP0_PJ3MFP_QSPI1_CLK         (0x6UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for QSPI1_CLK          */
#define SYS_GPJ_MFP0_PJ3MFP_CCAP_DATA4        (0x7UL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for CCAP_DATA4         */
#define SYS_GPJ_MFP0_PJ3MFP_CANFD0_RXD        (0xAUL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for CANFD0_RXD         */
#define SYS_GPJ_MFP0_PJ3MFP_SPIM0_MOSI        (0xCUL<<SYS_GPJ_MFP0_PJ3MFP_Pos)    /*!< GPJ_MFP0 PJ3 setting for SPIM0_MOSI         */

/* PJ.4 MFP */
#define SYS_GPJ_MFP1_PJ4MFP_GPIO              (0x0UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for GPIO               */
#define SYS_GPJ_MFP1_PJ4MFP_EBI_AD3           (0x2UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for EBI_AD3            */
#define SYS_GPJ_MFP1_PJ4MFP_UART8_TXD         (0x3UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for UART8_TXD          */
#define SYS_GPJ_MFP1_PJ4MFP_I2C3_SCL          (0x5UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for I2C3_SCL           */
#define SYS_GPJ_MFP1_PJ4MFP_QSPI1_MISO0       (0x6UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for QSPI1_MISO0        */
#define SYS_GPJ_MFP1_PJ4MFP_CCAP_DATA3        (0x7UL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for CCAP_DATA3         */
#define SYS_GPJ_MFP1_PJ4MFP_CANFD1_TXD        (0xAUL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for CANFD1_TXD         */
#define SYS_GPJ_MFP1_PJ4MFP_SPIM0_MISO        (0xCUL<<SYS_GPJ_MFP1_PJ4MFP_Pos)    /*!< GPJ_MFP1 PJ4 setting for SPIM0_MISO         */

/* PJ.5 MFP */
#define SYS_GPJ_MFP1_PJ5MFP_GPIO              (0x0UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for GPIO               */
#define SYS_GPJ_MFP1_PJ5MFP_EBI_AD2           (0x2UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for EBI_AD2            */
#define SYS_GPJ_MFP1_PJ5MFP_UART8_RXD         (0x3UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for UART8_RXD          */
#define SYS_GPJ_MFP1_PJ5MFP_I2C3_SDA          (0x5UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for I2C3_SDA           */
#define SYS_GPJ_MFP1_PJ5MFP_QSPI1_MOSI0       (0x6UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for QSPI1_MOSI0        */
#define SYS_GPJ_MFP1_PJ5MFP_CCAP_DATA2        (0x7UL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for CCAP_DATA2         */
#define SYS_GPJ_MFP1_PJ5MFP_CANFD1_RXD        (0xAUL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for CANFD1_RXD         */
#define SYS_GPJ_MFP1_PJ5MFP_SPIM0_D2          (0xCUL<<SYS_GPJ_MFP1_PJ5MFP_Pos)    /*!< GPJ_MFP1 PJ5 setting for SPIM0_D2           */

