OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
/* PJ.6 MFP */
#define SYS_GPJ_MFP1_PJ6MFP_GPIO              (0x0UL<<SYS_GPJ_MFP1_PJ6MFP_Pos)    /*!< GPJ_MFP1 PJ6 setting for GPIO               */
#define SYS_GPJ_MFP1_PJ6MFP_EBI_AD1           (0x2UL<<SYS_GPJ_MFP1_PJ6MFP_Pos)    /*!< GPJ_MFP1 PJ6 setting for EBI_AD1            */
#define SYS_GPJ_MFP1_PJ6MFP_UART9_nCTS        (0x3UL<<SYS_GPJ_MFP1_PJ6MFP_Pos)    /*!< GPJ_MFP1 PJ6 setting for UART9_nCTS         */
#define SYS_GPJ_MFP1_PJ6MFP_CCAP_DATA1        (0x7UL<<SYS_GPJ_MFP1_PJ6MFP_Pos)    /*!< GPJ_MFP1 PJ6 setting for CCAP_DATA1         */
#define SYS_GPJ_MFP1_PJ6MFP_SPIM0_D3          (0xCUL<<SYS_GPJ_MFP1_PJ6MFP_Pos)    /*!< GPJ_MFP1 PJ6 setting for SPIM0_D3           */

/* PJ.7 MFP */
#define SYS_GPJ_MFP1_PJ7MFP_GPIO              (0x0UL<<SYS_GPJ_MFP1_PJ7MFP_Pos)    /*!< GPJ_MFP1 PJ7 setting for GPIO               */
#define SYS_GPJ_MFP1_PJ7MFP_EBI_AD0           (0x2UL<<SYS_GPJ_MFP1_PJ7MFP_Pos)    /*!< GPJ_MFP1 PJ7 setting for EBI_AD0            */
#define SYS_GPJ_MFP1_PJ7MFP_UART9_nRTS        (0x3UL<<SYS_GPJ_MFP1_PJ7MFP_Pos)    /*!< GPJ_MFP1 PJ7 setting for UART9_nRTS         */
#define SYS_GPJ_MFP1_PJ7MFP_CCAP_DATA0        (0x7UL<<SYS_GPJ_MFP1_PJ7MFP_Pos)    /*!< GPJ_MFP1 PJ7 setting for CCAP_DATA0         */
#define SYS_GPJ_MFP1_PJ7MFP_SPIM0_SS          (0xCUL<<SYS_GPJ_MFP1_PJ7MFP_Pos)    /*!< GPJ_MFP1 PJ7 setting for SPIM0_SS           */

/* PJ.8 MFP */
#define SYS_GPJ_MFP2_PJ8MFP_GPIO              (0x0UL<<SYS_GPJ_MFP2_PJ8MFP_Pos)    /*!< GPJ_MFP2 PJ8 setting for GPIO               */
#define SYS_GPJ_MFP2_PJ8MFP_EBI_nRD           (0x2UL<<SYS_GPJ_MFP2_PJ8MFP_Pos)    /*!< GPJ_MFP2 PJ8 setting for EBI_nRD            */
#define SYS_GPJ_MFP2_PJ8MFP_SD1_DAT3          (0x3UL<<SYS_GPJ_MFP2_PJ8MFP_Pos)    /*!< GPJ_MFP2 PJ8 setting for SD1_DAT3           */
#define SYS_GPJ_MFP2_PJ8MFP_UART7_TXD         (0x6UL<<SYS_GPJ_MFP2_PJ8MFP_Pos)    /*!< GPJ_MFP2 PJ8 setting for UART7_TXD          */
#define SYS_GPJ_MFP2_PJ8MFP_BPWM0_CH5         (0xCUL<<SYS_GPJ_MFP2_PJ8MFP_Pos)    /*!< GPJ_MFP2 PJ8 setting for BPWM0_CH5          */

/* PJ.9 MFP */
#define SYS_GPJ_MFP2_PJ9MFP_GPIO              (0x0UL<<SYS_GPJ_MFP2_PJ9MFP_Pos)    /*!< GPJ_MFP2 PJ9 setting for GPIO               */
#define SYS_GPJ_MFP2_PJ9MFP_EBI_nWR           (0x2UL<<SYS_GPJ_MFP2_PJ9MFP_Pos)    /*!< GPJ_MFP2 PJ9 setting for EBI_nWR            */
#define SYS_GPJ_MFP2_PJ9MFP_SD1_DAT2          (0x3UL<<SYS_GPJ_MFP2_PJ9MFP_Pos)    /*!< GPJ_MFP2 PJ9 setting for SD1_DAT2           */
#define SYS_GPJ_MFP2_PJ9MFP_UART7_RXD         (0x6UL<<SYS_GPJ_MFP2_PJ9MFP_Pos)    /*!< GPJ_MFP2 PJ9 setting for UART7_RXD          */
#define SYS_GPJ_MFP2_PJ9MFP_BPWM0_CH4         (0xCUL<<SYS_GPJ_MFP2_PJ9MFP_Pos)    /*!< GPJ_MFP2 PJ9 setting for BPWM0_CH4          */

/* PJ.10 MFP */
#define SYS_GPJ_MFP2_PJ10MFP_GPIO             (0x0UL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for GPIO              */
#define SYS_GPJ_MFP2_PJ10MFP_EBI_MCLK         (0x2UL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for EBI_MCLK          */
#define SYS_GPJ_MFP2_PJ10MFP_SD1_DAT1         (0x3UL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for SD1_DAT1          */
#define SYS_GPJ_MFP2_PJ10MFP_UART6_TXD        (0x6UL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for UART6_TXD         */
#define SYS_GPJ_MFP2_PJ10MFP_ECAP2_IC0        (0x9UL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for ECAP2_IC0         */
#define SYS_GPJ_MFP2_PJ10MFP_CANFD0_TXD       (0xBUL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for CANFD0_TXD        */
#define SYS_GPJ_MFP2_PJ10MFP_BPWM0_CH3        (0xCUL<<SYS_GPJ_MFP2_PJ10MFP_Pos)   /*!< GPJ_MFP2 PJ10 setting for BPWM0_CH3         */

/* PJ.11 MFP */
#define SYS_GPJ_MFP2_PJ11MFP_GPIO             (0x0UL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for GPIO              */
#define SYS_GPJ_MFP2_PJ11MFP_EBI_ALE          (0x2UL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for EBI_ALE           */
#define SYS_GPJ_MFP2_PJ11MFP_SD1_DAT0         (0x3UL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for SD1_DAT0          */
#define SYS_GPJ_MFP2_PJ11MFP_UART6_RXD        (0x6UL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for UART6_RXD         */
#define SYS_GPJ_MFP2_PJ11MFP_ECAP2_IC1        (0x9UL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for ECAP2_IC1         */
#define SYS_GPJ_MFP2_PJ11MFP_CANFD0_RXD       (0xBUL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for CANFD0_RXD        */
#define SYS_GPJ_MFP2_PJ11MFP_BPWM0_CH2        (0xCUL<<SYS_GPJ_MFP2_PJ11MFP_Pos)   /*!< GPJ_MFP2 PJ11 setting for BPWM0_CH2         */

/* PJ.12 MFP */
#define SYS_GPJ_MFP3_PJ12MFP_GPIO             (0x0UL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for GPIO              */
#define SYS_GPJ_MFP3_PJ12MFP_EBI_nCS0         (0x2UL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for EBI_nCS0          */
#define SYS_GPJ_MFP3_PJ12MFP_SD1_CMD          (0x3UL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for SD1_CMD           */
#define SYS_GPJ_MFP3_PJ12MFP_ECAP2_IC2        (0x9UL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for ECAP2_IC2         */
#define SYS_GPJ_MFP3_PJ12MFP_CANFD1_TXD       (0xBUL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for CANFD1_TXD        */
#define SYS_GPJ_MFP3_PJ12MFP_BPWM0_CH1        (0xCUL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for BPWM0_CH1         */
#define SYS_GPJ_MFP3_PJ12MFP_HSUSB_VBUS_ST    (0xFUL<<SYS_GPJ_MFP3_PJ12MFP_Pos)   /*!< GPJ_MFP3 PJ12 setting for HSUSB_VBUS_ST     */

/* PJ.13 MFP */
#define SYS_GPJ_MFP3_PJ13MFP_GPIO             (0x0UL<<SYS_GPJ_MFP3_PJ13MFP_Pos)   /*!< GPJ_MFP3 PJ13 setting for GPIO              */
#define SYS_GPJ_MFP3_PJ13MFP_SD1_CLK          (0x3UL<<SYS_GPJ_MFP3_PJ13MFP_Pos)   /*!< GPJ_MFP3 PJ13 setting for SD1_CLK           */
#define SYS_GPJ_MFP3_PJ13MFP_CANFD1_RXD       (0xBUL<<SYS_GPJ_MFP3_PJ13MFP_Pos)   /*!< GPJ_MFP3 PJ13 setting for CANFD1_RXD        */
#define SYS_GPJ_MFP3_PJ13MFP_BPWM0_CH0        (0xCUL<<SYS_GPJ_MFP3_PJ13MFP_Pos)   /*!< GPJ_MFP3 PJ13 setting for BPWM0_CH0         */
#define SYS_GPJ_MFP3_PJ13MFP_HSUSB_VBUS_EN    (0xFUL<<SYS_GPJ_MFP3_PJ13MFP_Pos)   /*!< GPJ_MFP3 PJ13 setting for HSUSB_VBUS_EN     */

