OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_CANFD1_RXD_PJ5()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_CANFD1_RXD)                    /*!< Set PJ5 function to CANFD1_RXD          */
#define SET_CANFD1_TXD_PB7()        SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_CANFD1_TXD)                    /*!< Set PB7 function to CANFD1_TXD          */
#define SET_CANFD1_TXD_PC10()       SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_CANFD1_TXD)                  /*!< Set PC10 function to CANFD1_TXD         */
#define SET_CANFD1_TXD_PC13()       SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_CANFD1_TXD)                  /*!< Set PC13 function to CANFD1_TXD         */
#define SET_CANFD1_TXD_PC3()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_CANFD1_TXD)                    /*!< Set PC3 function to CANFD1_TXD          */
#define SET_CANFD1_TXD_PE7()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_CANFD1_TXD)                    /*!< Set PE7 function to CANFD1_TXD          */
#define SET_CANFD1_TXD_PF9()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_CANFD1_TXD)                    /*!< Set PF9 function to CANFD1_TXD          */
#define SET_CANFD1_TXD_PG0()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_CANFD1_TXD)                    /*!< Set PG0 function to CANFD1_TXD          */
#define SET_CANFD1_TXD_PI14()       SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_CANFD1_TXD)                  /*!< Set PI14 function to CANFD1_TXD         */
#define SET_CANFD1_TXD_PJ12()       SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_CANFD1_TXD)                  /*!< Set PJ12 function to CANFD1_TXD         */
#define SET_CANFD1_TXD_PJ4()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_CANFD1_TXD)                    /*!< Set PJ4 function to CANFD1_TXD          */
#define SET_CCAP_DATA0_PB14()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_CCAP_DATA0)                  /*!< Set PB14 function to CCAP_DATA0         */
#define SET_CCAP_DATA0_PB7()        SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_CCAP_DATA0)                    /*!< Set PB7 function to CCAP_DATA0          */
#define SET_CCAP_DATA0_PC0()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_CCAP_DATA0)                    /*!< Set PC0 function to CCAP_DATA0          */
#define SET_CCAP_DATA0_PF7()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_CCAP_DATA0)                    /*!< Set PF7 function to CCAP_DATA0          */
#define SET_CCAP_DATA0_PJ7()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ7MFP_Msk)) | SYS_GPJ_MFP1_PJ7MFP_CCAP_DATA0)                    /*!< Set PJ7 function to CCAP_DATA0          */
#define SET_CCAP_DATA1_PB15()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_CCAP_DATA1)                  /*!< Set PB15 function to CCAP_DATA1         */
#define SET_CCAP_DATA1_PB8()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_CCAP_DATA1)                    /*!< Set PB8 function to CCAP_DATA1          */
#define SET_CCAP_DATA1_PC1()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_CCAP_DATA1)                    /*!< Set PC1 function to CCAP_DATA1          */
#define SET_CCAP_DATA1_PF8()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_CCAP_DATA1)                    /*!< Set PF8 function to CCAP_DATA1          */
#define SET_CCAP_DATA1_PJ6()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ6MFP_Msk)) | SYS_GPJ_MFP1_PJ6MFP_CCAP_DATA1)                    /*!< Set PJ6 function to CCAP_DATA1          */
#define SET_CCAP_DATA2_PA2()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_CCAP_DATA2)                    /*!< Set PA2 function to CCAP_DATA2          */
#define SET_CCAP_DATA2_PC2()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_CCAP_DATA2)                    /*!< Set PC2 function to CCAP_DATA2          */
#define SET_CCAP_DATA2_PF9()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_CCAP_DATA2)                    /*!< Set PF9 function to CCAP_DATA2          */
#define SET_CCAP_DATA2_PJ5()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_CCAP_DATA2)                    /*!< Set PJ5 function to CCAP_DATA2          */
#define SET_CCAP_DATA3_PA3()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_CCAP_DATA3)                    /*!< Set PA3 function to CCAP_DATA3          */
#define SET_CCAP_DATA3_PC3()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_CCAP_DATA3)                    /*!< Set PC3 function to CCAP_DATA3          */
#define SET_CCAP_DATA3_PF10()       SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_CCAP_DATA3)                  /*!< Set PF10 function to CCAP_DATA3         */
#define SET_CCAP_DATA3_PJ4()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_CCAP_DATA3)                    /*!< Set PJ4 function to CCAP_DATA3          */
#define SET_CCAP_DATA4_PC4()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_CCAP_DATA4)                    /*!< Set PC4 function to CCAP_DATA4          */
#define SET_CCAP_DATA4_PF11()       SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_CCAP_DATA4)                  /*!< Set PF11 function to CCAP_DATA4         */
#define SET_CCAP_DATA4_PJ3()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_CCAP_DATA4)                    /*!< Set PJ3 function to CCAP_DATA4          */
#define SET_CCAP_DATA5_PC5()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_CCAP_DATA5)                    /*!< Set PC5 function to CCAP_DATA5          */
#define SET_CCAP_DATA5_PG4()        SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_CCAP_DATA5)                    /*!< Set PG4 function to CCAP_DATA5          */
#define SET_CCAP_DATA5_PJ2()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_CCAP_DATA5)                    /*!< Set PJ2 function to CCAP_DATA5          */
#define SET_CCAP_DATA6_PA0()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_CCAP_DATA6)                    /*!< Set PA0 function to CCAP_DATA6          */
#define SET_CCAP_DATA6_PG3()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_CCAP_DATA6)                    /*!< Set PG3 function to CCAP_DATA6          */
#define SET_CCAP_DATA7_PA1()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_CCAP_DATA7)                    /*!< Set PA1 function to CCAP_DATA7          */
#define SET_CCAP_DATA7_PG2()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_CCAP_DATA7)                    /*!< Set PG2 function to CCAP_DATA7          */
#define SET_CCAP_HSYNC_PB9()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_CCAP_HSYNC)                    /*!< Set PB9 function to CCAP_HSYNC          */
#define SET_CCAP_HSYNC_PD7()        SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_CCAP_HSYNC)                    /*!< Set PD7 function to CCAP_HSYNC          */
#define SET_CCAP_HSYNC_PG13()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_CCAP_HSYNC)                  /*!< Set PG13 function to CCAP_HSYNC         */
#define SET_CCAP_PIXCLK_PA5()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_CCAP_PIXCLK)                   /*!< Set PA5 function to CCAP_PIXCLK         */
#define SET_CCAP_PIXCLK_PB13()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_CCAP_PIXCLK)                 /*!< Set PB13 function to CCAP_PIXCLK        */
#define SET_CCAP_PIXCLK_PG0()       SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_CCAP_PIXCLK)                   /*!< Set PG0 function to CCAP_PIXCLK         */
#define SET_CCAP_PIXCLK_PG9()       SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_CCAP_PIXCLK)                   /*!< Set PG9 function to CCAP_PIXCLK         */
#define SET_CCAP_PIXCLK_PH12()      SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_CCAP_PIXCLK)                 /*!< Set PH12 function to CCAP_PIXCLK        */
#define SET_CCAP_SCLK_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_CCAP_SCLK)                     /*!< Set PA4 function to CCAP_SCLK           */
#define SET_CCAP_SCLK_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_CCAP_SCLK)                   /*!< Set PB12 function to CCAP_SCLK          */
#define SET_CCAP_SCLK_PG1()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_CCAP_SCLK)                     /*!< Set PG1 function to CCAP_SCLK           */
#define SET_CCAP_SCLK_PG10()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_CCAP_SCLK)                   /*!< Set PG10 function to CCAP_SCLK          */
#define SET_CCAP_SCLK_PH13()        SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_CCAP_SCLK)                   /*!< Set PH13 function to CCAP_SCLK          */
#define SET_CCAP_SFIELD_PB11()      SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_CCAP_SFIELD)                 /*!< Set PB11 function to CCAP_SFIELD        */
#define SET_CCAP_SFIELD_PG11()      SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_CCAP_SFIELD)                 /*!< Set PG11 function to CCAP_SFIELD        */
#define SET_CCAP_SFIELD_PH14()      SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_CCAP_SFIELD)                 /*!< Set PH14 function to CCAP_SFIELD        */
#define SET_CCAP_VSYNC_PB10()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_CCAP_VSYNC)                  /*!< Set PB10 function to CCAP_VSYNC         */
#define SET_CCAP_VSYNC_PG12()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_CCAP_VSYNC)                  /*!< Set PG12 function to CCAP_VSYNC         */
#define SET_CCAP_VSYNC_PH15()       SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_CCAP_VSYNC)                  /*!< Set PH15 function to CCAP_VSYNC         */
#define SET_CLKO_PB13()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_CLKO)                        /*!< Set PB13 function to CLKO               */
#define SET_CLKO_PB14()             SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_CLKO)                        /*!< Set PB14 function to CLKO               */
#define SET_CLKO_PC13()             SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_CLKO)                        /*!< Set PC13 function to CLKO               */
#define SET_CLKO_PD12()             SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_CLKO)                        /*!< Set PD12 function to CLKO               */
#define SET_CLKO_PD13()             SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_CLKO)                        /*!< Set PD13 function to CLKO               */
#define SET_CLKO_PD5()              SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_CLKO)                          /*!< Set PD5 function to CLKO                */
#define SET_DAC0_OUT_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_DAC0_OUT)                    /*!< Set PB12 function to DAC0_OUT           */
#define SET_DAC0_ST_PA0()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_DAC0_ST)                       /*!< Set PA0 function to DAC0_ST             */
#define SET_DAC0_ST_PA10()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_DAC0_ST)                     /*!< Set PA10 function to DAC0_ST            */
#define SET_DAC1_OUT_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_DAC1_OUT)                    /*!< Set PB13 function to DAC1_OUT           */
#define SET_DAC1_ST_PA1()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_DAC1_ST)                       /*!< Set PA1 function to DAC1_ST             */
#define SET_DAC1_ST_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_DAC1_ST)                     /*!< Set PA11 function to DAC1_ST            */
#define SET_DMIC0_CLKLP_PA3()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_DMIC0_CLKLP)                   /*!< Set PA3 function to DMIC0_CLKLP         */
#define SET_DMIC0_CLKLP_PB6()       SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_DMIC0_CLKLP)                   /*!< Set PB6 function to DMIC0_CLKLP         */
#define SET_DMIC0_CLKLP_PE10()      SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_DMIC0_CLKLP)                 /*!< Set PE10 function to DMIC0_CLKLP        */
#define SET_DMIC0_CLK_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_DMIC0_CLK)                     /*!< Set PA4 function to DMIC0_CLK           */
#define SET_DMIC0_CLK_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_DMIC0_CLK)                     /*!< Set PB4 function to DMIC0_CLK           */
#define SET_DMIC0_CLK_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_DMIC0_CLK)                     /*!< Set PE9 function to DMIC0_CLK           */
#define SET_DMIC0_DAT_PA5()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_DMIC0_DAT)                     /*!< Set PA5 function to DMIC0_DAT           */
#define SET_DMIC0_DAT_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_DMIC0_DAT)                     /*!< Set PB5 function to DMIC0_DAT           */
#define SET_DMIC0_DAT_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_DMIC0_DAT)                     /*!< Set PE8 function to DMIC0_DAT           */
#define SET_DMIC1_CLK_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_DMIC1_CLK)                     /*!< Set PA1 function to DMIC1_CLK           */
#define SET_DMIC1_CLK_PB2()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_DMIC1_CLK)                     /*!< Set PB2 function to DMIC1_CLK           */
#define SET_DMIC1_CLK_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_DMIC1_CLK)                   /*!< Set PE12 function to DMIC1_CLK          */
#define SET_DMIC1_DAT_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_DMIC1_DAT)                     /*!< Set PA2 function to DMIC1_DAT           */
#define SET_DMIC1_DAT_PB3()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_DMIC1_DAT)                     /*!< Set PB3 function to DMIC1_DAT           */
#define SET_DMIC1_DAT_PE11()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_DMIC1_DAT)                   /*!< Set PE11 function to DMIC1_DAT          */
#define SET_EADC0_CH0_PB0()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_EADC0_CH0)                     /*!< Set PB0 function to EADC0_CH0           */
#define SET_EADC0_CH10_PB10()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_EADC0_CH10)                  /*!< Set PB10 function to EADC0_CH10         */
#define SET_EADC0_CH11_PB11()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_EADC0_CH11)                  /*!< Set PB11 function to EADC0_CH11         */
#define SET_EADC0_CH12_PB12()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_EADC0_CH12)                  /*!< Set PB12 function to EADC0_CH12         */
#define SET_EADC0_CH13_PB13()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_EADC0_CH13)                  /*!< Set PB13 function to EADC0_CH13         */
#define SET_EADC0_CH14_PB14()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_EADC0_CH14)                  /*!< Set PB14 function to EADC0_CH14         */
#define SET_EADC0_CH15_PB15()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_EADC0_CH15)                  /*!< Set PB15 function to EADC0_CH15         */
#define SET_EADC0_CH16_PD10()       SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_EADC0_CH16)                  /*!< Set PD10 function to EADC0_CH16         */
#define SET_EADC0_CH17_PD11()       SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_EADC0_CH17)                  /*!< Set PD11 function to EADC0_CH17         */
#define SET_EADC0_CH18_PD12()       SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_EADC0_CH18)                  /*!< Set PD12 function to EADC0_CH18         */
#define SET_EADC0_CH19_PC13()       SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_EADC0_CH19)                  /*!< Set PC13 function to EADC0_CH19         */
#define SET_EADC0_CH1_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EADC0_CH1)                     /*!< Set PB1 function to EADC0_CH1           */
#define SET_EADC0_CH20_PA8()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_EADC0_CH20)                    /*!< Set PA8 function to EADC0_CH20          */
#define SET_EADC0_CH21_PA9()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_EADC0_CH21)                    /*!< Set PA9 function to EADC0_CH21          */
#define SET_EADC0_CH22_PA10()       SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_EADC0_CH22)                  /*!< Set PA10 function to EADC0_CH22         */
#define SET_EADC0_CH23_PA11()       SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_EADC0_CH23)                  /*!< Set PA11 function to EADC0_CH23         */
#define SET_EADC0_CH2_PB2()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_EADC0_CH2)                     /*!< Set PB2 function to EADC0_CH2           */
#define SET_EADC0_CH3_PB3()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_EADC0_CH3)                     /*!< Set PB3 function to EADC0_CH3           */
#define SET_EADC0_CH4_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_EADC0_CH4)                     /*!< Set PB4 function to EADC0_CH4           */
#define SET_EADC0_CH5_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_EADC0_CH5)                     /*!< Set PB5 function to EADC0_CH5           */
#define SET_EADC0_CH6_PB6()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EADC0_CH6)                     /*!< Set PB6 function to EADC0_CH6           */
#define SET_EADC0_CH7_PB7()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EADC0_CH7)                     /*!< Set PB7 function to EADC0_CH7           */
#define SET_EADC0_CH8_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_EADC0_CH8)                     /*!< Set PB8 function to EADC0_CH8           */
#define SET_EADC0_CH9_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_EADC0_CH9)                     /*!< Set PB9 function to EADC0_CH9           */
#define SET_EADC0_ST_PC1()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_EADC0_ST)                      /*!< Set PC1 function to EADC0_ST            */
#define SET_EADC0_ST_PC13()         SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_EADC0_ST)                    /*!< Set PC13 function to EADC0_ST           */
#define SET_EADC0_ST_PD12()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_EADC0_ST)                    /*!< Set PD12 function to EADC0_ST           */
#define SET_EADC0_ST_PD13()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_EADC0_ST)                    /*!< Set PD13 function to EADC0_ST           */
#define SET_EADC0_ST_PD5()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_EADC0_ST)                      /*!< Set PD5 function to EADC0_ST            */
#define SET_EADC0_ST_PF0()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_EADC0_ST)                      /*!< Set PF0 function to EADC0_ST            */
#define SET_EADC0_ST_PF5()          SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EADC0_ST)                      /*!< Set PF5 function to EADC0_ST            */
#define SET_EADC0_ST_PG14()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_EADC0_ST)                    /*!< Set PG14 function to EADC0_ST           */
#define SET_EBI_AD0_PA5()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_EBI_AD0)                       /*!< Set PA5 function to EBI_AD0             */
#define SET_EBI_AD0_PC0()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_EBI_AD0)                       /*!< Set PC0 function to EBI_AD0             */
#define SET_EBI_AD0_PF4()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_EBI_AD0)                       /*!< Set PF4 function to EBI_AD0             */
