OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_EBI_AD0_PG9()           SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_EBI_AD0)                       /*!< Set PG9 function to EBI_AD0             */
#define SET_EBI_AD0_PH12()          SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_EBI_AD0)                     /*!< Set PH12 function to EBI_AD0            */
#define SET_EBI_AD0_PJ7()           SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ7MFP_Msk)) | SYS_GPJ_MFP1_PJ7MFP_EBI_AD0)                       /*!< Set PJ7 function to EBI_AD0             */
#define SET_EBI_AD10_PD13()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_EBI_AD10)                    /*!< Set PD13 function to EBI_AD10           */
#define SET_EBI_AD10_PD3()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_EBI_AD10)                      /*!< Set PD3 function to EBI_AD10            */
#define SET_EBI_AD10_PE1()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_EBI_AD10)                      /*!< Set PE1 function to EBI_AD10            */
#define SET_EBI_AD10_PE7()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_EBI_AD10)                      /*!< Set PE7 function to EBI_AD10            */
#define SET_EBI_AD11_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_EBI_AD11)                    /*!< Set PB12 function to EBI_AD11           */
#define SET_EBI_AD11_PC14()         SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_EBI_AD11)                    /*!< Set PC14 function to EBI_AD11           */
#define SET_EBI_AD11_PD2()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_EBI_AD11)                      /*!< Set PD2 function to EBI_AD11            */
#define SET_EBI_AD11_PE0()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_EBI_AD11)                      /*!< Set PE0 function to EBI_AD11            */
#define SET_EBI_AD11_PE6()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_EBI_AD11)                      /*!< Set PE6 function to EBI_AD11            */
#define SET_EBI_AD12_PB15()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_EBI_AD12)                    /*!< Set PB15 function to EBI_AD12           */
#define SET_EBI_AD12_PD1()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_EBI_AD12)                      /*!< Set PD1 function to EBI_AD12            */
#define SET_EBI_AD12_PH8()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_EBI_AD12)                      /*!< Set PH8 function to EBI_AD12            */
#define SET_EBI_AD13_PB14()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_EBI_AD13)                    /*!< Set PB14 function to EBI_AD13           */
#define SET_EBI_AD13_PD0()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_EBI_AD13)                      /*!< Set PD0 function to EBI_AD13            */
#define SET_EBI_AD13_PH9()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_EBI_AD13)                      /*!< Set PH9 function to EBI_AD13            */
#define SET_EBI_AD14_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_EBI_AD14)                    /*!< Set PB13 function to EBI_AD14           */
#define SET_EBI_AD14_PH10()         SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_EBI_AD14)                    /*!< Set PH10 function to EBI_AD14           */
#define SET_EBI_AD15_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_EBI_AD15)                    /*!< Set PB12 function to EBI_AD15           */
#define SET_EBI_AD15_PD5()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_EBI_AD15)                      /*!< Set PD5 function to EBI_AD15            */
#define SET_EBI_AD15_PH11()         SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_EBI_AD15)                    /*!< Set PH11 function to EBI_AD15           */
#define SET_EBI_AD1_PA4()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_EBI_AD1)                       /*!< Set PA4 function to EBI_AD1             */
#define SET_EBI_AD1_PC1()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_EBI_AD1)                       /*!< Set PC1 function to EBI_AD1             */
#define SET_EBI_AD1_PF5()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EBI_AD1)                       /*!< Set PF5 function to EBI_AD1             */
#define SET_EBI_AD1_PG10()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_EBI_AD1)                     /*!< Set PG10 function to EBI_AD1            */
#define SET_EBI_AD1_PH13()          SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_EBI_AD1)                     /*!< Set PH13 function to EBI_AD1            */
#define SET_EBI_AD1_PJ6()           SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ6MFP_Msk)) | SYS_GPJ_MFP1_PJ6MFP_EBI_AD1)                       /*!< Set PJ6 function to EBI_AD1             */
#define SET_EBI_AD2_PC2()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_EBI_AD2)                       /*!< Set PC2 function to EBI_AD2             */
#define SET_EBI_AD2_PG11()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_EBI_AD2)                     /*!< Set PG11 function to EBI_AD2            */
#define SET_EBI_AD2_PH14()          SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_EBI_AD2)                     /*!< Set PH14 function to EBI_AD2            */
#define SET_EBI_AD2_PJ5()           SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_EBI_AD2)                       /*!< Set PJ5 function to EBI_AD2             */
#define SET_EBI_AD3_PC3()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_EBI_AD3)                       /*!< Set PC3 function to EBI_AD3             */
#define SET_EBI_AD3_PG12()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_EBI_AD3)                     /*!< Set PG12 function to EBI_AD3            */
#define SET_EBI_AD3_PH15()          SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_EBI_AD3)                     /*!< Set PH15 function to EBI_AD3            */
#define SET_EBI_AD3_PJ4()           SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_EBI_AD3)                       /*!< Set PJ4 function to EBI_AD3             */
#define SET_EBI_AD4_PC4()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_EBI_AD4)                       /*!< Set PC4 function to EBI_AD4             */
#define SET_EBI_AD4_PD7()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_EBI_AD4)                       /*!< Set PD7 function to EBI_AD4             */
#define SET_EBI_AD4_PG13()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_EBI_AD4)                     /*!< Set PG13 function to EBI_AD4            */
#define SET_EBI_AD4_PJ3()           SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_EBI_AD4)                       /*!< Set PJ3 function to EBI_AD4             */
#define SET_EBI_AD5_PA14()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_EBI_AD5)                     /*!< Set PA14 function to EBI_AD5            */
#define SET_EBI_AD5_PC5()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_EBI_AD5)                       /*!< Set PC5 function to EBI_AD5             */
#define SET_EBI_AD5_PD6()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_EBI_AD5)                       /*!< Set PD6 function to EBI_AD5             */
#define SET_EBI_AD5_PG14()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_EBI_AD5)                     /*!< Set PG14 function to EBI_AD5            */
#define SET_EBI_AD5_PJ2()           SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_EBI_AD5)                       /*!< Set PJ2 function to EBI_AD5             */
#define SET_EBI_AD6_PD8()           SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_EBI_AD6)                       /*!< Set PD8 function to EBI_AD6             */
#define SET_EBI_AD7_PA7()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_EBI_AD7)                       /*!< Set PA7 function to EBI_AD7             */
#define SET_EBI_AD7_PD9()           SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_EBI_AD7)                       /*!< Set PD9 function to EBI_AD7             */
#define SET_EBI_AD8_PC6()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_EBI_AD8)                       /*!< Set PC6 function to EBI_AD8             */
#define SET_EBI_AD8_PE14()          SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_EBI_AD8)                     /*!< Set PE14 function to EBI_AD8            */
#define SET_EBI_AD9_PC7()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_EBI_AD9)                       /*!< Set PC7 function to EBI_AD9             */
#define SET_EBI_AD9_PE15()          SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_EBI_AD9)                     /*!< Set PE15 function to EBI_AD9            */
#define SET_EBI_ADR0_PB5()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_EBI_ADR0)                      /*!< Set PB5 function to EBI_ADR0            */
#define SET_EBI_ADR0_PH7()          SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH7MFP_Msk)) | SYS_GPH_MFP1_PH7MFP_EBI_ADR0)                      /*!< Set PH7 function to EBI_ADR0            */
#define SET_EBI_ADR10_PC13()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_EBI_ADR10)                   /*!< Set PC13 function to EBI_ADR10          */
#define SET_EBI_ADR10_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_EBI_ADR10)                     /*!< Set PE8 function to EBI_ADR10           */
#define SET_EBI_ADR11_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_EBI_ADR11)                     /*!< Set PE9 function to EBI_ADR11           */
#define SET_EBI_ADR11_PG2()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_EBI_ADR11)                     /*!< Set PG2 function to EBI_ADR11           */
#define SET_EBI_ADR12_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EBI_ADR12)                   /*!< Set PE10 function to EBI_ADR12          */
#define SET_EBI_ADR12_PG3()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_EBI_ADR12)                     /*!< Set PG3 function to EBI_ADR12           */
#define SET_EBI_ADR13_PE11()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_EBI_ADR13)                   /*!< Set PE11 function to EBI_ADR13          */
#define SET_EBI_ADR13_PG4()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_EBI_ADR13)                     /*!< Set PG4 function to EBI_ADR13           */
#define SET_EBI_ADR14_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_EBI_ADR14)                   /*!< Set PE12 function to EBI_ADR14          */
#define SET_EBI_ADR14_PF11()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_EBI_ADR14)                   /*!< Set PF11 function to EBI_ADR14          */
#define SET_EBI_ADR15_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_EBI_ADR15)                   /*!< Set PE13 function to EBI_ADR15          */
#define SET_EBI_ADR15_PF10()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_EBI_ADR15)                   /*!< Set PF10 function to EBI_ADR15          */
#define SET_EBI_ADR16_PB11()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_EBI_ADR16)                   /*!< Set PB11 function to EBI_ADR16          */
#define SET_EBI_ADR16_PC8()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_EBI_ADR16)                     /*!< Set PC8 function to EBI_ADR16           */
#define SET_EBI_ADR16_PF9()         SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_EBI_ADR16)                     /*!< Set PF9 function to EBI_ADR16           */
#define SET_EBI_ADR17_PB10()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_EBI_ADR17)                   /*!< Set PB10 function to EBI_ADR17          */
#define SET_EBI_ADR17_PF8()         SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_EBI_ADR17)                     /*!< Set PF8 function to EBI_ADR17           */
#define SET_EBI_ADR18_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_EBI_ADR18)                     /*!< Set PB9 function to EBI_ADR18           */
#define SET_EBI_ADR18_PF7()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_EBI_ADR18)                     /*!< Set PF7 function to EBI_ADR18           */
#define SET_EBI_ADR19_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_EBI_ADR19)                     /*!< Set PB8 function to EBI_ADR19           */
#define SET_EBI_ADR19_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_EBI_ADR19)                     /*!< Set PF6 function to EBI_ADR19           */
#define SET_EBI_ADR1_PB4()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_EBI_ADR1)                      /*!< Set PB4 function to EBI_ADR1            */
#define SET_EBI_ADR1_PH6()          SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH6MFP_Msk)) | SYS_GPH_MFP1_PH6MFP_EBI_ADR1)                      /*!< Set PH6 function to EBI_ADR1            */
#define SET_EBI_ADR2_PB3()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_EBI_ADR2)                      /*!< Set PB3 function to EBI_ADR2            */
#define SET_EBI_ADR2_PH5()          SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_EBI_ADR2)                      /*!< Set PH5 function to EBI_ADR2            */
#define SET_EBI_ADR3_PB2()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_EBI_ADR3)                      /*!< Set PB2 function to EBI_ADR3            */
#define SET_EBI_ADR3_PH4()          SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_EBI_ADR3)                      /*!< Set PH4 function to EBI_ADR3            */
#define SET_EBI_ADR4_PC12()         SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_EBI_ADR4)                    /*!< Set PC12 function to EBI_ADR4           */
#define SET_EBI_ADR4_PH3()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_EBI_ADR4)                      /*!< Set PH3 function to EBI_ADR4            */
#define SET_EBI_ADR5_PC11()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_EBI_ADR5)                    /*!< Set PC11 function to EBI_ADR5           */
#define SET_EBI_ADR5_PH2()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_EBI_ADR5)                      /*!< Set PH2 function to EBI_ADR5            */
#define SET_EBI_ADR6_PC10()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_EBI_ADR6)                    /*!< Set PC10 function to EBI_ADR6           */
#define SET_EBI_ADR6_PH1()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_EBI_ADR6)                      /*!< Set PH1 function to EBI_ADR6            */
#define SET_EBI_ADR7_PC9()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_EBI_ADR7)                      /*!< Set PC9 function to EBI_ADR7            */
#define SET_EBI_ADR7_PH0()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_EBI_ADR7)                      /*!< Set PH0 function to EBI_ADR7            */
#define SET_EBI_ADR8_PB1()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EBI_ADR8)                      /*!< Set PB1 function to EBI_ADR8            */
#define SET_EBI_ADR8_PG0()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_EBI_ADR8)                      /*!< Set PG0 function to EBI_ADR8            */
#define SET_EBI_ADR9_PB0()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_EBI_ADR9)                      /*!< Set PB0 function to EBI_ADR9            */
#define SET_EBI_ADR9_PG1()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_EBI_ADR9)                      /*!< Set PG1 function to EBI_ADR9            */
#define SET_EBI_ALE_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_EBI_ALE)                       /*!< Set PA8 function to EBI_ALE             */
#define SET_EBI_ALE_PE2()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_EBI_ALE)                       /*!< Set PE2 function to EBI_ALE             */
#define SET_EBI_ALE_PJ11()          SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_EBI_ALE)                     /*!< Set PJ11 function to EBI_ALE            */
#define SET_EBI_MCLK_PA9()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_EBI_MCLK)                      /*!< Set PA9 function to EBI_MCLK            */
#define SET_EBI_MCLK_PE3()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_EBI_MCLK)                      /*!< Set PE3 function to EBI_MCLK            */
#define SET_EBI_MCLK_PJ10()         SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_EBI_MCLK)                    /*!< Set PJ10 function to EBI_MCLK           */
#define SET_EBI_nCS0_PB7()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EBI_nCS0)                      /*!< Set PB7 function to EBI_nCS0            */
#define SET_EBI_nCS0_PD12()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_EBI_nCS0)                    /*!< Set PD12 function to EBI_nCS0           */
#define SET_EBI_nCS0_PD14()         SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_EBI_nCS0)                    /*!< Set PD14 function to EBI_nCS0           */
#define SET_EBI_nCS0_PD5()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_EBI_nCS0)                      /*!< Set PD5 function to EBI_nCS0            */
#define SET_EBI_nCS0_PF3()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_EBI_nCS0)                      /*!< Set PF3 function to EBI_nCS0            */
#define SET_EBI_nCS0_PF6()          SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_EBI_nCS0)                      /*!< Set PF6 function to EBI_nCS0            */
#define SET_EBI_nCS0_PJ12()         SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_EBI_nCS0)                    /*!< Set PJ12 function to EBI_nCS0           */
#define SET_EBI_nCS1_PB6()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EBI_nCS1)                      /*!< Set PB6 function to EBI_nCS1            */
#define SET_EBI_nCS1_PD11()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_EBI_nCS1)                    /*!< Set PD11 function to EBI_nCS1           */
#define SET_EBI_nCS1_PF2()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_EBI_nCS1)                      /*!< Set PF2 function to EBI_nCS1            */
#define SET_EBI_nCS1_PG5()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_EBI_nCS1)                      /*!< Set PG5 function to EBI_nCS1            */
#define SET_EBI_nCS2_PD10()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_EBI_nCS2)                    /*!< Set PD10 function to EBI_nCS2           */
#define SET_EBI_nCS2_PG6()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_EBI_nCS2)                      /*!< Set PG6 function to EBI_nCS2            */
#define SET_EBI_nRD_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_EBI_nRD)                     /*!< Set PA11 function to EBI_nRD            */
#define SET_EBI_nRD_PE5()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_EBI_nRD)                       /*!< Set PE5 function to EBI_nRD             */
#define SET_EBI_nRD_PJ8()           SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ8MFP_Msk)) | SYS_GPJ_MFP2_PJ8MFP_EBI_nRD)                       /*!< Set PJ8 function to EBI_nRD             */
#define SET_EBI_nWRH_PB6()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EBI_nWRH)                      /*!< Set PB6 function to EBI_nWRH            */
#define SET_EBI_nWRH_PG6()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_EBI_nWRH)                      /*!< Set PG6 function to EBI_nWRH            */
#define SET_EBI_nWRH_PG8()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_EBI_nWRH)                      /*!< Set PG8 function to EBI_nWRH            */
#define SET_EBI_nWRL_PB7()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EBI_nWRL)                      /*!< Set PB7 function to EBI_nWRL            */
