OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_EBI_nWRL_PG5()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_EBI_nWRL)                      /*!< Set PG5 function to EBI_nWRL            */
#define SET_EBI_nWRL_PG7()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_EBI_nWRL)                      /*!< Set PG7 function to EBI_nWRL            */
#define SET_EBI_nWR_PA10()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_EBI_nWR)                     /*!< Set PA10 function to EBI_nWR            */
#define SET_EBI_nWR_PE4()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_EBI_nWR)                       /*!< Set PE4 function to EBI_nWR             */
#define SET_EBI_nWR_PJ9()           SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ9MFP_Msk)) | SYS_GPJ_MFP2_PJ9MFP_EBI_nWR)                       /*!< Set PJ9 function to EBI_nWR             */
#define SET_ECAP0_IC0_PA10()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_ECAP0_IC0)                   /*!< Set PA10 function to ECAP0_IC0          */
#define SET_ECAP0_IC0_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_ECAP0_IC0)                     /*!< Set PE8 function to ECAP0_IC0           */
#define SET_ECAP0_IC1_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_ECAP0_IC1)                     /*!< Set PA9 function to ECAP0_IC1           */
#define SET_ECAP0_IC1_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_ECAP0_IC1)                     /*!< Set PE9 function to ECAP0_IC1           */
#define SET_ECAP0_IC2_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_ECAP0_IC2)                     /*!< Set PA8 function to ECAP0_IC2           */
#define SET_ECAP0_IC2_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_ECAP0_IC2)                   /*!< Set PE10 function to ECAP0_IC2          */
#define SET_ECAP1_IC0_PC10()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_ECAP1_IC0)                   /*!< Set PC10 function to ECAP1_IC0          */
#define SET_ECAP1_IC0_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_ECAP1_IC0)                   /*!< Set PE13 function to ECAP1_IC0          */
#define SET_ECAP1_IC1_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_ECAP1_IC1)                   /*!< Set PC11 function to ECAP1_IC1          */
#define SET_ECAP1_IC1_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_ECAP1_IC1)                   /*!< Set PE12 function to ECAP1_IC1          */
#define SET_ECAP1_IC2_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_ECAP1_IC2)                   /*!< Set PC12 function to ECAP1_IC2          */
#define SET_ECAP1_IC2_PE11()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_ECAP1_IC2)                   /*!< Set PE11 function to ECAP1_IC2          */
#define SET_ECAP2_IC0_PD1()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_ECAP2_IC0)                     /*!< Set PD1 function to ECAP2_IC0           */
#define SET_ECAP2_IC0_PG9()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_ECAP2_IC0)                     /*!< Set PG9 function to ECAP2_IC0           */
#define SET_ECAP2_IC0_PJ10()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_ECAP2_IC0)                   /*!< Set PJ10 function to ECAP2_IC0          */
#define SET_ECAP2_IC1_PD0()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_ECAP2_IC1)                     /*!< Set PD0 function to ECAP2_IC1           */
#define SET_ECAP2_IC1_PG10()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_ECAP2_IC1)                   /*!< Set PG10 function to ECAP2_IC1          */
#define SET_ECAP2_IC1_PJ11()        SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_ECAP2_IC1)                   /*!< Set PJ11 function to ECAP2_IC1          */
#define SET_ECAP2_IC2_PD13()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_ECAP2_IC2)                   /*!< Set PD13 function to ECAP2_IC2          */
#define SET_ECAP2_IC2_PG11()        SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_ECAP2_IC2)                   /*!< Set PG11 function to ECAP2_IC2          */
#define SET_ECAP2_IC2_PJ12()        SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_ECAP2_IC2)                   /*!< Set PJ12 function to ECAP2_IC2          */
#define SET_ECAP3_IC0_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_ECAP3_IC0)                   /*!< Set PA12 function to ECAP3_IC0          */
#define SET_ECAP3_IC0_PD12()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_ECAP3_IC0)                   /*!< Set PD12 function to ECAP3_IC0          */
#define SET_ECAP3_IC0_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_ECAP3_IC0)                     /*!< Set PE8 function to ECAP3_IC0           */
#define SET_ECAP3_IC1_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_ECAP3_IC1)                   /*!< Set PA13 function to ECAP3_IC1          */
#define SET_ECAP3_IC1_PD11()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_ECAP3_IC1)                   /*!< Set PD11 function to ECAP3_IC1          */
#define SET_ECAP3_IC1_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_ECAP3_IC1)                     /*!< Set PE9 function to ECAP3_IC1           */
#define SET_ECAP3_IC2_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_ECAP3_IC2)                   /*!< Set PA14 function to ECAP3_IC2          */
#define SET_ECAP3_IC2_PD10()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_ECAP3_IC2)                   /*!< Set PD10 function to ECAP3_IC2          */
#define SET_ECAP3_IC2_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_ECAP3_IC2)                   /*!< Set PE10 function to ECAP3_IC2          */
#define SET_EMAC0_PPS_PB6()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EMAC0_PPS)                     /*!< Set PB6 function to EMAC0_PPS           */
#define SET_EMAC0_PPS_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_EMAC0_PPS)                   /*!< Set PE13 function to EMAC0_PPS          */
#define SET_EMAC0_RMII_CRSDV_PA7()  SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_EMAC0_RMII_CRSDV)              /*!< Set PA7 function to EMAC0_RMII_CRSDV    */
#define SET_EMAC0_RMII_CRSDV_PB2()  SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_EMAC0_RMII_CRSDV)              /*!< Set PB2 function to EMAC0_RMII_CRSDV    */
#define SET_EMAC0_RMII_MDC_PB11()   SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_EMAC0_RMII_MDC)              /*!< Set PB11 function to EMAC0_RMII_MDC     */
#define SET_EMAC0_RMII_MDC_PE8()    SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_EMAC0_RMII_MDC)                /*!< Set PE8 function to EMAC0_RMII_MDC      */
#define SET_EMAC0_RMII_MDIO_PB10()  SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_EMAC0_RMII_MDIO)             /*!< Set PB10 function to EMAC0_RMII_MDIO    */
#define SET_EMAC0_RMII_MDIO_PE9()   SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_EMAC0_RMII_MDIO)               /*!< Set PE9 function to EMAC0_RMII_MDIO     */
#define SET_EMAC0_RMII_REFCLK_PB5() SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_EMAC0_RMII_REFCLK)             /*!< Set PB5 function to EMAC0_RMII_REFCLK   */
#define SET_EMAC0_RMII_REFCLK_PC8() SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_EMAC0_RMII_REFCLK)             /*!< Set PC8 function to EMAC0_RMII_REFCLK   */
#define SET_EMAC0_RMII_RXD0_PB4()   SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_EMAC0_RMII_RXD0)               /*!< Set PB4 function to EMAC0_RMII_RXD0     */
#define SET_EMAC0_RMII_RXD0_PC7()   SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_EMAC0_RMII_RXD0)               /*!< Set PC7 function to EMAC0_RMII_RXD0     */
#define SET_EMAC0_RMII_RXD1_PB3()   SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_EMAC0_RMII_RXD1)               /*!< Set PB3 function to EMAC0_RMII_RXD1     */
#define SET_EMAC0_RMII_RXD1_PC6()   SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_EMAC0_RMII_RXD1)               /*!< Set PC6 function to EMAC0_RMII_RXD1     */
#define SET_EMAC0_RMII_RXERR_PA6()  SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_EMAC0_RMII_RXERR)              /*!< Set PA6 function to EMAC0_RMII_RXERR    */
#define SET_EMAC0_RMII_RXERR_PB1()  SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EMAC0_RMII_RXERR)              /*!< Set PB1 function to EMAC0_RMII_RXERR    */
#define SET_EMAC0_RMII_TXD0_PB9()   SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_EMAC0_RMII_TXD0)               /*!< Set PB9 function to EMAC0_RMII_TXD0     */
#define SET_EMAC0_RMII_TXD0_PE10()  SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EMAC0_RMII_TXD0)             /*!< Set PE10 function to EMAC0_RMII_TXD0    */
#define SET_EMAC0_RMII_TXD1_PB8()   SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_EMAC0_RMII_TXD1)               /*!< Set PB8 function to EMAC0_RMII_TXD1     */
#define SET_EMAC0_RMII_TXD1_PE11()  SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_EMAC0_RMII_TXD1)             /*!< Set PE11 function to EMAC0_RMII_TXD1    */
#define SET_EMAC0_RMII_TXEN_PB7()   SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EMAC0_RMII_TXEN)               /*!< Set PB7 function to EMAC0_RMII_TXEN     */
#define SET_EMAC0_RMII_TXEN_PE12()  SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_EMAC0_RMII_TXEN)             /*!< Set PE12 function to EMAC0_RMII_TXEN    */
#define SET_EPWM0_BRAKE0_PB1()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EPWM0_BRAKE0)                  /*!< Set PB1 function to EPWM0_BRAKE0        */
#define SET_EPWM0_BRAKE0_PE8()      SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_EPWM0_BRAKE0)                  /*!< Set PE8 function to EPWM0_BRAKE0        */
#define SET_EPWM0_BRAKE1_PA11()     SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_EPWM0_BRAKE1)                /*!< Set PA11 function to EPWM0_BRAKE1       */
#define SET_EPWM0_BRAKE1_PB0()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_EPWM0_BRAKE1)                  /*!< Set PB0 function to EPWM0_BRAKE1        */
#define SET_EPWM0_BRAKE1_PB15()     SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_EPWM0_BRAKE1)                /*!< Set PB15 function to EPWM0_BRAKE1       */
#define SET_EPWM0_BRAKE1_PE9()      SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_EPWM0_BRAKE1)                  /*!< Set PE9 function to EPWM0_BRAKE1        */
#define SET_EPWM0_CH0_PA5()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_EPWM0_CH0)                     /*!< Set PA5 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_EPWM0_CH0)                     /*!< Set PB5 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PE7()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_EPWM0_CH0)                     /*!< Set PE7 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_EPWM0_CH0)                     /*!< Set PE8 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EPWM0_CH0)                     /*!< Set PF5 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PG1()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_EPWM0_CH0)                     /*!< Set PG1 function to EPWM0_CH0           */
#define SET_EPWM0_CH0_PG8()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_EPWM0_CH0)                     /*!< Set PG8 function to EPWM0_CH0           */
#define SET_EPWM0_CH1_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_EPWM0_CH1)                     /*!< Set PA4 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_EPWM0_CH1)                     /*!< Set PB4 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PE6()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_EPWM0_CH1)                     /*!< Set PE6 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_EPWM0_CH1)                     /*!< Set PE9 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PF4()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_EPWM0_CH1)                     /*!< Set PF4 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PG0()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_EPWM0_CH1)                     /*!< Set PG0 function to EPWM0_CH1           */
#define SET_EPWM0_CH1_PG7()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_EPWM0_CH1)                     /*!< Set PG7 function to EPWM0_CH1           */
#define SET_EPWM0_CH2_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_EPWM0_CH2)                     /*!< Set PA3 function to EPWM0_CH2           */
#define SET_EPWM0_CH2_PB3()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_EPWM0_CH2)                     /*!< Set PB3 function to EPWM0_CH2           */
#define SET_EPWM0_CH2_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EPWM0_CH2)                   /*!< Set PE10 function to EPWM0_CH2          */
#define SET_EPWM0_CH2_PE5()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_EPWM0_CH2)                     /*!< Set PE5 function to EPWM0_CH2           */
#define SET_EPWM0_CH2_PG6()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_EPWM0_CH2)                     /*!< Set PG6 function to EPWM0_CH2           */
#define SET_EPWM0_CH3_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_EPWM0_CH3)                     /*!< Set PA2 function to EPWM0_CH3           */
#define SET_EPWM0_CH3_PB2()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_EPWM0_CH3)                     /*!< Set PB2 function to EPWM0_CH3           */
#define SET_EPWM0_CH3_PE11()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_EPWM0_CH3)                   /*!< Set PE11 function to EPWM0_CH3          */
#define SET_EPWM0_CH3_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_EPWM0_CH3)                     /*!< Set PE4 function to EPWM0_CH3           */
#define SET_EPWM0_CH3_PG5()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_EPWM0_CH3)                     /*!< Set PG5 function to EPWM0_CH3           */
#define SET_EPWM0_CH4_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_EPWM0_CH4)                     /*!< Set PA1 function to EPWM0_CH4           */
#define SET_EPWM0_CH4_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_EPWM0_CH4)                     /*!< Set PB1 function to EPWM0_CH4           */
#define SET_EPWM0_CH4_PD14()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_EPWM0_CH4)                   /*!< Set PD14 function to EPWM0_CH4          */
#define SET_EPWM0_CH4_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_EPWM0_CH4)                   /*!< Set PE12 function to EPWM0_CH4          */
#define SET_EPWM0_CH4_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_EPWM0_CH4)                     /*!< Set PE3 function to EPWM0_CH4           */
#define SET_EPWM0_CH4_PH5()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_EPWM0_CH4)                     /*!< Set PH5 function to EPWM0_CH4           */
#define SET_EPWM0_CH5_PA0()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_EPWM0_CH5)                     /*!< Set PA0 function to EPWM0_CH5           */
#define SET_EPWM0_CH5_PB0()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_EPWM0_CH5)                     /*!< Set PB0 function to EPWM0_CH5           */
#define SET_EPWM0_CH5_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_EPWM0_CH5)                   /*!< Set PE13 function to EPWM0_CH5          */
#define SET_EPWM0_CH5_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_EPWM0_CH5)                     /*!< Set PE2 function to EPWM0_CH5           */
#define SET_EPWM0_CH5_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_EPWM0_CH5)                   /*!< Set PH11 function to EPWM0_CH5          */
#define SET_EPWM0_CH5_PH4()         SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_EPWM0_CH5)                     /*!< Set PH4 function to EPWM0_CH5           */
#define SET_EPWM0_SYNC_IN_PA15()    SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_EPWM0_SYNC_IN)               /*!< Set PA15 function to EPWM0_SYNC_IN      */
#define SET_EPWM0_SYNC_IN_PB6()     SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EPWM0_SYNC_IN)                 /*!< Set PB6 function to EPWM0_SYNC_IN       */
#define SET_EPWM0_SYNC_IN_PC14()    SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_EPWM0_SYNC_IN)               /*!< Set PC14 function to EPWM0_SYNC_IN      */
#define SET_EPWM0_SYNC_OUT_PA11()   SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_EPWM0_SYNC_OUT)              /*!< Set PA11 function to EPWM0_SYNC_OUT     */
#define SET_EPWM0_SYNC_OUT_PF5()    SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_EPWM0_SYNC_OUT)                /*!< Set PF5 function to EPWM0_SYNC_OUT      */
#define SET_EPWM1_BRAKE0_PB7()      SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_EPWM1_BRAKE0)                  /*!< Set PB7 function to EPWM1_BRAKE0        */
#define SET_EPWM1_BRAKE0_PE10()     SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_EPWM1_BRAKE0)                /*!< Set PE10 function to EPWM1_BRAKE0       */
#define SET_EPWM1_BRAKE1_PA3()      SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_EPWM1_BRAKE1)                  /*!< Set PA3 function to EPWM1_BRAKE1        */
#define SET_EPWM1_BRAKE1_PB6()      SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_EPWM1_BRAKE1)                  /*!< Set PB6 function to EPWM1_BRAKE1        */
#define SET_EPWM1_BRAKE1_PE11()     SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_EPWM1_BRAKE1)                /*!< Set PE11 function to EPWM1_BRAKE1       */
#define SET_EPWM1_CH0_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_EPWM1_CH0)                   /*!< Set PB15 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_EPWM1_CH0)                   /*!< Set PC12 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_EPWM1_CH0)                     /*!< Set PC5 function to EPWM1_CH0           */
#define SET_EPWM1_CH0_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_EPWM1_CH0)                   /*!< Set PE13 function to EPWM1_CH0          */
#define SET_EPWM1_CH0_PF3()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_EPWM1_CH0)                     /*!< Set PF3 function to EPWM1_CH0           */
#define SET_EPWM1_CH0_PI12()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_EPWM1_CH0)                   /*!< Set PI12 function to EPWM1_CH0          */
#define SET_EPWM1_CH1_PB14()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_EPWM1_CH1)                   /*!< Set PB14 function to EPWM1_CH1          */
#define SET_EPWM1_CH1_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_EPWM1_CH1)                   /*!< Set PC11 function to EPWM1_CH1          */
#define SET_EPWM1_CH1_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_EPWM1_CH1)                     /*!< Set PC4 function to EPWM1_CH1           */
#define SET_EPWM1_CH1_PC8()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_EPWM1_CH1)                     /*!< Set PC8 function to EPWM1_CH1           */
#define SET_EPWM1_CH1_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_EPWM1_CH1)                     /*!< Set PF2 function to EPWM1_CH1           */
