OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_GPIO_PD2()              SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_GPIO)                          /*!< Set PD2 function to GPIO                */
#define SET_GPIO_PD3()              SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_GPIO)                          /*!< Set PD3 function to GPIO                */
#define SET_GPIO_PD4()              SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_GPIO)                          /*!< Set PD4 function to GPIO                */
#define SET_GPIO_PD5()              SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD5MFP_Msk)) | SYS_GPD_MFP1_PD5MFP_GPIO)                          /*!< Set PD5 function to GPIO                */
#define SET_GPIO_PD6()              SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_GPIO)                          /*!< Set PD6 function to GPIO                */
#define SET_GPIO_PD7()              SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_GPIO)                          /*!< Set PD7 function to GPIO                */
#define SET_GPIO_PD8()              SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_GPIO)                          /*!< Set PD8 function to GPIO                */
#define SET_GPIO_PD9()              SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_GPIO)                          /*!< Set PD9 function to GPIO                */
#define SET_GPIO_PE0()              SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_GPIO)                          /*!< Set PE0 function to GPIO                */
#define SET_GPIO_PE1()              SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_GPIO)                          /*!< Set PE1 function to GPIO                */
#define SET_GPIO_PE10()             SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_GPIO)                        /*!< Set PE10 function to GPIO               */
#define SET_GPIO_PE11()             SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_GPIO)                        /*!< Set PE11 function to GPIO               */
#define SET_GPIO_PE12()             SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_GPIO)                        /*!< Set PE12 function to GPIO               */
#define SET_GPIO_PE13()             SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_GPIO)                        /*!< Set PE13 function to GPIO               */
#define SET_GPIO_PE14()             SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_GPIO)                        /*!< Set PE14 function to GPIO               */
#define SET_GPIO_PE15()             SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_GPIO)                        /*!< Set PE15 function to GPIO               */
#define SET_GPIO_PE2()              SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_GPIO)                          /*!< Set PE2 function to GPIO                */
#define SET_GPIO_PE3()              SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_GPIO)                          /*!< Set PE3 function to GPIO                */
#define SET_GPIO_PE4()              SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_GPIO)                          /*!< Set PE4 function to GPIO                */
#define SET_GPIO_PE5()              SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_GPIO)                          /*!< Set PE5 function to GPIO                */
#define SET_GPIO_PE6()              SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_GPIO)                          /*!< Set PE6 function to GPIO                */
#define SET_GPIO_PE7()              SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_GPIO)                          /*!< Set PE7 function to GPIO                */
#define SET_GPIO_PE8()              SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_GPIO)                          /*!< Set PE8 function to GPIO                */
#define SET_GPIO_PE9()              SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_GPIO)                          /*!< Set PE9 function to GPIO                */
#define SET_GPIO_PF0()              SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_GPIO)                          /*!< Set PF0 function to GPIO                */
#define SET_GPIO_PF1()              SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_GPIO)                          /*!< Set PF1 function to GPIO                */
#define SET_GPIO_PF10()             SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_GPIO)                        /*!< Set PF10 function to GPIO               */
#define SET_GPIO_PF11()             SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_GPIO)                        /*!< Set PF11 function to GPIO               */
#define SET_GPIO_PF2()              SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_GPIO)                          /*!< Set PF2 function to GPIO                */
#define SET_GPIO_PF3()              SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_GPIO)                          /*!< Set PF3 function to GPIO                */
#define SET_GPIO_PF4()              SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_GPIO)                          /*!< Set PF4 function to GPIO                */
#define SET_GPIO_PF5()              SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_GPIO)                          /*!< Set PF5 function to GPIO                */
#define SET_GPIO_PF6()              SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_GPIO)                          /*!< Set PF6 function to GPIO                */
#define SET_GPIO_PF7()              SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_GPIO)                          /*!< Set PF7 function to GPIO                */
#define SET_GPIO_PF8()              SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_GPIO)                          /*!< Set PF8 function to GPIO                */
#define SET_GPIO_PF9()              SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_GPIO)                          /*!< Set PF9 function to GPIO                */
#define SET_GPIO_PG0()              SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_GPIO)                          /*!< Set PG0 function to GPIO                */
#define SET_GPIO_PG1()              SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_GPIO)                          /*!< Set PG1 function to GPIO                */
#define SET_GPIO_PG10()             SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_GPIO)                        /*!< Set PG10 function to GPIO               */
#define SET_GPIO_PG11()             SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_GPIO)                        /*!< Set PG11 function to GPIO               */
#define SET_GPIO_PG12()             SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_GPIO)                        /*!< Set PG12 function to GPIO               */
#define SET_GPIO_PG13()             SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_GPIO)                        /*!< Set PG13 function to GPIO               */
#define SET_GPIO_PG14()             SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_GPIO)                        /*!< Set PG14 function to GPIO               */
#define SET_GPIO_PG15()             SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_GPIO)                        /*!< Set PG15 function to GPIO               */
#define SET_GPIO_PG2()              SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_GPIO)                          /*!< Set PG2 function to GPIO                */
#define SET_GPIO_PG3()              SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_GPIO)                          /*!< Set PG3 function to GPIO                */
#define SET_GPIO_PG4()              SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_GPIO)                          /*!< Set PG4 function to GPIO                */
#define SET_GPIO_PG5()              SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_GPIO)                          /*!< Set PG5 function to GPIO                */
#define SET_GPIO_PG6()              SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_GPIO)                          /*!< Set PG6 function to GPIO                */
#define SET_GPIO_PG7()              SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_GPIO)                          /*!< Set PG7 function to GPIO                */
#define SET_GPIO_PG8()              SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_GPIO)                          /*!< Set PG8 function to GPIO                */
#define SET_GPIO_PG9()              SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_GPIO)                          /*!< Set PG9 function to GPIO                */
#define SET_GPIO_PH0()              SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_GPIO)                          /*!< Set PH0 function to GPIO                */
#define SET_GPIO_PH1()              SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_GPIO)                          /*!< Set PH1 function to GPIO                */
#define SET_GPIO_PH10()             SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_GPIO)                        /*!< Set PH10 function to GPIO               */
#define SET_GPIO_PH11()             SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_GPIO)                        /*!< Set PH11 function to GPIO               */
#define SET_GPIO_PH12()             SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_GPIO)                        /*!< Set PH12 function to GPIO               */
#define SET_GPIO_PH13()             SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_GPIO)                        /*!< Set PH13 function to GPIO               */
#define SET_GPIO_PH14()             SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_GPIO)                        /*!< Set PH14 function to GPIO               */
#define SET_GPIO_PH15()             SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_GPIO)                        /*!< Set PH15 function to GPIO               */
#define SET_GPIO_PH2()              SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_GPIO)                          /*!< Set PH2 function to GPIO                */
#define SET_GPIO_PH3()              SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_GPIO)                          /*!< Set PH3 function to GPIO                */
#define SET_GPIO_PH4()              SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_GPIO)                          /*!< Set PH4 function to GPIO                */
#define SET_GPIO_PH5()              SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH5MFP_Msk)) | SYS_GPH_MFP1_PH5MFP_GPIO)                          /*!< Set PH5 function to GPIO                */
#define SET_GPIO_PH6()              SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH6MFP_Msk)) | SYS_GPH_MFP1_PH6MFP_GPIO)                          /*!< Set PH6 function to GPIO                */
#define SET_GPIO_PH7()              SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH7MFP_Msk)) | SYS_GPH_MFP1_PH7MFP_GPIO)                          /*!< Set PH7 function to GPIO                */
#define SET_GPIO_PH8()              SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_GPIO)                          /*!< Set PH8 function to GPIO                */
#define SET_GPIO_PH9()              SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_GPIO)                          /*!< Set PH9 function to GPIO                */
#define SET_GPIO_PI10()             SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_GPIO)                        /*!< Set PI10 function to GPIO               */
#define SET_GPIO_PI11()             SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI11MFP_Msk)) | SYS_GPI_MFP2_PI11MFP_GPIO)                        /*!< Set PI11 function to GPIO               */
#define SET_GPIO_PI12()             SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_GPIO)                        /*!< Set PI12 function to GPIO               */
#define SET_GPIO_PI13()             SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_GPIO)                        /*!< Set PI13 function to GPIO               */
#define SET_GPIO_PI14()             SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_GPIO)                        /*!< Set PI14 function to GPIO               */
#define SET_GPIO_PI15()             SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_GPIO)                        /*!< Set PI15 function to GPIO               */
#define SET_GPIO_PI6()              SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_GPIO)                          /*!< Set PI6 function to GPIO                */
#define SET_GPIO_PI7()              SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_GPIO)                          /*!< Set PI7 function to GPIO                */
#define SET_GPIO_PI8()              SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_GPIO)                          /*!< Set PI8 function to GPIO                */
#define SET_GPIO_PI9()              SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_GPIO)                          /*!< Set PI9 function to GPIO                */
#define SET_GPIO_PJ0()              SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ0MFP_Msk)) | SYS_GPJ_MFP0_PJ0MFP_GPIO)                          /*!< Set PJ0 function to GPIO                */
#define SET_GPIO_PJ1()              SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ1MFP_Msk)) | SYS_GPJ_MFP0_PJ1MFP_GPIO)                          /*!< Set PJ1 function to GPIO                */
#define SET_GPIO_PJ10()             SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ10MFP_Msk)) | SYS_GPJ_MFP2_PJ10MFP_GPIO)                        /*!< Set PJ10 function to GPIO               */
#define SET_GPIO_PJ11()             SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ11MFP_Msk)) | SYS_GPJ_MFP2_PJ11MFP_GPIO)                        /*!< Set PJ11 function to GPIO               */
#define SET_GPIO_PJ12()             SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_GPIO)                        /*!< Set PJ12 function to GPIO               */
#define SET_GPIO_PJ13()             SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ13MFP_Msk)) | SYS_GPJ_MFP3_PJ13MFP_GPIO)                        /*!< Set PJ13 function to GPIO               */
#define SET_GPIO_PJ2()              SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_GPIO)                          /*!< Set PJ2 function to GPIO                */
#define SET_GPIO_PJ3()              SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_GPIO)                          /*!< Set PJ3 function to GPIO                */
#define SET_GPIO_PJ4()              SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_GPIO)                          /*!< Set PJ4 function to GPIO                */
#define SET_GPIO_PJ5()              SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_GPIO)                          /*!< Set PJ5 function to GPIO                */
#define SET_GPIO_PJ6()              SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ6MFP_Msk)) | SYS_GPJ_MFP1_PJ6MFP_GPIO)                          /*!< Set PJ6 function to GPIO                */
#define SET_GPIO_PJ7()              SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ7MFP_Msk)) | SYS_GPJ_MFP1_PJ7MFP_GPIO)                          /*!< Set PJ7 function to GPIO                */
#define SET_GPIO_PJ8()              SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ8MFP_Msk)) | SYS_GPJ_MFP2_PJ8MFP_GPIO)                          /*!< Set PJ8 function to GPIO                */
#define SET_GPIO_PJ9()              SYS->GPJ_MFP2 = ((SYS->GPJ_MFP2 & (~SYS_GPJ_MFP2_PJ9MFP_Msk)) | SYS_GPJ_MFP2_PJ9MFP_GPIO)                          /*!< Set PJ9 function to GPIO                */
#define SET_HSUSB_VBUS_EN_PB10()    SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_HSUSB_VBUS_EN)               /*!< Set PB10 function to HSUSB_VBUS_EN      */
#define SET_HSUSB_VBUS_EN_PB15()    SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_HSUSB_VBUS_EN)               /*!< Set PB15 function to HSUSB_VBUS_EN      */
#define SET_HSUSB_VBUS_EN_PB6()     SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_HSUSB_VBUS_EN)                 /*!< Set PB6 function to HSUSB_VBUS_EN       */
#define SET_HSUSB_VBUS_EN_PJ13()    SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ13MFP_Msk)) | SYS_GPJ_MFP3_PJ13MFP_HSUSB_VBUS_EN)               /*!< Set PJ13 function to HSUSB_VBUS_EN      */
#define SET_HSUSB_VBUS_ST_PB11()    SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_HSUSB_VBUS_ST)               /*!< Set PB11 function to HSUSB_VBUS_ST      */
#define SET_HSUSB_VBUS_ST_PB13()    SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_HSUSB_VBUS_ST)               /*!< Set PB13 function to HSUSB_VBUS_ST      */
#define SET_HSUSB_VBUS_ST_PB7()     SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_HSUSB_VBUS_ST)                 /*!< Set PB7 function to HSUSB_VBUS_ST       */
#define SET_HSUSB_VBUS_ST_PC14()    SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_HSUSB_VBUS_ST)               /*!< Set PC14 function to HSUSB_VBUS_ST      */
#define SET_HSUSB_VBUS_ST_PJ12()    SYS->GPJ_MFP3 = ((SYS->GPJ_MFP3 & (~SYS_GPJ_MFP3_PJ12MFP_Msk)) | SYS_GPJ_MFP3_PJ12MFP_HSUSB_VBUS_ST)               /*!< Set PJ12 function to HSUSB_VBUS_ST      */
#define SET_I2C0_SCL_PA5()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_I2C0_SCL)                      /*!< Set PA5 function to I2C0_SCL            */
#define SET_I2C0_SCL_PB5()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_I2C0_SCL)                      /*!< Set PB5 function to I2C0_SCL            */
#define SET_I2C0_SCL_PB9()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_I2C0_SCL)                      /*!< Set PB9 function to I2C0_SCL            */
#define SET_I2C0_SCL_PC1()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_I2C0_SCL)                      /*!< Set PC1 function to I2C0_SCL            */
#define SET_I2C0_SCL_PC12()         SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_I2C0_SCL)                    /*!< Set PC12 function to I2C0_SCL           */
#define SET_I2C0_SCL_PE13()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_I2C0_SCL)                    /*!< Set PE13 function to I2C0_SCL           */
#define SET_I2C0_SCL_PF0()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_I2C0_SCL)                      /*!< Set PF0 function to I2C0_SCL            */
#define SET_I2C0_SCL_PF3()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_I2C0_SCL)                      /*!< Set PF3 function to I2C0_SCL            */
#define SET_I2C0_SCL_PG0()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_I2C0_SCL)                      /*!< Set PG0 function to I2C0_SCL            */
#define SET_I2C0_SCL_PG13()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_I2C0_SCL)                    /*!< Set PG13 function to I2C0_SCL           */
#define SET_I2C0_SCL_PH2()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_I2C0_SCL)                      /*!< Set PH2 function to I2C0_SCL            */
#define SET_I2C0_SCL_PI10()         SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_I2C0_SCL)                    /*!< Set PI10 function to I2C0_SCL           */
#define SET_I2C0_SDA_PA4()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_I2C0_SDA)                      /*!< Set PA4 function to I2C0_SDA            */
#define SET_I2C0_SDA_PB4()          SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_I2C0_SDA)                      /*!< Set PB4 function to I2C0_SDA            */
#define SET_I2C0_SDA_PB8()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_I2C0_SDA)                      /*!< Set PB8 function to I2C0_SDA            */
#define SET_I2C0_SDA_PC0()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_I2C0_SDA)                      /*!< Set PC0 function to I2C0_SDA            */
#define SET_I2C0_SDA_PC11()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_I2C0_SDA)                    /*!< Set PC11 function to I2C0_SDA           */
#define SET_I2C0_SDA_PC8()          SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_I2C0_SDA)                      /*!< Set PC8 function to I2C0_SDA            */
#define SET_I2C0_SDA_PF1()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_I2C0_SDA)                      /*!< Set PF1 function to I2C0_SDA            */
