OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_I2C0_SDA_PF2()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_I2C0_SDA)                      /*!< Set PF2 function to I2C0_SDA            */
#define SET_I2C0_SDA_PG1()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_I2C0_SDA)                      /*!< Set PG1 function to I2C0_SDA            */
#define SET_I2C0_SDA_PG14()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_I2C0_SDA)                    /*!< Set PG14 function to I2C0_SDA           */
#define SET_I2C0_SDA_PH3()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_I2C0_SDA)                      /*!< Set PH3 function to I2C0_SDA            */
#define SET_I2C0_SDA_PI11()         SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI11MFP_Msk)) | SYS_GPI_MFP2_PI11MFP_I2C0_SDA)                    /*!< Set PI11 function to I2C0_SDA           */
#define SET_I2C0_SMBAL_PA3()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_I2C0_SMBAL)                    /*!< Set PA3 function to I2C0_SMBAL          */
#define SET_I2C0_SMBAL_PC3()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_I2C0_SMBAL)                    /*!< Set PC3 function to I2C0_SMBAL          */
#define SET_I2C0_SMBAL_PG2()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_I2C0_SMBAL)                    /*!< Set PG2 function to I2C0_SMBAL          */
#define SET_I2C0_SMBAL_PI8()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_I2C0_SMBAL)                    /*!< Set PI8 function to I2C0_SMBAL          */
#define SET_I2C0_SMBSUS_PA2()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_I2C0_SMBSUS)                   /*!< Set PA2 function to I2C0_SMBSUS         */
#define SET_I2C0_SMBSUS_PC2()       SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_I2C0_SMBSUS)                   /*!< Set PC2 function to I2C0_SMBSUS         */
#define SET_I2C0_SMBSUS_PG3()       SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_I2C0_SMBSUS)                   /*!< Set PG3 function to I2C0_SMBSUS         */
#define SET_I2C0_SMBSUS_PI9()       SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_I2C0_SMBSUS)                   /*!< Set PI9 function to I2C0_SMBSUS         */
#define SET_I2C1_SCL_PA12()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_I2C1_SCL)                    /*!< Set PA12 function to I2C1_SCL           */
#define SET_I2C1_SCL_PA3()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_I2C1_SCL)                      /*!< Set PA3 function to I2C1_SCL            */
#define SET_I2C1_SCL_PA7()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_I2C1_SCL)                      /*!< Set PA7 function to I2C1_SCL            */
#define SET_I2C1_SCL_PB1()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_I2C1_SCL)                      /*!< Set PB1 function to I2C1_SCL            */
#define SET_I2C1_SCL_PB11()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_I2C1_SCL)                    /*!< Set PB11 function to I2C1_SCL           */
#define SET_I2C1_SCL_PB3()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_I2C1_SCL)                      /*!< Set PB3 function to I2C1_SCL            */
#define SET_I2C1_SCL_PC5()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_I2C1_SCL)                      /*!< Set PC5 function to I2C1_SCL            */
#define SET_I2C1_SCL_PE1()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_I2C1_SCL)                      /*!< Set PE1 function to I2C1_SCL            */
#define SET_I2C1_SCL_PE14()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_I2C1_SCL)                    /*!< Set PE14 function to I2C1_SCL           */
#define SET_I2C1_SCL_PF0()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_I2C1_SCL)                      /*!< Set PF0 function to I2C1_SCL            */
#define SET_I2C1_SCL_PG15()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_I2C1_SCL)                    /*!< Set PG15 function to I2C1_SCL           */
#define SET_I2C1_SCL_PG2()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_I2C1_SCL)                      /*!< Set PG2 function to I2C1_SCL            */
#define SET_I2C1_SCL_PI6()          SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_I2C1_SCL)                      /*!< Set PI6 function to I2C1_SCL            */
#define SET_I2C1_SDA_PA13()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_I2C1_SDA)                    /*!< Set PA13 function to I2C1_SDA           */
#define SET_I2C1_SDA_PA2()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_I2C1_SDA)                      /*!< Set PA2 function to I2C1_SDA            */
#define SET_I2C1_SDA_PA6()          SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_I2C1_SDA)                      /*!< Set PA6 function to I2C1_SDA            */
#define SET_I2C1_SDA_PB0()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_I2C1_SDA)                      /*!< Set PB0 function to I2C1_SDA            */
#define SET_I2C1_SDA_PB10()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_I2C1_SDA)                    /*!< Set PB10 function to I2C1_SDA           */
#define SET_I2C1_SDA_PB2()          SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_I2C1_SDA)                      /*!< Set PB2 function to I2C1_SDA            */
#define SET_I2C1_SDA_PC4()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_I2C1_SDA)                      /*!< Set PC4 function to I2C1_SDA            */
#define SET_I2C1_SDA_PD4()          SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_I2C1_SDA)                      /*!< Set PD4 function to I2C1_SDA            */
#define SET_I2C1_SDA_PE0()          SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_I2C1_SDA)                      /*!< Set PE0 function to I2C1_SDA            */
#define SET_I2C1_SDA_PE15()         SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_I2C1_SDA)                    /*!< Set PE15 function to I2C1_SDA           */
#define SET_I2C1_SDA_PF1()          SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_I2C1_SDA)                      /*!< Set PF1 function to I2C1_SDA            */
#define SET_I2C1_SDA_PG3()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_I2C1_SDA)                      /*!< Set PG3 function to I2C1_SDA            */
#define SET_I2C1_SDA_PI7()          SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_I2C1_SDA)                      /*!< Set PI7 function to I2C1_SDA            */
#define SET_I2C1_SMBAL_PB9()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_I2C1_SMBAL)                    /*!< Set PB9 function to I2C1_SMBAL          */
#define SET_I2C1_SMBAL_PC7()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_I2C1_SMBAL)                    /*!< Set PC7 function to I2C1_SMBAL          */
#define SET_I2C1_SMBAL_PG0()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_I2C1_SMBAL)                    /*!< Set PG0 function to I2C1_SMBAL          */
#define SET_I2C1_SMBAL_PH8()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_I2C1_SMBAL)                    /*!< Set PH8 function to I2C1_SMBAL          */
#define SET_I2C1_SMBSUS_PB8()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_I2C1_SMBSUS)                   /*!< Set PB8 function to I2C1_SMBSUS         */
#define SET_I2C1_SMBSUS_PC6()       SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_I2C1_SMBSUS)                   /*!< Set PC6 function to I2C1_SMBSUS         */
#define SET_I2C1_SMBSUS_PG1()       SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_I2C1_SMBSUS)                   /*!< Set PG1 function to I2C1_SMBSUS         */
#define SET_I2C1_SMBSUS_PH9()       SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_I2C1_SMBSUS)                   /*!< Set PH9 function to I2C1_SMBSUS         */
#define SET_I2C2_SCL_PA1()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_I2C2_SCL)                      /*!< Set PA1 function to I2C2_SCL            */
#define SET_I2C2_SCL_PA11()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_I2C2_SCL)                    /*!< Set PA11 function to I2C2_SCL           */
#define SET_I2C2_SCL_PA14()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_I2C2_SCL)                    /*!< Set PA14 function to I2C2_SCL           */
#define SET_I2C2_SCL_PB13()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_I2C2_SCL)                    /*!< Set PB13 function to I2C2_SCL           */
#define SET_I2C2_SCL_PD1()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_I2C2_SCL)                      /*!< Set PD1 function to I2C2_SCL            */
#define SET_I2C2_SCL_PD9()          SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_I2C2_SCL)                      /*!< Set PD9 function to I2C2_SCL            */
#define SET_I2C2_SCL_PH8()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_I2C2_SCL)                      /*!< Set PH8 function to I2C2_SCL            */
#define SET_I2C2_SDA_PA0()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_I2C2_SDA)                      /*!< Set PA0 function to I2C2_SDA            */
#define SET_I2C2_SDA_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_I2C2_SDA)                    /*!< Set PA10 function to I2C2_SDA           */
#define SET_I2C2_SDA_PA15()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_I2C2_SDA)                    /*!< Set PA15 function to I2C2_SDA           */
#define SET_I2C2_SDA_PB12()         SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_I2C2_SDA)                    /*!< Set PB12 function to I2C2_SDA           */
#define SET_I2C2_SDA_PD0()          SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_I2C2_SDA)                      /*!< Set PD0 function to I2C2_SDA            */
#define SET_I2C2_SDA_PD8()          SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_I2C2_SDA)                      /*!< Set PD8 function to I2C2_SDA            */
#define SET_I2C2_SDA_PH9()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_I2C2_SDA)                      /*!< Set PH9 function to I2C2_SDA            */
#define SET_I2C2_SMBAL_PB15()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_I2C2_SMBAL)                  /*!< Set PB15 function to I2C2_SMBAL         */
#define SET_I2C2_SMBAL_PF3()        SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_I2C2_SMBAL)                    /*!< Set PF3 function to I2C2_SMBAL          */
#define SET_I2C2_SMBSUS_PB14()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_I2C2_SMBSUS)                 /*!< Set PB14 function to I2C2_SMBSUS        */
#define SET_I2C2_SMBSUS_PF2()       SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_I2C2_SMBSUS)                   /*!< Set PF2 function to I2C2_SMBSUS         */
#define SET_I2C3_SCL_PC3()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_I2C3_SCL)                      /*!< Set PC3 function to I2C3_SCL            */
#define SET_I2C3_SCL_PG0()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_I2C3_SCL)                      /*!< Set PG0 function to I2C3_SCL            */
#define SET_I2C3_SCL_PG7()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_I2C3_SCL)                      /*!< Set PG7 function to I2C3_SCL            */
#define SET_I2C3_SCL_PH0()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_I2C3_SCL)                      /*!< Set PH0 function to I2C3_SCL            */
#define SET_I2C3_SCL_PI14()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_I2C3_SCL)                    /*!< Set PI14 function to I2C3_SCL           */
#define SET_I2C3_SCL_PJ4()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_I2C3_SCL)                      /*!< Set PJ4 function to I2C3_SCL            */
#define SET_I2C3_SDA_PC2()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_I2C3_SDA)                      /*!< Set PC2 function to I2C3_SDA            */
#define SET_I2C3_SDA_PG1()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_I2C3_SDA)                      /*!< Set PG1 function to I2C3_SDA            */
#define SET_I2C3_SDA_PG8()          SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_I2C3_SDA)                      /*!< Set PG8 function to I2C3_SDA            */
#define SET_I2C3_SDA_PH1()          SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_I2C3_SDA)                      /*!< Set PH1 function to I2C3_SDA            */
#define SET_I2C3_SDA_PI15()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_I2C3_SDA)                    /*!< Set PI15 function to I2C3_SDA           */
#define SET_I2C3_SDA_PJ5()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_I2C3_SDA)                      /*!< Set PJ5 function to I2C3_SDA            */
#define SET_I2C3_SMBAL_PC5()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_I2C3_SMBAL)                    /*!< Set PC5 function to I2C3_SMBAL          */
#define SET_I2C3_SMBAL_PG2()        SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_I2C3_SMBAL)                    /*!< Set PG2 function to I2C3_SMBAL          */
#define SET_I2C3_SMBAL_PG5()        SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_I2C3_SMBAL)                    /*!< Set PG5 function to I2C3_SMBAL          */
#define SET_I2C3_SMBAL_PI12()       SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_I2C3_SMBAL)                  /*!< Set PI12 function to I2C3_SMBAL         */
#define SET_I2C3_SMBAL_PJ2()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_I2C3_SMBAL)                    /*!< Set PJ2 function to I2C3_SMBAL          */
#define SET_I2C3_SMBSUS_PC4()       SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_I2C3_SMBSUS)                   /*!< Set PC4 function to I2C3_SMBSUS         */
#define SET_I2C3_SMBSUS_PG3()       SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_I2C3_SMBSUS)                   /*!< Set PG3 function to I2C3_SMBSUS         */
#define SET_I2C3_SMBSUS_PG6()       SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_I2C3_SMBSUS)                   /*!< Set PG6 function to I2C3_SMBSUS         */
#define SET_I2C3_SMBSUS_PI13()      SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_I2C3_SMBSUS)                 /*!< Set PI13 function to I2C3_SMBSUS        */
#define SET_I2C3_SMBSUS_PJ3()       SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_I2C3_SMBSUS)                   /*!< Set PJ3 function to I2C3_SMBSUS         */
#define SET_I2S0_BCLK_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_I2S0_BCLK)                   /*!< Set PA12 function to I2S0_BCLK          */
#define SET_I2S0_BCLK_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_I2S0_BCLK)                     /*!< Set PB5 function to I2S0_BCLK           */
#define SET_I2S0_BCLK_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_I2S0_BCLK)                     /*!< Set PC4 function to I2S0_BCLK           */
#define SET_I2S0_BCLK_PE1()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_I2S0_BCLK)                     /*!< Set PE1 function to I2S0_BCLK           */
#define SET_I2S0_BCLK_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_I2S0_BCLK)                     /*!< Set PE3 function to I2S0_BCLK           */
#define SET_I2S0_BCLK_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_I2S0_BCLK)                     /*!< Set PE8 function to I2S0_BCLK           */
#define SET_I2S0_BCLK_PF10()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_I2S0_BCLK)                   /*!< Set PF10 function to I2S0_BCLK          */
#define SET_I2S0_BCLK_PI6()         SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_I2S0_BCLK)                     /*!< Set PI6 function to I2S0_BCLK           */
#define SET_I2S0_DI_PA14()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_I2S0_DI)                     /*!< Set PA14 function to I2S0_DI            */
#define SET_I2S0_DI_PB3()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_I2S0_DI)                       /*!< Set PB3 function to I2S0_DI             */
#define SET_I2S0_DI_PC2()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_I2S0_DI)                       /*!< Set PC2 function to I2S0_DI             */
#define SET_I2S0_DI_PE10()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_I2S0_DI)                     /*!< Set PE10 function to I2S0_DI            */
#define SET_I2S0_DI_PF8()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_I2S0_DI)                       /*!< Set PF8 function to I2S0_DI             */
#define SET_I2S0_DI_PH8()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_I2S0_DI)                       /*!< Set PH8 function to I2S0_DI             */
#define SET_I2S0_DI_PI8()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_I2S0_DI)                       /*!< Set PI8 function to I2S0_DI             */
#define SET_I2S0_DO_PA15()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_I2S0_DO)                     /*!< Set PA15 function to I2S0_DO            */
#define SET_I2S0_DO_PB2()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_I2S0_DO)                       /*!< Set PB2 function to I2S0_DO             */
#define SET_I2S0_DO_PC1()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_I2S0_DO)                       /*!< Set PC1 function to I2S0_DO             */
#define SET_I2S0_DO_PE11()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_I2S0_DO)                     /*!< Set PE11 function to I2S0_DO            */
#define SET_I2S0_DO_PF0()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_I2S0_DO)                       /*!< Set PF0 function to I2S0_DO             */
#define SET_I2S0_DO_PF7()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_I2S0_DO)                       /*!< Set PF7 function to I2S0_DO             */
#define SET_I2S0_DO_PH9()           SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_I2S0_DO)                       /*!< Set PH9 function to I2S0_DO             */
#define SET_I2S0_DO_PI9()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_I2S0_DO)                       /*!< Set PI9 function to I2S0_DO             */
#define SET_I2S0_LRCK_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_I2S0_LRCK)                     /*!< Set PB1 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PC0()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_I2S0_LRCK)                     /*!< Set PC0 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_I2S0_LRCK)                   /*!< Set PE12 function to I2S0_LRCK          */
#define SET_I2S0_LRCK_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_I2S0_LRCK)                     /*!< Set PF1 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_I2S0_LRCK)                     /*!< Set PF6 function to I2S0_LRCK           */
#define SET_I2S0_LRCK_PH10()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_I2S0_LRCK)                   /*!< Set PH10 function to I2S0_LRCK          */
#define SET_I2S0_LRCK_PI10()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_I2S0_LRCK)                   /*!< Set PI10 function to I2S0_LRCK          */
#define SET_I2S0_MCLK_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_I2S0_MCLK)                   /*!< Set PA13 function to I2S0_MCLK          */
#define SET_I2S0_MCLK_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_I2S0_MCLK)                     /*!< Set PB4 function to I2S0_MCLK           */
#define SET_I2S0_MCLK_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_I2S0_MCLK)                     /*!< Set PC3 function to I2S0_MCLK           */
