OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_LPI2C0_SCL_PE13()       SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_LPI2C0_SCL)                  /*!< Set PE13 function to LPI2C0_SCL         */
#define SET_LPI2C0_SCL_PF3()        SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_LPI2C0_SCL)                    /*!< Set PF3 function to LPI2C0_SCL          */
#define SET_LPI2C0_SCL_PG13()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_LPI2C0_SCL)                  /*!< Set PG13 function to LPI2C0_SCL         */
#define SET_LPI2C0_SDA_PA4()        SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_LPI2C0_SDA)                    /*!< Set PA4 function to LPI2C0_SDA          */
#define SET_LPI2C0_SDA_PB4()        SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_LPI2C0_SDA)                    /*!< Set PB4 function to LPI2C0_SDA          */
#define SET_LPI2C0_SDA_PC0()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_LPI2C0_SDA)                    /*!< Set PC0 function to LPI2C0_SDA          */
#define SET_LPI2C0_SDA_PC11()       SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_LPI2C0_SDA)                  /*!< Set PC11 function to LPI2C0_SDA         */
#define SET_LPI2C0_SDA_PC8()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_LPI2C0_SDA)                    /*!< Set PC8 function to LPI2C0_SDA          */
#define SET_LPI2C0_SDA_PF2()        SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_LPI2C0_SDA)                    /*!< Set PF2 function to LPI2C0_SDA          */
#define SET_LPI2C0_SDA_PG14()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_LPI2C0_SDA)                  /*!< Set PG14 function to LPI2C0_SDA         */
#define SET_LPIO0_PA0()             SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_LPIO0)                         /*!< Set PA0 function to LPIO0               */
#define SET_LPIO0_PE0()             SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_LPIO0)                         /*!< Set PE0 function to LPIO0               */
#define SET_LPIO1_PA1()             SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_LPIO1)                         /*!< Set PA1 function to LPIO1               */
#define SET_LPIO1_PE1()             SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_LPIO1)                         /*!< Set PE1 function to LPIO1               */
#define SET_LPIO2_PB0()             SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_LPIO2)                         /*!< Set PB0 function to LPIO2               */
#define SET_LPIO2_PF0()             SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_LPIO2)                         /*!< Set PF0 function to LPIO2               */
#define SET_LPIO3_PB1()             SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_LPIO3)                         /*!< Set PB1 function to LPIO3               */
#define SET_LPIO3_PF1()             SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_LPIO3)                         /*!< Set PF1 function to LPIO3               */
#define SET_LPIO4_PA6()             SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_LPIO4)                         /*!< Set PA6 function to LPIO4               */
#define SET_LPIO4_PC0()             SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_LPIO4)                         /*!< Set PC0 function to LPIO4               */
#define SET_LPIO5_PA7()             SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_LPIO5)                         /*!< Set PA7 function to LPIO5               */
#define SET_LPIO5_PC1()             SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_LPIO5)                         /*!< Set PC1 function to LPIO5               */
#define SET_LPIO6_PB2()             SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_LPIO6)                         /*!< Set PB2 function to LPIO6               */
#define SET_LPIO6_PD0()             SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_LPIO6)                         /*!< Set PD0 function to LPIO6               */
#define SET_LPIO7_PB3()             SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_LPIO7)                         /*!< Set PB3 function to LPIO7               */
#define SET_LPIO7_PD1()             SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_LPIO7)                         /*!< Set PD1 function to LPIO7               */
#define SET_LPSPI0_CLK_PA13()       SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_LPSPI0_CLK)                  /*!< Set PA13 function to LPSPI0_CLK         */
#define SET_LPSPI0_CLK_PA2()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_LPSPI0_CLK)                    /*!< Set PA2 function to LPSPI0_CLK          */
#define SET_LPSPI0_CLK_PB14()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_LPSPI0_CLK)                  /*!< Set PB14 function to LPSPI0_CLK         */
#define SET_LPSPI0_CLK_PD2()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_LPSPI0_CLK)                    /*!< Set PD2 function to LPSPI0_CLK          */
#define SET_LPSPI0_MISO_PA1()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_LPSPI0_MISO)                   /*!< Set PA1 function to LPSPI0_MISO         */
#define SET_LPSPI0_MISO_PA14()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_LPSPI0_MISO)                 /*!< Set PA14 function to LPSPI0_MISO        */
#define SET_LPSPI0_MISO_PB13()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_LPSPI0_MISO)                 /*!< Set PB13 function to LPSPI0_MISO        */
#define SET_LPSPI0_MISO_PD1()       SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_LPSPI0_MISO)                   /*!< Set PD1 function to LPSPI0_MISO         */
#define SET_LPSPI0_MOSI_PA0()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_LPSPI0_MOSI)                   /*!< Set PA0 function to LPSPI0_MOSI         */
#define SET_LPSPI0_MOSI_PA15()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_LPSPI0_MOSI)                 /*!< Set PA15 function to LPSPI0_MOSI        */
#define SET_LPSPI0_MOSI_PB12()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_LPSPI0_MOSI)                 /*!< Set PB12 function to LPSPI0_MOSI        */
#define SET_LPSPI0_MOSI_PD0()       SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_LPSPI0_MOSI)                   /*!< Set PD0 function to LPSPI0_MOSI         */
#define SET_LPSPI0_SS_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_LPSPI0_SS)                   /*!< Set PA12 function to LPSPI0_SS          */
#define SET_LPSPI0_SS_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_LPSPI0_SS)                     /*!< Set PA3 function to LPSPI0_SS           */
#define SET_LPSPI0_SS_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_LPSPI0_SS)                   /*!< Set PB15 function to LPSPI0_SS          */
#define SET_LPSPI0_SS_PD3()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_LPSPI0_SS)                     /*!< Set PD3 function to LPSPI0_SS           */
#define SET_LPTM0_EXT_PA11()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_LPTM0_EXT)                   /*!< Set PA11 function to LPTM0_EXT          */
#define SET_LPTM0_EXT_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_LPTM0_EXT)                   /*!< Set PB15 function to LPTM0_EXT          */
#define SET_LPTM0_PB5()             SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_LPTM0)                         /*!< Set PB5 function to LPTM0               */
#define SET_LPTM0_PC7()             SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_LPTM0)                         /*!< Set PC7 function to LPTM0               */
#define SET_LPTM0_PG2()             SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_LPTM0)                         /*!< Set PG2 function to LPTM0               */
#define SET_LPTM1_EXT_PA10()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_LPTM1_EXT)                   /*!< Set PA10 function to LPTM1_EXT          */
#define SET_LPTM1_EXT_PB14()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_LPTM1_EXT)                   /*!< Set PB14 function to LPTM1_EXT          */
#define SET_LPTM1_PB13()            SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_LPTM1)                       /*!< Set PB13 function to LPTM1              */
#define SET_LPTM1_PB4()             SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_LPTM1)                         /*!< Set PB4 function to LPTM1               */
#define SET_LPTM1_PC14()            SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_LPTM1)                       /*!< Set PC14 function to LPTM1              */
#define SET_LPTM1_PC6()             SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_LPTM1)                         /*!< Set PC6 function to LPTM1               */
#define SET_LPTM1_PG3()             SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_LPTM1)                         /*!< Set PG3 function to LPTM1               */
#define SET_LPUART0_RXD_PA0()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_LPUART0_RXD)                   /*!< Set PA0 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PA4()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_LPUART0_RXD)                   /*!< Set PA4 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PA6()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_LPUART0_RXD)                   /*!< Set PA6 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PB12()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_LPUART0_RXD)                 /*!< Set PB12 function to LPUART0_RXD        */
#define SET_LPUART0_RXD_PB8()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_LPUART0_RXD)                   /*!< Set PB8 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PC11()      SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_LPUART0_RXD)                 /*!< Set PC11 function to LPUART0_RXD        */
#define SET_LPUART0_RXD_PD2()       SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_LPUART0_RXD)                   /*!< Set PD2 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PF1()       SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_LPUART0_RXD)                   /*!< Set PF1 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PF2()       SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_LPUART0_RXD)                   /*!< Set PF2 function to LPUART0_RXD         */
#define SET_LPUART0_RXD_PH11()      SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_LPUART0_RXD)                 /*!< Set PH11 function to LPUART0_RXD        */
#define SET_LPUART0_TXD_PA1()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_LPUART0_TXD)                   /*!< Set PA1 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PA5()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_LPUART0_TXD)                   /*!< Set PA5 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PA7()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_LPUART0_TXD)                   /*!< Set PA7 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PB13()      SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_LPUART0_TXD)                 /*!< Set PB13 function to LPUART0_TXD        */
#define SET_LPUART0_TXD_PB9()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_LPUART0_TXD)                   /*!< Set PB9 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PC12()      SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_LPUART0_TXD)                 /*!< Set PC12 function to LPUART0_TXD        */
#define SET_LPUART0_TXD_PD3()       SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_LPUART0_TXD)                   /*!< Set PD3 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PF0()       SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_LPUART0_TXD)                   /*!< Set PF0 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PF3()       SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_LPUART0_TXD)                   /*!< Set PF3 function to LPUART0_TXD         */
#define SET_LPUART0_TXD_PH10()      SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_LPUART0_TXD)                 /*!< Set PH10 function to LPUART0_TXD        */
#define SET_LPUART0_nCTS_PA5()      SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_LPUART0_nCTS)                  /*!< Set PA5 function to LPUART0_nCTS        */
#define SET_LPUART0_nCTS_PB11()     SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_LPUART0_nCTS)                /*!< Set PB11 function to LPUART0_nCTS       */
#define SET_LPUART0_nCTS_PB15()     SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_LPUART0_nCTS)                /*!< Set PB15 function to LPUART0_nCTS       */
#define SET_LPUART0_nCTS_PC7()      SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_LPUART0_nCTS)                  /*!< Set PC7 function to LPUART0_nCTS        */
#define SET_LPUART0_nRTS_PA4()      SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_LPUART0_nRTS)                  /*!< Set PA4 function to LPUART0_nRTS        */
#define SET_LPUART0_nRTS_PB10()     SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_LPUART0_nRTS)                /*!< Set PB10 function to LPUART0_nRTS       */
#define SET_LPUART0_nRTS_PB14()     SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_LPUART0_nRTS)                /*!< Set PB14 function to LPUART0_nRTS       */
#define SET_LPUART0_nRTS_PC6()      SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_LPUART0_nRTS)                  /*!< Set PC6 function to LPUART0_nRTS        */
#define SET_PSIO0_CH0_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_PSIO0_CH0)                   /*!< Set PB15 function to PSIO0_CH0          */
#define SET_PSIO0_CH0_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_PSIO0_CH0)                     /*!< Set PC5 function to PSIO0_CH0           */
#define SET_PSIO0_CH0_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_PSIO0_CH0)                   /*!< Set PE14 function to PSIO0_CH0          */
#define SET_PSIO0_CH0_PE7()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_PSIO0_CH0)                     /*!< Set PE7 function to PSIO0_CH0           */
#define SET_PSIO0_CH0_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_PSIO0_CH0)                     /*!< Set PF5 function to PSIO0_CH0           */
#define SET_PSIO0_CH1_PB14()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_PSIO0_CH1)                   /*!< Set PB14 function to PSIO0_CH1          */
#define SET_PSIO0_CH1_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_PSIO0_CH1)                     /*!< Set PC4 function to PSIO0_CH1           */
#define SET_PSIO0_CH1_PE15()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_PSIO0_CH1)                   /*!< Set PE15 function to PSIO0_CH1          */
#define SET_PSIO0_CH1_PE6()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_PSIO0_CH1)                     /*!< Set PE6 function to PSIO0_CH1           */
#define SET_PSIO0_CH1_PF4()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_PSIO0_CH1)                     /*!< Set PF4 function to PSIO0_CH1           */
#define SET_PSIO0_CH2_PB13()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_PSIO0_CH2)                   /*!< Set PB13 function to PSIO0_CH2          */
#define SET_PSIO0_CH2_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_PSIO0_CH2)                     /*!< Set PC3 function to PSIO0_CH2           */
#define SET_PSIO0_CH2_PD9()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_PSIO0_CH2)                     /*!< Set PD9 function to PSIO0_CH2           */
#define SET_PSIO0_CH2_PE5()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_PSIO0_CH2)                     /*!< Set PE5 function to PSIO0_CH2           */
#define SET_PSIO0_CH3_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_PSIO0_CH3)                   /*!< Set PB12 function to PSIO0_CH3          */
#define SET_PSIO0_CH3_PC2()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_PSIO0_CH3)                     /*!< Set PC2 function to PSIO0_CH3           */
#define SET_PSIO0_CH3_PD8()         SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_PSIO0_CH3)                     /*!< Set PD8 function to PSIO0_CH3           */
#define SET_PSIO0_CH3_PE4()         SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_PSIO0_CH3)                     /*!< Set PE4 function to PSIO0_CH3           */
#define SET_PSIO0_CH4_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_PSIO0_CH4)                   /*!< Set PA12 function to PSIO0_CH4          */
#define SET_PSIO0_CH4_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_PSIO0_CH4)                     /*!< Set PA3 function to PSIO0_CH4           */
#define SET_PSIO0_CH4_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_PSIO0_CH4)                     /*!< Set PB5 function to PSIO0_CH4           */
#define SET_PSIO0_CH4_PG13()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_PSIO0_CH4)                   /*!< Set PG13 function to PSIO0_CH4          */
#define SET_PSIO0_CH5_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_PSIO0_CH5)                   /*!< Set PA13 function to PSIO0_CH5          */
#define SET_PSIO0_CH5_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_PSIO0_CH5)                     /*!< Set PA2 function to PSIO0_CH5           */
#define SET_PSIO0_CH5_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_PSIO0_CH5)                     /*!< Set PB4 function to PSIO0_CH5           */
#define SET_PSIO0_CH5_PG14()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_PSIO0_CH5)                   /*!< Set PG14 function to PSIO0_CH5          */
#define SET_PSIO0_CH6_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_PSIO0_CH6)                     /*!< Set PA1 function to PSIO0_CH6           */
#define SET_PSIO0_CH6_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_PSIO0_CH6)                   /*!< Set PA14 function to PSIO0_CH6          */
#define SET_PSIO0_CH6_PB3()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_PSIO0_CH6)                     /*!< Set PB3 function to PSIO0_CH6           */
#define SET_PSIO0_CH6_PG15()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_PSIO0_CH6)                   /*!< Set PG15 function to PSIO0_CH6          */
#define SET_PSIO0_CH7_PA0()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_PSIO0_CH7)                     /*!< Set PA0 function to PSIO0_CH7           */
#define SET_PSIO0_CH7_PA15()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_PSIO0_CH7)                   /*!< Set PA15 function to PSIO0_CH7          */
#define SET_PSIO0_CH7_PB2()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_PSIO0_CH7)                     /*!< Set PB2 function to PSIO0_CH7           */
#define SET_PSIO0_CH7_PD4()         SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_PSIO0_CH7)                     /*!< Set PD4 function to PSIO0_CH7           */
#define SET_QSPI0_CLK_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_QSPI0_CLK)                     /*!< Set PA2 function to QSPI0_CLK           */
#define SET_QSPI0_CLK_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_QSPI0_CLK)                   /*!< Set PB12 function to QSPI0_CLK          */
#define SET_QSPI0_CLK_PC14()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_QSPI0_CLK)                   /*!< Set PC14 function to QSPI0_CLK          */
#define SET_QSPI0_CLK_PC2()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_QSPI0_CLK)                     /*!< Set PC2 function to QSPI0_CLK           */
