OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_QSPI0_CLK_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_QSPI0_CLK)                     /*!< Set PF2 function to QSPI0_CLK           */
#define SET_QSPI0_CLK_PH8()         SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_QSPI0_CLK)                     /*!< Set PH8 function to QSPI0_CLK           */
#define SET_QSPI0_CLK_PI15()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_QSPI0_CLK)                   /*!< Set PI15 function to QSPI0_CLK          */
#define SET_QSPI0_MISO0_PA1()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0)                   /*!< Set PA1 function to QSPI0_MISO0         */
#define SET_QSPI0_MISO0_PC1()       SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_QSPI0_MISO0)                   /*!< Set PC1 function to QSPI0_MISO0         */
#define SET_QSPI0_MISO0_PE1()       SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_QSPI0_MISO0)                   /*!< Set PE1 function to QSPI0_MISO0         */
#define SET_QSPI0_MISO0_PE7()       SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE7MFP_Msk)) | SYS_GPE_MFP1_PE7MFP_QSPI0_MISO0)                   /*!< Set PE7 function to QSPI0_MISO0         */
#define SET_QSPI0_MISO0_PJ0()       SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ0MFP_Msk)) | SYS_GPJ_MFP0_PJ0MFP_QSPI0_MISO0)                   /*!< Set PJ0 function to QSPI0_MISO0         */
#define SET_QSPI0_MISO1_PA5()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_QSPI0_MISO1)                   /*!< Set PA5 function to QSPI0_MISO1         */
#define SET_QSPI0_MISO1_PB1()       SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_QSPI0_MISO1)                   /*!< Set PB1 function to QSPI0_MISO1         */
#define SET_QSPI0_MISO1_PC5()       SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_QSPI0_MISO1)                   /*!< Set PC5 function to QSPI0_MISO1         */
#define SET_QSPI0_MISO1_PH10()      SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_QSPI0_MISO1)                 /*!< Set PH10 function to QSPI0_MISO1        */
#define SET_QSPI0_MISO1_PI12()      SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_QSPI0_MISO1)                 /*!< Set PI12 function to QSPI0_MISO1        */
#define SET_QSPI0_MOSI0_PA0()       SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0)                   /*!< Set PA0 function to QSPI0_MOSI0         */
#define SET_QSPI0_MOSI0_PC0()       SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_QSPI0_MOSI0)                   /*!< Set PC0 function to QSPI0_MOSI0         */
#define SET_QSPI0_MOSI0_PE0()       SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_QSPI0_MOSI0)                   /*!< Set PE0 function to QSPI0_MOSI0         */
#define SET_QSPI0_MOSI0_PE6()       SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_QSPI0_MOSI0)                   /*!< Set PE6 function to QSPI0_MOSI0         */
#define SET_QSPI0_MOSI0_PJ1()       SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ1MFP_Msk)) | SYS_GPJ_MFP0_PJ1MFP_QSPI0_MOSI0)                   /*!< Set PJ1 function to QSPI0_MOSI0         */
#define SET_QSPI0_MOSI1_PA4()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_QSPI0_MOSI1)                   /*!< Set PA4 function to QSPI0_MOSI1         */
#define SET_QSPI0_MOSI1_PB0()       SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_QSPI0_MOSI1)                   /*!< Set PB0 function to QSPI0_MOSI1         */
#define SET_QSPI0_MOSI1_PC4()       SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_QSPI0_MOSI1)                   /*!< Set PC4 function to QSPI0_MOSI1         */
#define SET_QSPI0_MOSI1_PD14()      SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_QSPI0_MOSI1)                 /*!< Set PD14 function to QSPI0_MOSI1        */
#define SET_QSPI0_MOSI1_PH11()      SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_QSPI0_MOSI1)                 /*!< Set PH11 function to QSPI0_MOSI1        */
#define SET_QSPI0_MOSI1_PI13()      SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_QSPI0_MOSI1)                 /*!< Set PI13 function to QSPI0_MOSI1        */
#define SET_QSPI0_SS_PA3()          SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_QSPI0_SS)                      /*!< Set PA3 function to QSPI0_SS            */
#define SET_QSPI0_SS_PC3()          SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_QSPI0_SS)                      /*!< Set PC3 function to QSPI0_SS            */
#define SET_QSPI0_SS_PH9()          SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_QSPI0_SS)                      /*!< Set PH9 function to QSPI0_SS            */
#define SET_QSPI0_SS_PI14()         SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_QSPI0_SS)                    /*!< Set PI14 function to QSPI0_SS           */
#define SET_QSPI1_CLK_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_QSPI1_CLK)                     /*!< Set PC4 function to QSPI1_CLK           */
#define SET_QSPI1_CLK_PG12()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG12MFP_Msk)) | SYS_GPG_MFP3_PG12MFP_QSPI1_CLK)                   /*!< Set PG12 function to QSPI1_CLK          */
#define SET_QSPI1_CLK_PH15()        SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_QSPI1_CLK)                   /*!< Set PH15 function to QSPI1_CLK          */
#define SET_QSPI1_CLK_PJ3()         SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_QSPI1_CLK)                     /*!< Set PJ3 function to QSPI1_CLK           */
#define SET_QSPI1_MISO0_PA12()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_QSPI1_MISO0)                 /*!< Set PA12 function to QSPI1_MISO0        */
#define SET_QSPI1_MISO0_PC3()       SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_QSPI1_MISO0)                   /*!< Set PC3 function to QSPI1_MISO0         */
#define SET_QSPI1_MISO0_PD7()       SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD7MFP_Msk)) | SYS_GPD_MFP1_PD7MFP_QSPI1_MISO0)                   /*!< Set PD7 function to QSPI1_MISO0         */
#define SET_QSPI1_MISO0_PG13()      SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_QSPI1_MISO0)                 /*!< Set PG13 function to QSPI1_MISO0        */
#define SET_QSPI1_MISO0_PJ4()       SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_QSPI1_MISO0)                   /*!< Set PJ4 function to QSPI1_MISO0         */
#define SET_QSPI1_MISO1_PA7()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_QSPI1_MISO1)                   /*!< Set PA7 function to QSPI1_MISO1         */
#define SET_QSPI1_MISO1_PG9()       SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG9MFP_Msk)) | SYS_GPG_MFP2_PG9MFP_QSPI1_MISO1)                   /*!< Set PG9 function to QSPI1_MISO1         */
#define SET_QSPI1_MISO1_PH12()      SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_QSPI1_MISO1)                 /*!< Set PH12 function to QSPI1_MISO1        */
#define SET_QSPI1_MOSI0_PA13()      SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_QSPI1_MOSI0)                 /*!< Set PA13 function to QSPI1_MOSI0        */
#define SET_QSPI1_MOSI0_PC2()       SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_QSPI1_MOSI0)                   /*!< Set PC2 function to QSPI1_MOSI0         */
#define SET_QSPI1_MOSI0_PD13()      SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD13MFP_Msk)) | SYS_GPD_MFP3_PD13MFP_QSPI1_MOSI0)                 /*!< Set PD13 function to QSPI1_MOSI0        */
#define SET_QSPI1_MOSI0_PD6()       SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD6MFP_Msk)) | SYS_GPD_MFP1_PD6MFP_QSPI1_MOSI0)                   /*!< Set PD6 function to QSPI1_MOSI0         */
#define SET_QSPI1_MOSI0_PG14()      SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_QSPI1_MOSI0)                 /*!< Set PG14 function to QSPI1_MOSI0        */
#define SET_QSPI1_MOSI0_PJ5()       SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_QSPI1_MOSI0)                   /*!< Set PJ5 function to QSPI1_MOSI0         */
#define SET_QSPI1_MOSI1_PA6()       SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_QSPI1_MOSI1)                   /*!< Set PA6 function to QSPI1_MOSI1         */
#define SET_QSPI1_MOSI1_PG10()      SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG10MFP_Msk)) | SYS_GPG_MFP2_PG10MFP_QSPI1_MOSI1)                 /*!< Set PG10 function to QSPI1_MOSI1        */
#define SET_QSPI1_MOSI1_PH13()      SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_QSPI1_MOSI1)                 /*!< Set PH13 function to QSPI1_MOSI1        */
#define SET_QSPI1_SS_PC5()          SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_QSPI1_SS)                      /*!< Set PC5 function to QSPI1_SS            */
#define SET_QSPI1_SS_PG11()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG11MFP_Msk)) | SYS_GPG_MFP2_PG11MFP_QSPI1_SS)                    /*!< Set PG11 function to QSPI1_SS           */
#define SET_QSPI1_SS_PH14()         SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_QSPI1_SS)                    /*!< Set PH14 function to QSPI1_SS           */
#define SET_QSPI1_SS_PJ2()          SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_QSPI1_SS)                      /*!< Set PJ2 function to QSPI1_SS            */
#define SET_SC0_CLK_PA0()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_SC0_CLK)                       /*!< Set PA0 function to SC0_CLK             */
#define SET_SC0_CLK_PB5()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_SC0_CLK)                       /*!< Set PB5 function to SC0_CLK             */
#define SET_SC0_CLK_PE2()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SC0_CLK)                       /*!< Set PE2 function to SC0_CLK             */
#define SET_SC0_CLK_PF6()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_SC0_CLK)                       /*!< Set PF6 function to SC0_CLK             */
#define SET_SC0_DAT_PA1()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_SC0_DAT)                       /*!< Set PA1 function to SC0_DAT             */
#define SET_SC0_DAT_PB4()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_SC0_DAT)                       /*!< Set PB4 function to SC0_DAT             */
#define SET_SC0_DAT_PE3()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SC0_DAT)                       /*!< Set PE3 function to SC0_DAT             */
#define SET_SC0_DAT_PF7()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_SC0_DAT)                       /*!< Set PF7 function to SC0_DAT             */
#define SET_SC0_PWR_PA3()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_SC0_PWR)                       /*!< Set PA3 function to SC0_PWR             */
#define SET_SC0_PWR_PB2()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_SC0_PWR)                       /*!< Set PB2 function to SC0_PWR             */
#define SET_SC0_PWR_PE5()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_SC0_PWR)                       /*!< Set PE5 function to SC0_PWR             */
#define SET_SC0_PWR_PF9()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_SC0_PWR)                       /*!< Set PF9 function to SC0_PWR             */
#define SET_SC0_RST_PA2()           SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_SC0_RST)                       /*!< Set PA2 function to SC0_RST             */
#define SET_SC0_RST_PB3()           SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_SC0_RST)                       /*!< Set PB3 function to SC0_RST             */
#define SET_SC0_RST_PE4()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_SC0_RST)                       /*!< Set PE4 function to SC0_RST             */
#define SET_SC0_RST_PF8()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_SC0_RST)                       /*!< Set PF8 function to SC0_RST             */
#define SET_SC0_nCD_PA4()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_SC0_nCD)                       /*!< Set PA4 function to SC0_nCD             */
#define SET_SC0_nCD_PC12()          SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_SC0_nCD)                     /*!< Set PC12 function to SC0_nCD            */
#define SET_SC0_nCD_PE6()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_SC0_nCD)                       /*!< Set PE6 function to SC0_nCD             */
#define SET_SC0_nCD_PF10()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_SC0_nCD)                     /*!< Set PF10 function to SC0_nCD            */
#define SET_SC1_CLK_PB12()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SC1_CLK)                     /*!< Set PB12 function to SC1_CLK            */
#define SET_SC1_CLK_PC0()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_SC1_CLK)                       /*!< Set PC0 function to SC1_CLK             */
#define SET_SC1_CLK_PD4()           SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_SC1_CLK)                       /*!< Set PD4 function to SC1_CLK             */
#define SET_SC1_CLK_PF1()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_SC1_CLK)                       /*!< Set PF1 function to SC1_CLK             */
#define SET_SC1_CLK_PG8()           SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_SC1_CLK)                       /*!< Set PG8 function to SC1_CLK             */
#define SET_SC1_CLK_PH1()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_SC1_CLK)                       /*!< Set PH1 function to SC1_CLK             */
#define SET_SC1_CLK_PI10()          SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_SC1_CLK)                     /*!< Set PI10 function to SC1_CLK            */
#define SET_SC1_DAT_PB13()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_SC1_DAT)                     /*!< Set PB13 function to SC1_DAT            */
#define SET_SC1_DAT_PC1()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_SC1_DAT)                       /*!< Set PC1 function to SC1_DAT             */
#define SET_SC1_DAT_PF0()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_SC1_DAT)                       /*!< Set PF0 function to SC1_DAT             */
#define SET_SC1_DAT_PG15()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_SC1_DAT)                     /*!< Set PG15 function to SC1_DAT            */
#define SET_SC1_DAT_PG7()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_SC1_DAT)                       /*!< Set PG7 function to SC1_DAT             */
#define SET_SC1_DAT_PH0()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_SC1_DAT)                       /*!< Set PH0 function to SC1_DAT             */
#define SET_SC1_DAT_PI9()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_SC1_DAT)                       /*!< Set PI9 function to SC1_DAT             */
#define SET_SC1_PWR_PB15()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_SC1_PWR)                     /*!< Set PB15 function to SC1_PWR            */
#define SET_SC1_PWR_PC3()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_SC1_PWR)                       /*!< Set PC3 function to SC1_PWR             */
#define SET_SC1_PWR_PF3()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_SC1_PWR)                       /*!< Set PF3 function to SC1_PWR             */
#define SET_SC1_PWR_PG13()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_SC1_PWR)                     /*!< Set PG13 function to SC1_PWR            */
#define SET_SC1_PWR_PG5()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_SC1_PWR)                       /*!< Set PG5 function to SC1_PWR             */
#define SET_SC1_PWR_PI7()           SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_SC1_PWR)                       /*!< Set PI7 function to SC1_PWR             */
#define SET_SC1_RST_PB14()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_SC1_RST)                     /*!< Set PB14 function to SC1_RST            */
#define SET_SC1_RST_PC2()           SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_SC1_RST)                       /*!< Set PC2 function to SC1_RST             */
#define SET_SC1_RST_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_SC1_RST)                       /*!< Set PF2 function to SC1_RST             */
#define SET_SC1_RST_PG14()          SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_SC1_RST)                     /*!< Set PG14 function to SC1_RST            */
#define SET_SC1_RST_PG6()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_SC1_RST)                       /*!< Set PG6 function to SC1_RST             */
#define SET_SC1_RST_PI8()           SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_SC1_RST)                       /*!< Set PI8 function to SC1_RST             */
#define SET_SC1_nCD_PB6()           SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_SC1_nCD)                       /*!< Set PB6 function to SC1_nCD             */
#define SET_SC1_nCD_PC14()          SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_SC1_nCD)                     /*!< Set PC14 function to SC1_nCD            */
#define SET_SC1_nCD_PC4()           SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_SC1_nCD)                       /*!< Set PC4 function to SC1_nCD             */
#define SET_SC1_nCD_PD14()          SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_SC1_nCD)                     /*!< Set PD14 function to SC1_nCD            */
#define SET_SC1_nCD_PD3()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_SC1_nCD)                       /*!< Set PD3 function to SC1_nCD             */
#define SET_SC1_nCD_PG2()           SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_SC1_nCD)                       /*!< Set PG2 function to SC1_nCD             */
#define SET_SC1_nCD_PI6()           SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_SC1_nCD)                       /*!< Set PI6 function to SC1_nCD             */
#define SET_SC2_CLK_PA15()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_SC2_CLK)                     /*!< Set PA15 function to SC2_CLK            */
#define SET_SC2_CLK_PA6()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_SC2_CLK)                       /*!< Set PA6 function to SC2_CLK             */
#define SET_SC2_CLK_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_SC2_CLK)                       /*!< Set PA8 function to SC2_CLK             */
#define SET_SC2_CLK_PD0()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_SC2_CLK)                       /*!< Set PD0 function to SC2_CLK             */
#define SET_SC2_CLK_PE0()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_SC2_CLK)                       /*!< Set PE0 function to SC2_CLK             */
#define SET_SC2_CLK_PE2()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SC2_CLK)                       /*!< Set PE2 function to SC2_CLK             */
#define SET_SC2_DAT_PA14()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_SC2_DAT)                     /*!< Set PA14 function to SC2_DAT            */
#define SET_SC2_DAT_PA7()           SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_SC2_DAT)                       /*!< Set PA7 function to SC2_DAT             */
#define SET_SC2_DAT_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SC2_DAT)                       /*!< Set PA9 function to SC2_DAT             */
#define SET_SC2_DAT_PD1()           SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_SC2_DAT)                       /*!< Set PD1 function to SC2_DAT             */
#define SET_SC2_DAT_PE1()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_SC2_DAT)                       /*!< Set PE1 function to SC2_DAT             */
#define SET_SC2_DAT_PE3()           SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SC2_DAT)                       /*!< Set PE3 function to SC2_DAT             */
#define SET_SC2_PWR_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_SC2_PWR)                     /*!< Set PA11 function to SC2_PWR            */
#define SET_SC2_PWR_PA12()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_SC2_PWR)                     /*!< Set PA12 function to SC2_PWR            */
