OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_SPI2_CLK_PA13()         SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_SPI2_CLK)                    /*!< Set PA13 function to SPI2_CLK           */
#define SET_SPI2_CLK_PE8()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_SPI2_CLK)                      /*!< Set PE8 function to SPI2_CLK            */
#define SET_SPI2_CLK_PG3()          SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_SPI2_CLK)                      /*!< Set PG3 function to SPI2_CLK            */
#define SET_SPI2_I2SMCLK_PB0()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_SPI2_I2SMCLK)                  /*!< Set PB0 function to SPI2_I2SMCLK        */
#define SET_SPI2_I2SMCLK_PC13()     SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_SPI2_I2SMCLK)                /*!< Set PC13 function to SPI2_I2SMCLK       */
#define SET_SPI2_I2SMCLK_PE12()     SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_SPI2_I2SMCLK)                /*!< Set PE12 function to SPI2_I2SMCLK       */
#define SET_SPI2_I2SMCLK_PG1()      SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_SPI2_I2SMCLK)                  /*!< Set PG1 function to SPI2_I2SMCLK        */
#define SET_SPI2_MISO_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_SPI2_MISO)                   /*!< Set PA14 function to SPI2_MISO          */
#define SET_SPI2_MISO_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SPI2_MISO)                     /*!< Set PA9 function to SPI2_MISO           */
#define SET_SPI2_MISO_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_SPI2_MISO)                     /*!< Set PE9 function to SPI2_MISO           */
#define SET_SPI2_MISO_PG4()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_SPI2_MISO)                     /*!< Set PG4 function to SPI2_MISO           */
#define SET_SPI2_MOSI_PA15()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_SPI2_MOSI)                   /*!< Set PA15 function to SPI2_MOSI          */
#define SET_SPI2_MOSI_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_SPI2_MOSI)                     /*!< Set PA8 function to SPI2_MOSI           */
#define SET_SPI2_MOSI_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_SPI2_MOSI)                   /*!< Set PE10 function to SPI2_MOSI          */
#define SET_SPI2_MOSI_PF11()        SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_SPI2_MOSI)                   /*!< Set PF11 function to SPI2_MOSI          */
#define SET_SPI2_SS_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_SPI2_SS)                     /*!< Set PA11 function to SPI2_SS            */
#define SET_SPI2_SS_PA12()          SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_SPI2_SS)                     /*!< Set PA12 function to SPI2_SS            */
#define SET_SPI2_SS_PE11()          SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_SPI2_SS)                     /*!< Set PE11 function to SPI2_SS            */
#define SET_SPI2_SS_PG2()           SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_SPI2_SS)                       /*!< Set PG2 function to SPI2_SS             */
#define SET_SPI3_CLK_PB11()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_SPI3_CLK)                    /*!< Set PB11 function to SPI3_CLK           */
#define SET_SPI3_CLK_PC10()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_SPI3_CLK)                    /*!< Set PC10 function to SPI3_CLK           */
#define SET_SPI3_CLK_PE4()          SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_SPI3_CLK)                      /*!< Set PE4 function to SPI3_CLK            */
#define SET_SPI3_CLK_PG6()          SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG6MFP_Msk)) | SYS_GPG_MFP1_PG6MFP_SPI3_CLK)                      /*!< Set PG6 function to SPI3_CLK            */
#define SET_SPI3_I2SMCLK_PB1()      SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_SPI3_I2SMCLK)                  /*!< Set PB1 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PD14()     SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD14MFP_Msk)) | SYS_GPD_MFP3_PD14MFP_SPI3_I2SMCLK)                /*!< Set PD14 function to SPI3_I2SMCLK       */
#define SET_SPI3_I2SMCLK_PE6()      SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_SPI3_I2SMCLK)                  /*!< Set PE6 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PF6()      SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_SPI3_I2SMCLK)                  /*!< Set PF6 function to SPI3_I2SMCLK        */
#define SET_SPI3_I2SMCLK_PH4()      SYS->GPH_MFP1 = ((SYS->GPH_MFP1 & (~SYS_GPH_MFP1_PH4MFP_Msk)) | SYS_GPH_MFP1_PH4MFP_SPI3_I2SMCLK)                  /*!< Set PH4 function to SPI3_I2SMCLK        */
#define SET_SPI3_MISO_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_SPI3_MISO)                     /*!< Set PB9 function to SPI3_MISO           */
#define SET_SPI3_MISO_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_SPI3_MISO)                   /*!< Set PC12 function to SPI3_MISO          */
#define SET_SPI3_MISO_PE3()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_SPI3_MISO)                     /*!< Set PE3 function to SPI3_MISO           */
#define SET_SPI3_MISO_PG7()         SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG7MFP_Msk)) | SYS_GPG_MFP1_PG7MFP_SPI3_MISO)                     /*!< Set PG7 function to SPI3_MISO           */
#define SET_SPI3_MISO_PH0()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_SPI3_MISO)                     /*!< Set PH0 function to SPI3_MISO           */
#define SET_SPI3_MOSI_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_SPI3_MOSI)                     /*!< Set PB8 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_SPI3_MOSI)                   /*!< Set PC11 function to SPI3_MOSI          */
#define SET_SPI3_MOSI_PE2()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE2MFP_Msk)) | SYS_GPE_MFP0_PE2MFP_SPI3_MOSI)                     /*!< Set PE2 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PG8()         SYS->GPG_MFP2 = ((SYS->GPG_MFP2 & (~SYS_GPG_MFP2_PG8MFP_Msk)) | SYS_GPG_MFP2_PG8MFP_SPI3_MOSI)                     /*!< Set PG8 function to SPI3_MOSI           */
#define SET_SPI3_MOSI_PH1()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_SPI3_MOSI)                     /*!< Set PH1 function to SPI3_MOSI           */
#define SET_SPI3_SS_PB10()          SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_SPI3_SS)                     /*!< Set PB10 function to SPI3_SS            */
#define SET_SPI3_SS_PC9()           SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_SPI3_SS)                       /*!< Set PC9 function to SPI3_SS             */
#define SET_SPI3_SS_PE5()           SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_SPI3_SS)                       /*!< Set PE5 function to SPI3_SS             */
#define SET_SPI3_SS_PG5()           SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG5MFP_Msk)) | SYS_GPG_MFP1_PG5MFP_SPI3_SS)                       /*!< Set PG5 function to SPI3_SS             */
#define SET_SPIM0_CLKN_PH12()       SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH12MFP_Msk)) | SYS_GPH_MFP3_PH12MFP_SPIM0_CLKN)                  /*!< Set PH12 function to SPIM0_CLKN         */
#define SET_SPIM0_CLK_PH13()        SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH13MFP_Msk)) | SYS_GPH_MFP3_PH13MFP_SPIM0_CLK)                   /*!< Set PH13 function to SPIM0_CLK          */
#define SET_SPIM0_D2_PJ5()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ5MFP_Msk)) | SYS_GPJ_MFP1_PJ5MFP_SPIM0_D2)                      /*!< Set PJ5 function to SPIM0_D2            */
#define SET_SPIM0_D3_PJ6()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ6MFP_Msk)) | SYS_GPJ_MFP1_PJ6MFP_SPIM0_D3)                      /*!< Set PJ6 function to SPIM0_D3            */
#define SET_SPIM0_D4_PH14()         SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH14MFP_Msk)) | SYS_GPH_MFP3_PH14MFP_SPIM0_D4)                    /*!< Set PH14 function to SPIM0_D4           */
#define SET_SPIM0_D5_PH15()         SYS->GPH_MFP3 = ((SYS->GPH_MFP3 & (~SYS_GPH_MFP3_PH15MFP_Msk)) | SYS_GPH_MFP3_PH15MFP_SPIM0_D5)                    /*!< Set PH15 function to SPIM0_D5           */
#define SET_SPIM0_D6_PG13()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_SPIM0_D6)                    /*!< Set PG13 function to SPIM0_D6           */
#define SET_SPIM0_D7_PG14()         SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_SPIM0_D7)                    /*!< Set PG14 function to SPIM0_D7           */
#define SET_SPIM0_MISO_PJ4()        SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ4MFP_Msk)) | SYS_GPJ_MFP1_PJ4MFP_SPIM0_MISO)                    /*!< Set PJ4 function to SPIM0_MISO          */
#define SET_SPIM0_MOSI_PJ3()        SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ3MFP_Msk)) | SYS_GPJ_MFP0_PJ3MFP_SPIM0_MOSI)                    /*!< Set PJ3 function to SPIM0_MOSI          */
#define SET_SPIM0_RESETN_PJ2()      SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ2MFP_Msk)) | SYS_GPJ_MFP0_PJ2MFP_SPIM0_RESETN)                  /*!< Set PJ2 function to SPIM0_RESETN        */
#define SET_SPIM0_RWDS_PG15()       SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG15MFP_Msk)) | SYS_GPG_MFP3_PG15MFP_SPIM0_RWDS)                  /*!< Set PG15 function to SPIM0_RWDS         */
#define SET_SPIM0_SS_PJ7()          SYS->GPJ_MFP1 = ((SYS->GPJ_MFP1 & (~SYS_GPJ_MFP1_PJ7MFP_Msk)) | SYS_GPJ_MFP1_PJ7MFP_SPIM0_SS)                      /*!< Set PJ7 function to SPIM0_SS            */
#define SET_SWDH_CLK_PA10()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_SWDH_CLK)                    /*!< Set PA10 function to SWDH_CLK           */
#define SET_SWDH_DAT_PA9()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_SWDH_DAT)                      /*!< Set PA9 function to SWDH_DAT            */
#define SET_SWODEC_SWO_PB12()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_SWODEC_SWO)                  /*!< Set PB12 function to SWODEC_SWO         */
#define SET_SWODEC_SWO_PC8()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_SWODEC_SWO)                    /*!< Set PC8 function to SWODEC_SWO          */
#define SET_SWODEC_SWO_PF4()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_SWODEC_SWO)                    /*!< Set PF4 function to SWODEC_SWO          */
#define SET_TAMPER0_PF6()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_TAMPER0)                       /*!< Set PF6 function to TAMPER0             */
#define SET_TAMPER1_PF7()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_TAMPER1)                       /*!< Set PF7 function to TAMPER1             */
#define SET_TAMPER2_PF8()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF8MFP_Msk)) | SYS_GPF_MFP2_PF8MFP_TAMPER2)                       /*!< Set PF8 function to TAMPER2             */
#define SET_TAMPER3_PF9()           SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF9MFP_Msk)) | SYS_GPF_MFP2_PF9MFP_TAMPER3)                       /*!< Set PF9 function to TAMPER3             */
#define SET_TAMPER4_PF10()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF10MFP_Msk)) | SYS_GPF_MFP2_PF10MFP_TAMPER4)                     /*!< Set PF10 function to TAMPER4            */
#define SET_TAMPER5_PF11()          SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_TAMPER5)                     /*!< Set PF11 function to TAMPER5            */
#define SET_TM0_EXT_PA11()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA11MFP_Msk)) | SYS_GPA_MFP2_PA11MFP_TM0_EXT)                     /*!< Set PA11 function to TM0_EXT            */
#define SET_TM0_EXT_PB15()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_TM0_EXT)                     /*!< Set PB15 function to TM0_EXT            */
#define SET_TM0_EXT_PF3()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_TM0_EXT)                       /*!< Set PF3 function to TM0_EXT             */
#define SET_TM0_EXT_PH0()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH0MFP_Msk)) | SYS_GPH_MFP0_PH0MFP_TM0_EXT)                       /*!< Set PH0 function to TM0_EXT             */
#define SET_TM0_PB5()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_TM0)                           /*!< Set PB5 function to TM0                 */
#define SET_TM0_PC7()               SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_TM0)                           /*!< Set PC7 function to TM0                 */
#define SET_TM0_PG2()               SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG2MFP_Msk)) | SYS_GPG_MFP0_PG2MFP_TM0)                           /*!< Set PG2 function to TM0                 */
#define SET_TM1_EXT_PA10()          SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_TM1_EXT)                     /*!< Set PA10 function to TM1_EXT            */
#define SET_TM1_EXT_PB14()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_TM1_EXT)                     /*!< Set PB14 function to TM1_EXT            */
#define SET_TM1_EXT_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_TM1_EXT)                       /*!< Set PF2 function to TM1_EXT             */
#define SET_TM1_EXT_PH1()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH1MFP_Msk)) | SYS_GPH_MFP0_PH1MFP_TM1_EXT)                       /*!< Set PH1 function to TM1_EXT             */
#define SET_TM1_PB4()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_TM1)                           /*!< Set PB4 function to TM1                 */
#define SET_TM1_PB6()               SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_TM1)                           /*!< Set PB6 function to TM1                 */
#define SET_TM1_PC14()              SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_TM1)                         /*!< Set PC14 function to TM1                */
#define SET_TM1_PC6()               SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_TM1)                           /*!< Set PC6 function to TM1                 */
#define SET_TM1_PG3()               SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_TM1)                           /*!< Set PG3 function to TM1                 */
#define SET_TM2_EXT_PA9()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_TM2_EXT)                       /*!< Set PA9 function to TM2_EXT             */
#define SET_TM2_EXT_PB13()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_TM2_EXT)                     /*!< Set PB13 function to TM2_EXT            */
#define SET_TM2_EXT_PH2()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_TM2_EXT)                       /*!< Set PH2 function to TM2_EXT             */
#define SET_TM2_PA7()               SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_TM2)                           /*!< Set PA7 function to TM2                 */
#define SET_TM2_PB3()               SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_TM2)                           /*!< Set PB3 function to TM2                 */
#define SET_TM2_PD0()               SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_TM2)                           /*!< Set PD0 function to TM2                 */
#define SET_TM2_PG4()               SYS->GPG_MFP1 = ((SYS->GPG_MFP1 & (~SYS_GPG_MFP1_PG4MFP_Msk)) | SYS_GPG_MFP1_PG4MFP_TM2)                           /*!< Set PG4 function to TM2                 */
#define SET_TM3_EXT_PA8()           SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_TM3_EXT)                       /*!< Set PA8 function to TM3_EXT             */
#define SET_TM3_EXT_PB12()          SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_TM3_EXT)                     /*!< Set PB12 function to TM3_EXT            */
#define SET_TM3_EXT_PH3()           SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_TM3_EXT)                       /*!< Set PH3 function to TM3_EXT             */
#define SET_TM3_PA6()               SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_TM3)                           /*!< Set PA6 function to TM3                 */
#define SET_TM3_PB2()               SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_TM3)                           /*!< Set PB2 function to TM3                 */
#define SET_TM3_PF11()              SYS->GPF_MFP2 = ((SYS->GPF_MFP2 & (~SYS_GPF_MFP2_PF11MFP_Msk)) | SYS_GPF_MFP2_PF11MFP_TM3)                         /*!< Set PF11 function to TM3                */
#define SET_TRACE_CLK_PE12()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_TRACE_CLK)                   /*!< Set PE12 function to TRACE_CLK          */
#define SET_TRACE_DATA0_PE11()      SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_TRACE_DATA0)                 /*!< Set PE11 function to TRACE_DATA0        */
#define SET_TRACE_DATA1_PE10()      SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_TRACE_DATA1)                 /*!< Set PE10 function to TRACE_DATA1        */
#define SET_TRACE_DATA2_PE9()       SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_TRACE_DATA2)                   /*!< Set PE9 function to TRACE_DATA2         */
#define SET_TRACE_DATA3_PE8()       SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_TRACE_DATA3)                   /*!< Set PE8 function to TRACE_DATA3         */
#define SET_TRACE_SWO_PB7()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_TRACE_SWO)                     /*!< Set PB7 function to TRACE_SWO           */
#define SET_TRACE_SWO_PC14()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_TRACE_SWO)                   /*!< Set PC14 function to TRACE_SWO          */
#define SET_TRACE_SWO_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_TRACE_SWO)                   /*!< Set PE13 function to TRACE_SWO          */
#define SET_TRACE_SWO_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_TRACE_SWO)                     /*!< Set PF6 function to TRACE_SWO           */
#define SET_UART0_RXD_PA0()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_UART0_RXD)                     /*!< Set PA0 function to UART0_RXD           */
#define SET_UART0_RXD_PA15()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA15MFP_Msk)) | SYS_GPA_MFP3_PA15MFP_UART0_RXD)                   /*!< Set PA15 function to UART0_RXD          */
#define SET_UART0_RXD_PA4()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_UART0_RXD)                     /*!< Set PA4 function to UART0_RXD           */
#define SET_UART0_RXD_PA6()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_UART0_RXD)                     /*!< Set PA6 function to UART0_RXD           */
#define SET_UART0_RXD_PB12()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_UART0_RXD)                   /*!< Set PB12 function to UART0_RXD          */
#define SET_UART0_RXD_PB8()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_UART0_RXD)                     /*!< Set PB8 function to UART0_RXD           */
#define SET_UART0_RXD_PC11()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC11MFP_Msk)) | SYS_GPC_MFP2_PC11MFP_UART0_RXD)                   /*!< Set PC11 function to UART0_RXD          */
#define SET_UART0_RXD_PD2()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_UART0_RXD)                     /*!< Set PD2 function to UART0_RXD           */
#define SET_UART0_RXD_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_UART0_RXD)                     /*!< Set PF1 function to UART0_RXD           */
#define SET_UART0_RXD_PF2()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_UART0_RXD)                     /*!< Set PF2 function to UART0_RXD           */
#define SET_UART0_RXD_PG3()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_UART0_RXD)                     /*!< Set PG3 function to UART0_RXD           */
#define SET_UART0_RXD_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_UART0_RXD)                   /*!< Set PH11 function to UART0_RXD          */
#define SET_UART0_TXD_PA1()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_UART0_TXD)                     /*!< Set PA1 function to UART0_TXD           */
#define SET_UART0_TXD_PA14()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA14MFP_Msk)) | SYS_GPA_MFP3_PA14MFP_UART0_TXD)                   /*!< Set PA14 function to UART0_TXD          */
#define SET_UART0_TXD_PA5()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_UART0_TXD)                     /*!< Set PA5 function to UART0_TXD           */
#define SET_UART0_TXD_PA7()         SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_UART0_TXD)                     /*!< Set PA7 function to UART0_TXD           */
