OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_UART0_TXD_PB13()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_UART0_TXD)                   /*!< Set PB13 function to UART0_TXD          */
#define SET_UART0_TXD_PB9()         SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_UART0_TXD)                     /*!< Set PB9 function to UART0_TXD           */
#define SET_UART0_TXD_PC12()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC12MFP_Msk)) | SYS_GPC_MFP3_PC12MFP_UART0_TXD)                   /*!< Set PC12 function to UART0_TXD          */
#define SET_UART0_TXD_PD3()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_UART0_TXD)                     /*!< Set PD3 function to UART0_TXD           */
#define SET_UART0_TXD_PF0()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_UART0_TXD)                     /*!< Set PF0 function to UART0_TXD           */
#define SET_UART0_TXD_PF3()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_UART0_TXD)                     /*!< Set PF3 function to UART0_TXD           */
#define SET_UART0_TXD_PH10()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_UART0_TXD)                   /*!< Set PH10 function to UART0_TXD          */
#define SET_UART0_nCTS_PA5()        SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_UART0_nCTS)                    /*!< Set PA5 function to UART0_nCTS          */
#define SET_UART0_nCTS_PB11()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_UART0_nCTS)                  /*!< Set PB11 function to UART0_nCTS         */
#define SET_UART0_nCTS_PB15()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_UART0_nCTS)                  /*!< Set PB15 function to UART0_nCTS         */
#define SET_UART0_nCTS_PC7()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_UART0_nCTS)                    /*!< Set PC7 function to UART0_nCTS          */
#define SET_UART0_nCTS_PF5()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UART0_nCTS)                    /*!< Set PF5 function to UART0_nCTS          */
#define SET_UART0_nRTS_PA4()        SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_UART0_nRTS)                    /*!< Set PA4 function to UART0_nRTS          */
#define SET_UART0_nRTS_PB10()       SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_UART0_nRTS)                  /*!< Set PB10 function to UART0_nRTS         */
#define SET_UART0_nRTS_PB14()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_UART0_nRTS)                  /*!< Set PB14 function to UART0_nRTS         */
#define SET_UART0_nRTS_PC6()        SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UART0_nRTS)                    /*!< Set PC6 function to UART0_nRTS          */
#define SET_UART0_nRTS_PF4()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_UART0_nRTS)                    /*!< Set PF4 function to UART0_nRTS          */
#define SET_UART1_RXD_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_UART1_RXD)                     /*!< Set PA2 function to UART1_RXD           */
#define SET_UART1_RXD_PA8()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_UART1_RXD)                     /*!< Set PA8 function to UART1_RXD           */
#define SET_UART1_RXD_PB2()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB2MFP_Msk)) | SYS_GPB_MFP0_PB2MFP_UART1_RXD)                     /*!< Set PB2 function to UART1_RXD           */
#define SET_UART1_RXD_PB6()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB6MFP_Msk)) | SYS_GPB_MFP1_PB6MFP_UART1_RXD)                     /*!< Set PB6 function to UART1_RXD           */
#define SET_UART1_RXD_PC8()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_UART1_RXD)                     /*!< Set PC8 function to UART1_RXD           */
#define SET_UART1_RXD_PD10()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD10MFP_Msk)) | SYS_GPD_MFP2_PD10MFP_UART1_RXD)                   /*!< Set PD10 function to UART1_RXD          */
#define SET_UART1_RXD_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_UART1_RXD)                     /*!< Set PF1 function to UART1_RXD           */
#define SET_UART1_RXD_PG1()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_UART1_RXD)                     /*!< Set PG1 function to UART1_RXD           */
#define SET_UART1_RXD_PG14()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG14MFP_Msk)) | SYS_GPG_MFP3_PG14MFP_UART1_RXD)                   /*!< Set PG14 function to UART1_RXD          */
#define SET_UART1_RXD_PH9()         SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_UART1_RXD)                     /*!< Set PH9 function to UART1_RXD           */
#define SET_UART1_TXD_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_UART1_TXD)                     /*!< Set PA3 function to UART1_TXD           */
#define SET_UART1_TXD_PA9()         SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_UART1_TXD)                     /*!< Set PA9 function to UART1_TXD           */
#define SET_UART1_TXD_PB3()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB3MFP_Msk)) | SYS_GPB_MFP0_PB3MFP_UART1_TXD)                     /*!< Set PB3 function to UART1_TXD           */
#define SET_UART1_TXD_PB7()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB7MFP_Msk)) | SYS_GPB_MFP1_PB7MFP_UART1_TXD)                     /*!< Set PB7 function to UART1_TXD           */
#define SET_UART1_TXD_PD11()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD11MFP_Msk)) | SYS_GPD_MFP2_PD11MFP_UART1_TXD)                   /*!< Set PD11 function to UART1_TXD          */
#define SET_UART1_TXD_PE13()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE13MFP_Msk)) | SYS_GPE_MFP3_PE13MFP_UART1_TXD)                   /*!< Set PE13 function to UART1_TXD          */
#define SET_UART1_TXD_PF0()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_UART1_TXD)                     /*!< Set PF0 function to UART1_TXD           */
#define SET_UART1_TXD_PG0()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_UART1_TXD)                     /*!< Set PG0 function to UART1_TXD           */
#define SET_UART1_TXD_PG13()        SYS->GPG_MFP3 = ((SYS->GPG_MFP3 & (~SYS_GPG_MFP3_PG13MFP_Msk)) | SYS_GPG_MFP3_PG13MFP_UART1_TXD)                   /*!< Set PG13 function to UART1_TXD          */
#define SET_UART1_TXD_PH8()         SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_UART1_TXD)                     /*!< Set PH8 function to UART1_TXD           */
#define SET_UART1_nCTS_PA1()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_UART1_nCTS)                    /*!< Set PA1 function to UART1_nCTS          */
#define SET_UART1_nCTS_PB9()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB9MFP_Msk)) | SYS_GPB_MFP2_PB9MFP_UART1_nCTS)                    /*!< Set PB9 function to UART1_nCTS          */
#define SET_UART1_nCTS_PE11()       SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_UART1_nCTS)                  /*!< Set PE11 function to UART1_nCTS         */
#define SET_UART1_nRTS_PA0()        SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_UART1_nRTS)                    /*!< Set PA0 function to UART1_nRTS          */
#define SET_UART1_nRTS_PB8()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB8MFP_Msk)) | SYS_GPB_MFP2_PB8MFP_UART1_nRTS)                    /*!< Set PB8 function to UART1_nRTS          */
#define SET_UART1_nRTS_PE12()       SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE12MFP_Msk)) | SYS_GPE_MFP3_PE12MFP_UART1_nRTS)                  /*!< Set PE12 function to UART1_nRTS         */
#define SET_UART2_RXD_PB0()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_UART2_RXD)                     /*!< Set PB0 function to UART2_RXD           */
#define SET_UART2_RXD_PB4()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB4MFP_Msk)) | SYS_GPB_MFP1_PB4MFP_UART2_RXD)                     /*!< Set PB4 function to UART2_RXD           */
#define SET_UART2_RXD_PC0()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_UART2_RXD)                     /*!< Set PC0 function to UART2_RXD           */
#define SET_UART2_RXD_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_UART2_RXD)                     /*!< Set PC4 function to UART2_RXD           */
#define SET_UART2_RXD_PD12()        SYS->GPD_MFP3 = ((SYS->GPD_MFP3 & (~SYS_GPD_MFP3_PD12MFP_Msk)) | SYS_GPD_MFP3_PD12MFP_UART2_RXD)                   /*!< Set PD12 function to UART2_RXD          */
#define SET_UART2_RXD_PE15()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_UART2_RXD)                   /*!< Set PE15 function to UART2_RXD          */
#define SET_UART2_RXD_PE9()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE9MFP_Msk)) | SYS_GPE_MFP2_PE9MFP_UART2_RXD)                     /*!< Set PE9 function to UART2_RXD           */
#define SET_UART2_RXD_PF1()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_UART2_RXD)                     /*!< Set PF1 function to UART2_RXD           */
#define SET_UART2_RXD_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UART2_RXD)                     /*!< Set PF5 function to UART2_RXD           */
#define SET_UART2_RXD_PG0()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG0MFP_Msk)) | SYS_GPG_MFP0_PG0MFP_UART2_RXD)                     /*!< Set PG0 function to UART2_RXD           */
#define SET_UART2_RXD_PI11()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI11MFP_Msk)) | SYS_GPI_MFP2_PI11MFP_UART2_RXD)                   /*!< Set PI11 function to UART2_RXD          */
#define SET_UART2_RXD_PI7()         SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI7MFP_Msk)) | SYS_GPI_MFP1_PI7MFP_UART2_RXD)                     /*!< Set PI7 function to UART2_RXD           */
#define SET_UART2_TXD_PB1()         SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_UART2_TXD)                     /*!< Set PB1 function to UART2_TXD           */
#define SET_UART2_TXD_PB5()         SYS->GPB_MFP1 = ((SYS->GPB_MFP1 & (~SYS_GPB_MFP1_PB5MFP_Msk)) | SYS_GPB_MFP1_PB5MFP_UART2_TXD)                     /*!< Set PB5 function to UART2_TXD           */
#define SET_UART2_TXD_PC1()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_UART2_TXD)                     /*!< Set PC1 function to UART2_TXD           */
#define SET_UART2_TXD_PC13()        SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_UART2_TXD)                   /*!< Set PC13 function to UART2_TXD          */
#define SET_UART2_TXD_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_UART2_TXD)                     /*!< Set PC5 function to UART2_TXD           */
#define SET_UART2_TXD_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART2_TXD)                   /*!< Set PE14 function to UART2_TXD          */
#define SET_UART2_TXD_PE8()         SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE8MFP_Msk)) | SYS_GPE_MFP2_PE8MFP_UART2_TXD)                     /*!< Set PE8 function to UART2_TXD           */
#define SET_UART2_TXD_PF0()         SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_UART2_TXD)                     /*!< Set PF0 function to UART2_TXD           */
#define SET_UART2_TXD_PF4()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_UART2_TXD)                     /*!< Set PF4 function to UART2_TXD           */
#define SET_UART2_TXD_PG1()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG1MFP_Msk)) | SYS_GPG_MFP0_PG1MFP_UART2_TXD)                     /*!< Set PG1 function to UART2_TXD           */
#define SET_UART2_TXD_PI10()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI10MFP_Msk)) | SYS_GPI_MFP2_PI10MFP_UART2_TXD)                   /*!< Set PI10 function to UART2_TXD          */
#define SET_UART2_TXD_PI6()         SYS->GPI_MFP1 = ((SYS->GPI_MFP1 & (~SYS_GPI_MFP1_PI6MFP_Msk)) | SYS_GPI_MFP1_PI6MFP_UART2_TXD)                     /*!< Set PI6 function to UART2_TXD           */
#define SET_UART2_nCTS_PC2()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_UART2_nCTS)                    /*!< Set PC2 function to UART2_nCTS          */
#define SET_UART2_nCTS_PD9()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD9MFP_Msk)) | SYS_GPD_MFP2_PD9MFP_UART2_nCTS)                    /*!< Set PD9 function to UART2_nCTS          */
#define SET_UART2_nCTS_PF5()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UART2_nCTS)                    /*!< Set PF5 function to UART2_nCTS          */
#define SET_UART2_nCTS_PI9()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI9MFP_Msk)) | SYS_GPI_MFP2_PI9MFP_UART2_nCTS)                    /*!< Set PI9 function to UART2_nCTS          */
#define SET_UART2_nRTS_PC3()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_UART2_nRTS)                    /*!< Set PC3 function to UART2_nRTS          */
#define SET_UART2_nRTS_PD8()        SYS->GPD_MFP2 = ((SYS->GPD_MFP2 & (~SYS_GPD_MFP2_PD8MFP_Msk)) | SYS_GPD_MFP2_PD8MFP_UART2_nRTS)                    /*!< Set PD8 function to UART2_nRTS          */
#define SET_UART2_nRTS_PF4()        SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_UART2_nRTS)                    /*!< Set PF4 function to UART2_nRTS          */
#define SET_UART2_nRTS_PI8()        SYS->GPI_MFP2 = ((SYS->GPI_MFP2 & (~SYS_GPI_MFP2_PI8MFP_Msk)) | SYS_GPI_MFP2_PI8MFP_UART2_nRTS)                    /*!< Set PI8 function to UART2_nRTS          */
#define SET_UART3_RXD_PB14()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_UART3_RXD)                   /*!< Set PB14 function to UART3_RXD          */
#define SET_UART3_RXD_PC2()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_UART3_RXD)                     /*!< Set PC2 function to UART3_RXD           */
#define SET_UART3_RXD_PC9()         SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC9MFP_Msk)) | SYS_GPC_MFP2_PC9MFP_UART3_RXD)                     /*!< Set PC9 function to UART3_RXD           */
#define SET_UART3_RXD_PD0()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD0MFP_Msk)) | SYS_GPD_MFP0_PD0MFP_UART3_RXD)                     /*!< Set PD0 function to UART3_RXD           */
#define SET_UART3_RXD_PE0()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE0MFP_Msk)) | SYS_GPE_MFP0_PE0MFP_UART3_RXD)                     /*!< Set PE0 function to UART3_RXD           */
#define SET_UART3_RXD_PE11()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE11MFP_Msk)) | SYS_GPE_MFP2_PE11MFP_UART3_RXD)                   /*!< Set PE11 function to UART3_RXD          */
#define SET_UART3_RXD_PE15()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE15MFP_Msk)) | SYS_GPE_MFP3_PE15MFP_UART3_RXD)                   /*!< Set PE15 function to UART3_RXD          */
#define SET_UART3_RXD_PF4()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_UART3_RXD)                     /*!< Set PF4 function to UART3_RXD           */
#define SET_UART3_RXD_PI15()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI15MFP_Msk)) | SYS_GPI_MFP3_PI15MFP_UART3_RXD)                   /*!< Set PI15 function to UART3_RXD          */
#define SET_UART3_TXD_PB15()        SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_UART3_TXD)                   /*!< Set PB15 function to UART3_TXD          */
#define SET_UART3_TXD_PC10()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC10MFP_Msk)) | SYS_GPC_MFP2_PC10MFP_UART3_TXD)                   /*!< Set PC10 function to UART3_TXD          */
#define SET_UART3_TXD_PC3()         SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_UART3_TXD)                     /*!< Set PC3 function to UART3_TXD           */
#define SET_UART3_TXD_PD1()         SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_UART3_TXD)                     /*!< Set PD1 function to UART3_TXD           */
#define SET_UART3_TXD_PE1()         SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_UART3_TXD)                     /*!< Set PE1 function to UART3_TXD           */
#define SET_UART3_TXD_PE10()        SYS->GPE_MFP2 = ((SYS->GPE_MFP2 & (~SYS_GPE_MFP2_PE10MFP_Msk)) | SYS_GPE_MFP2_PE10MFP_UART3_TXD)                   /*!< Set PE10 function to UART3_TXD          */
#define SET_UART3_TXD_PE14()        SYS->GPE_MFP3 = ((SYS->GPE_MFP3 & (~SYS_GPE_MFP3_PE14MFP_Msk)) | SYS_GPE_MFP3_PE14MFP_UART3_TXD)                   /*!< Set PE14 function to UART3_TXD          */
#define SET_UART3_TXD_PF5()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UART3_TXD)                     /*!< Set PF5 function to UART3_TXD           */
#define SET_UART3_TXD_PI14()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI14MFP_Msk)) | SYS_GPI_MFP3_PI14MFP_UART3_TXD)                   /*!< Set PI14 function to UART3_TXD          */
#define SET_UART3_nCTS_PB12()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_UART3_nCTS)                  /*!< Set PB12 function to UART3_nCTS         */
#define SET_UART3_nCTS_PD2()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_UART3_nCTS)                    /*!< Set PD2 function to UART3_nCTS          */
#define SET_UART3_nCTS_PH9()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH9MFP_Msk)) | SYS_GPH_MFP2_PH9MFP_UART3_nCTS)                    /*!< Set PH9 function to UART3_nCTS          */
#define SET_UART3_nRTS_PB13()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_UART3_nRTS)                  /*!< Set PB13 function to UART3_nRTS         */
#define SET_UART3_nRTS_PD3()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_UART3_nRTS)                    /*!< Set PD3 function to UART3_nRTS          */
#define SET_UART3_nRTS_PH8()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH8MFP_Msk)) | SYS_GPH_MFP2_PH8MFP_UART3_nRTS)                    /*!< Set PH8 function to UART3_nRTS          */
#define SET_UART4_RXD_PA13()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA13MFP_Msk)) | SYS_GPA_MFP3_PA13MFP_UART4_RXD)                   /*!< Set PA13 function to UART4_RXD          */
#define SET_UART4_RXD_PA2()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_UART4_RXD)                     /*!< Set PA2 function to UART4_RXD           */
#define SET_UART4_RXD_PB10()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB10MFP_Msk)) | SYS_GPB_MFP2_PB10MFP_UART4_RXD)                   /*!< Set PB10 function to UART4_RXD          */
#define SET_UART4_RXD_PC4()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_UART4_RXD)                     /*!< Set PC4 function to UART4_RXD           */
#define SET_UART4_RXD_PC6()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UART4_RXD)                     /*!< Set PC6 function to UART4_RXD           */
#define SET_UART4_RXD_PF6()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF6MFP_Msk)) | SYS_GPF_MFP1_PF6MFP_UART4_RXD)                     /*!< Set PF6 function to UART4_RXD           */
#define SET_UART4_RXD_PG3()         SYS->GPG_MFP0 = ((SYS->GPG_MFP0 & (~SYS_GPG_MFP0_PG3MFP_Msk)) | SYS_GPG_MFP0_PG3MFP_UART4_RXD)                     /*!< Set PG3 function to UART4_RXD           */
#define SET_UART4_RXD_PH11()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH11MFP_Msk)) | SYS_GPH_MFP2_PH11MFP_UART4_RXD)                   /*!< Set PH11 function to UART4_RXD          */
#define SET_UART4_RXD_PH3()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH3MFP_Msk)) | SYS_GPH_MFP0_PH3MFP_UART4_RXD)                     /*!< Set PH3 function to UART4_RXD           */
#define SET_UART4_RXD_PI13()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI13MFP_Msk)) | SYS_GPI_MFP3_PI13MFP_UART4_RXD)                   /*!< Set PI13 function to UART4_RXD          */
#define SET_UART4_TXD_PA12()        SYS->GPA_MFP3 = ((SYS->GPA_MFP3 & (~SYS_GPA_MFP3_PA12MFP_Msk)) | SYS_GPA_MFP3_PA12MFP_UART4_TXD)                   /*!< Set PA12 function to UART4_TXD          */
#define SET_UART4_TXD_PA3()         SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_UART4_TXD)                     /*!< Set PA3 function to UART4_TXD           */
#define SET_UART4_TXD_PB11()        SYS->GPB_MFP2 = ((SYS->GPB_MFP2 & (~SYS_GPB_MFP2_PB11MFP_Msk)) | SYS_GPB_MFP2_PB11MFP_UART4_TXD)                   /*!< Set PB11 function to UART4_TXD          */
#define SET_UART4_TXD_PC5()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_UART4_TXD)                     /*!< Set PC5 function to UART4_TXD           */
#define SET_UART4_TXD_PC7()         SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC7MFP_Msk)) | SYS_GPC_MFP1_PC7MFP_UART4_TXD)                     /*!< Set PC7 function to UART4_TXD           */
#define SET_UART4_TXD_PF7()         SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF7MFP_Msk)) | SYS_GPF_MFP1_PF7MFP_UART4_TXD)                     /*!< Set PF7 function to UART4_TXD           */
#define SET_UART4_TXD_PH10()        SYS->GPH_MFP2 = ((SYS->GPH_MFP2 & (~SYS_GPH_MFP2_PH10MFP_Msk)) | SYS_GPH_MFP2_PH10MFP_UART4_TXD)                   /*!< Set PH10 function to UART4_TXD          */
#define SET_UART4_TXD_PH2()         SYS->GPH_MFP0 = ((SYS->GPH_MFP0 & (~SYS_GPH_MFP0_PH2MFP_Msk)) | SYS_GPH_MFP0_PH2MFP_UART4_TXD)                     /*!< Set PH2 function to UART4_TXD           */
#define SET_UART4_TXD_PI12()        SYS->GPI_MFP3 = ((SYS->GPI_MFP3 & (~SYS_GPI_MFP3_PI12MFP_Msk)) | SYS_GPI_MFP3_PI12MFP_UART4_TXD)                   /*!< Set PI12 function to UART4_TXD          */
#define SET_UART4_nCTS_PC8()        SYS->GPC_MFP2 = ((SYS->GPC_MFP2 & (~SYS_GPC_MFP2_PC8MFP_Msk)) | SYS_GPC_MFP2_PC8MFP_UART4_nCTS)                    /*!< Set PC8 function to UART4_nCTS          */
#define SET_UART4_nCTS_PE1()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE1MFP_Msk)) | SYS_GPE_MFP0_PE1MFP_UART4_nCTS)                    /*!< Set PE1 function to UART4_nCTS          */
