OpenNuvoton/NuTool-PinConfigure/Header/M55M1/Pin_Assignment_V22_sys.h
#define SET_USCI0_CTL0_PC13()       SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC13MFP_Msk)) | SYS_GPC_MFP3_PC13MFP_USCI0_CTL0)                  /*!< Set PC13 function to USCI0_CTL0         */
#define SET_USCI0_CTL0_PC14()       SYS->GPC_MFP3 = ((SYS->GPC_MFP3 & (~SYS_GPC_MFP3_PC14MFP_Msk)) | SYS_GPC_MFP3_PC14MFP_USCI0_CTL0)                  /*!< Set PC14 function to USCI0_CTL0         */
#define SET_USCI0_CTL0_PD4()        SYS->GPD_MFP1 = ((SYS->GPD_MFP1 & (~SYS_GPD_MFP1_PD4MFP_Msk)) | SYS_GPD_MFP1_PD4MFP_USCI0_CTL0)                    /*!< Set PD4 function to USCI0_CTL0          */
#define SET_USCI0_CTL0_PE6()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE6MFP_Msk)) | SYS_GPE_MFP1_PE6MFP_USCI0_CTL0)                    /*!< Set PE6 function to USCI0_CTL0          */
#define SET_USCI0_CTL1_PA8()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA8MFP_Msk)) | SYS_GPA_MFP2_PA8MFP_USCI0_CTL1)                    /*!< Set PA8 function to USCI0_CTL1          */
#define SET_USCI0_CTL1_PB15()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_USCI0_CTL1)                  /*!< Set PB15 function to USCI0_CTL1         */
#define SET_USCI0_CTL1_PD3()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD3MFP_Msk)) | SYS_GPD_MFP0_PD3MFP_USCI0_CTL1)                    /*!< Set PD3 function to USCI0_CTL1          */
#define SET_USCI0_CTL1_PE5()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE5MFP_Msk)) | SYS_GPE_MFP1_PE5MFP_USCI0_CTL1)                    /*!< Set PE5 function to USCI0_CTL1          */
#define SET_USCI0_CTL1_PF0()        SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_USCI0_CTL1)                    /*!< Set PF0 function to USCI0_CTL1          */
#define SET_USCI0_DAT0_PA10()       SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA10MFP_Msk)) | SYS_GPA_MFP2_PA10MFP_USCI0_DAT0)                  /*!< Set PA10 function to USCI0_DAT0         */
#define SET_USCI0_DAT0_PB13()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_USCI0_DAT0)                  /*!< Set PB13 function to USCI0_DAT0         */
#define SET_USCI0_DAT0_PD1()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD1MFP_Msk)) | SYS_GPD_MFP0_PD1MFP_USCI0_DAT0)                    /*!< Set PD1 function to USCI0_DAT0          */
#define SET_USCI0_DAT0_PE3()        SYS->GPE_MFP0 = ((SYS->GPE_MFP0 & (~SYS_GPE_MFP0_PE3MFP_Msk)) | SYS_GPE_MFP0_PE3MFP_USCI0_DAT0)                    /*!< Set PE3 function to USCI0_DAT0          */
#define SET_USCI0_DAT1_PA9()        SYS->GPA_MFP2 = ((SYS->GPA_MFP2 & (~SYS_GPA_MFP2_PA9MFP_Msk)) | SYS_GPA_MFP2_PA9MFP_USCI0_DAT1)                    /*!< Set PA9 function to USCI0_DAT1          */
#define SET_USCI0_DAT1_PB14()       SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_USCI0_DAT1)                  /*!< Set PB14 function to USCI0_DAT1         */
#define SET_USCI0_DAT1_PD2()        SYS->GPD_MFP0 = ((SYS->GPD_MFP0 & (~SYS_GPD_MFP0_PD2MFP_Msk)) | SYS_GPD_MFP0_PD2MFP_USCI0_DAT1)                    /*!< Set PD2 function to USCI0_DAT1          */
#define SET_USCI0_DAT1_PE4()        SYS->GPE_MFP1 = ((SYS->GPE_MFP1 & (~SYS_GPE_MFP1_PE4MFP_Msk)) | SYS_GPE_MFP1_PE4MFP_USCI0_DAT1)                    /*!< Set PE4 function to USCI0_DAT1          */
#define SET_USCI0_DAT1_PF1()        SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_USCI0_DAT1)                    /*!< Set PF1 function to USCI0_DAT1          */
#define SET_UTCPD0_CC1_PC0()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC0MFP_Msk)) | SYS_GPC_MFP0_PC0MFP_UTCPD0_CC1)                    /*!< Set PC0 function to UTCPD0_CC1          */
#define SET_UTCPD0_CC2_PC1()        SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC1MFP_Msk)) | SYS_GPC_MFP0_PC1MFP_UTCPD0_CC2)                    /*!< Set PC1 function to UTCPD0_CC2          */
#define SET_UTCPD0_CCDB1_PC2()      SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC2MFP_Msk)) | SYS_GPC_MFP0_PC2MFP_UTCPD0_CCDB1)                  /*!< Set PC2 function to UTCPD0_CCDB1        */
#define SET_UTCPD0_CCDB2_PC3()      SYS->GPC_MFP0 = ((SYS->GPC_MFP0 & (~SYS_GPC_MFP0_PC3MFP_Msk)) | SYS_GPC_MFP0_PC3MFP_UTCPD0_CCDB2)                  /*!< Set PC3 function to UTCPD0_CCDB2        */
#define SET_UTCPD0_DISCHG_PA1()     SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_UTCPD0_DISCHG)                 /*!< Set PA1 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PA6()     SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_UTCPD0_DISCHG)                 /*!< Set PA6 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PC4()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_UTCPD0_DISCHG)                 /*!< Set PC4 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PC5()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_UTCPD0_DISCHG)                 /*!< Set PC5 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PC6()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UTCPD0_DISCHG)                 /*!< Set PC6 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PF0()     SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_UTCPD0_DISCHG)                 /*!< Set PF0 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PF1()     SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_UTCPD0_DISCHG)                 /*!< Set PF1 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_DISCHG_PJ0()     SYS->GPJ_MFP0 = ((SYS->GPJ_MFP0 & (~SYS_GPJ_MFP0_PJ0MFP_Msk)) | SYS_GPJ_MFP0_PJ0MFP_UTCPD0_DISCHG)                 /*!< Set PJ0 function to UTCPD0_DISCHG       */
#define SET_UTCPD0_FRSTX1_PA1()     SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA1MFP_Msk)) | SYS_GPA_MFP0_PA1MFP_UTCPD0_FRSTX1)                 /*!< Set PA1 function to UTCPD0_FRSTX1       */
#define SET_UTCPD0_FRSTX1_PC4()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC4MFP_Msk)) | SYS_GPC_MFP1_PC4MFP_UTCPD0_FRSTX1)                 /*!< Set PC4 function to UTCPD0_FRSTX1       */
#define SET_UTCPD0_FRSTX1_PF1()     SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF1MFP_Msk)) | SYS_GPF_MFP0_PF1MFP_UTCPD0_FRSTX1)                 /*!< Set PF1 function to UTCPD0_FRSTX1       */
#define SET_UTCPD0_FRSTX2_PC5()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC5MFP_Msk)) | SYS_GPC_MFP1_PC5MFP_UTCPD0_FRSTX2)                 /*!< Set PC5 function to UTCPD0_FRSTX2       */
#define SET_UTCPD0_FRSTX2_PC6()     SYS->GPC_MFP1 = ((SYS->GPC_MFP1 & (~SYS_GPC_MFP1_PC6MFP_Msk)) | SYS_GPC_MFP1_PC6MFP_UTCPD0_FRSTX2)                 /*!< Set PC6 function to UTCPD0_FRSTX2       */
#define SET_UTCPD0_FRSTX2_PF0()     SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF0MFP_Msk)) | SYS_GPF_MFP0_PF0MFP_UTCPD0_FRSTX2)                 /*!< Set PF0 function to UTCPD0_FRSTX2       */
#define SET_UTCPD0_VBDCHG_PB1()     SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB1MFP_Msk)) | SYS_GPB_MFP0_PB1MFP_UTCPD0_VBDCHG)                 /*!< Set PB1 function to UTCPD0_VBDCHG       */
#define SET_UTCPD0_VBSNKEN_PA3()    SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA3MFP_Msk)) | SYS_GPA_MFP0_PA3MFP_UTCPD0_VBSNKEN)                /*!< Set PA3 function to UTCPD0_VBSNKEN      */
#define SET_UTCPD0_VBSNKEN_PA5()    SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA5MFP_Msk)) | SYS_GPA_MFP1_PA5MFP_UTCPD0_VBSNKEN)                /*!< Set PA5 function to UTCPD0_VBSNKEN      */
#define SET_UTCPD0_VBSNKEN_PA7()    SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA7MFP_Msk)) | SYS_GPA_MFP1_PA7MFP_UTCPD0_VBSNKEN)                /*!< Set PA7 function to UTCPD0_VBSNKEN      */
#define SET_UTCPD0_VBSNKEN_PB13()   SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB13MFP_Msk)) | SYS_GPB_MFP3_PB13MFP_UTCPD0_VBSNKEN)              /*!< Set PB13 function to UTCPD0_VBSNKEN     */
#define SET_UTCPD0_VBSNKEN_PB15()   SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB15MFP_Msk)) | SYS_GPB_MFP3_PB15MFP_UTCPD0_VBSNKEN)              /*!< Set PB15 function to UTCPD0_VBSNKEN     */
#define SET_UTCPD0_VBSNKEN_PF5()    SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_UTCPD0_VBSNKEN)                /*!< Set PF5 function to UTCPD0_VBSNKEN      */
#define SET_UTCPD0_VBSRCEN_PA2()    SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA2MFP_Msk)) | SYS_GPA_MFP0_PA2MFP_UTCPD0_VBSRCEN)                /*!< Set PA2 function to UTCPD0_VBSRCEN      */
#define SET_UTCPD0_VBSRCEN_PA4()    SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA4MFP_Msk)) | SYS_GPA_MFP1_PA4MFP_UTCPD0_VBSRCEN)                /*!< Set PA4 function to UTCPD0_VBSRCEN      */
#define SET_UTCPD0_VBSRCEN_PA6()    SYS->GPA_MFP1 = ((SYS->GPA_MFP1 & (~SYS_GPA_MFP1_PA6MFP_Msk)) | SYS_GPA_MFP1_PA6MFP_UTCPD0_VBSRCEN)                /*!< Set PA6 function to UTCPD0_VBSRCEN      */
#define SET_UTCPD0_VBSRCEN_PB12()   SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB12MFP_Msk)) | SYS_GPB_MFP3_PB12MFP_UTCPD0_VBSRCEN)              /*!< Set PB12 function to UTCPD0_VBSRCEN     */
#define SET_UTCPD0_VBSRCEN_PB14()   SYS->GPB_MFP3 = ((SYS->GPB_MFP3 & (~SYS_GPB_MFP3_PB14MFP_Msk)) | SYS_GPB_MFP3_PB14MFP_UTCPD0_VBSRCEN)              /*!< Set PB14 function to UTCPD0_VBSRCEN     */
#define SET_UTCPD0_VBSRCEN_PF4()    SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_UTCPD0_VBSRCEN)                /*!< Set PF4 function to UTCPD0_VBSRCEN      */
#define SET_UTCPD0_VCNEN1_PA0()     SYS->GPA_MFP0 = ((SYS->GPA_MFP0 & (~SYS_GPA_MFP0_PA0MFP_Msk)) | SYS_GPA_MFP0_PA0MFP_UTCPD0_VCNEN1)                 /*!< Set PA0 function to UTCPD0_VCNEN1       */
#define SET_UTCPD0_VCNEN2_PB0()     SYS->GPB_MFP0 = ((SYS->GPB_MFP0 & (~SYS_GPB_MFP0_PB0MFP_Msk)) | SYS_GPB_MFP0_PB0MFP_UTCPD0_VCNEN2)                 /*!< Set PB0 function to UTCPD0_VCNEN2       */
#define SET_X32_IN_PF5()            SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF5MFP_Msk)) | SYS_GPF_MFP1_PF5MFP_X32_IN)                        /*!< Set PF5 function to X32_IN              */
#define SET_X32_OUT_PF4()           SYS->GPF_MFP1 = ((SYS->GPF_MFP1 & (~SYS_GPF_MFP1_PF4MFP_Msk)) | SYS_GPF_MFP1_PF4MFP_X32_OUT)                       /*!< Set PF4 function to X32_OUT             */
#define SET_XT1_IN_PF3()            SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF3MFP_Msk)) | SYS_GPF_MFP0_PF3MFP_XT1_IN)                        /*!< Set PF3 function to XT1_IN              */
#define SET_XT1_OUT_PF2()           SYS->GPF_MFP0 = ((SYS->GPF_MFP0 & (~SYS_GPF_MFP0_PF2MFP_Msk)) | SYS_GPF_MFP0_PF2MFP_XT1_OUT)                       /*!< Set PF2 function to XT1_OUT             */




/*@}*/ /* end of group SYS_EXPORTED_CONSTANTS */

/**
  * @brief      Clear Brown-out detector interrupt flag
  * @param      None
  * @return     None
  * @details    This macro clear Brown-out detector interrupt flag.
  * \hideinitializer
  */
#define SYS_CLEAR_BOD_INT_FLAG() \
    do{ \
        SYS->BODSTS |= SYS_BODSTS_BODIF_Msk; \
    }while(0)

/**
  * @brief      Set Brown-out detector function to normal mode
  * @param      None
  * @return     None
  * @details    This macro set Brown-out detector to normal mode.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_CLEAR_BOD_LPM() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL &= ~SYS_BODCTL_BODLPM_Msk; \
    }while(0)

/**
  * @brief      Disable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out detector function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_DISABLE_BOD() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL &= ~SYS_BODCTL_BODEN_Msk; \
    }while(0)

/**
  * @brief      Enable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_ENABLE_BOD() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL |= SYS_BODCTL_BODEN_Msk; \
    }while(0)

/**
  * @brief      Get Brown-out detector interrupt flag
  * @param      None
  * @retval     0   Brown-out detect interrupt flag is not set.
  * @retval     >=1 Brown-out detect interrupt flag is set.
  * @details    This macro get Brown-out detector interrupt flag.
  * \hideinitializer
  */
#define SYS_GET_BOD_INT_FLAG()          (SYS->BODCTL & SYS_BODSTS_BODIF_Msk)

/**
  * @brief      Get Brown-out detector status
  * @param      None
  * @retval     0   System voltage is higher than BOD threshold voltage setting or BOD function is disabled.
  * @retval     >=1 System voltage is lower than BOD threshold voltage setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD function is disabled, this function always return 0.
  * \hideinitializer
  */
#define SYS_GET_BOD_OUTPUT()            (SYS->BODCTL & SYS_BODSTS_BODOUT_Msk)

/**
  * @brief      Enable Brown-out detector interrupt function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector interrupt function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_DISABLE_BOD_RST() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL &= ~SYS_BODCTL_BODRSTEN_Msk; \
    }while(0)

/**
  * @brief      Enable Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_ENABLE_BOD_RST() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL |= SYS_BODCTL_BODRSTEN_Msk; \
    }while(0)

/**
  * @brief      Set Brown-out detector function to low power mode
  * @param      None
  * @return     None
  * @details    This macro set Brown-out detector to low power mode.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_SET_BOD_LPM() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL |= SYS_BODCTL_BODLPM_Msk; \
    }while(0)

/**
  * @brief      Set Brown-out detector voltage level
  * @param[in]  u32Level is Brown-out voltage level. Including :
  *             - \ref SYS_BODCTL_BODVL_1_6V
  *             - \ref SYS_BODCTL_BODVL_1_8V
  *             - \ref SYS_BODCTL_BODVL_2_0V
  *             - \ref SYS_BODCTL_BODVL_2_2V
  *             - \ref SYS_BODCTL_BODVL_2_4V
  *             - \ref SYS_BODCTL_BODVL_2_6V
  *             - \ref SYS_BODCTL_BODVL_2_8V
  *             - \ref SYS_BODCTL_BODVL_3_0V
  * @return     None
  * @details    This macro set Brown-out detector voltage level.
  *             The write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_SET_BOD_LEVEL(u32Level) \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL = (SYS->BODCTL & ~SYS_BODCTL_BODVL_Msk) | (u32Level); \
    }while(0)

/**
  * @brief      Set Brown-out detector wake-up selection
  * @param[in]  u32Wakeup is Brown-out detector wake-up selection. Including :
  *             - \ref SYS_BODCTL_BODWKEN_DISABLE
  *             - \ref SYS_BODCTL_BODWKEN_RISE
  *             - \ref SYS_BODCTL_BODWKEN_DROP
  *             - \ref SYS_BODCTL_BODWKEN_BOTH
  * @return     None
  * @details    This macro set Brown-out detector wake-up selection.
  *             The write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_SET_BOD_WAKEUP(u32Wakeup) \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL = (SYS->BODCTL & ~SYS_BODCTL_BODWKEN_Msk) | (u32Wakeup); \
    }while(0)

/**
  * @brief      Get reset source is from Brown-out detector reset
  * @param      None
  * @retval     0   Previous reset source is not from Brown-out detector reset
  * @retval     >=1 Previous reset source is from Brown-out detector reset
  * @details    This macro get previous reset source is from Brown-out detect reset or not.
  * \hideinitializer
  */
#define SYS_IS_BOD_RST()                (SYS->RSTSTS & SYS_RSTSTS_BODRF_Msk)

/**
  * @brief      Get reset source is from CPU reset
  * @param      None
  * @retval     0   Previous reset source is not from CPU reset
  * @retval     >=1 Previous reset source is from CPU reset
  * @details    This macro get previous reset source is from CPU reset.
  * \hideinitializer
  */
#define SYS_IS_CPU_RST()                (SYS->RSTSTS & SYS_RSTSTS_CPURF_Msk)

/**
  * @brief      Get reset source is from LVR Reset
  * @param      None
  * @retval     0   Previous reset source is not from Low-Voltage-Reset
  * @retval     >=1 Previous reset source is from Low-Voltage-Reset
  * @details    This macro get previous reset source is from Low-Voltage-Reset.
  * \hideinitializer
  */
#define SYS_IS_LVR_RST()                (SYS->RSTSTS & SYS_RSTSTS_LVRRF_Msk)

/**
  * @brief      Get reset source is from Power-on Reset
  * @param      None
  * @retval     0   Previous reset source is not from Power-on Reset
  * @retval     >=1 Previous reset source is from Power-on Reset
  * @details    This macro get previous reset source is from Power-on Reset.
  * \hideinitializer
  */
#define SYS_IS_POR_RST()                (SYS->RSTSTS & SYS_RSTSTS_PORF_Msk)

/**
  * @brief      Get reset source is from reset pin reset
  * @param      None
  * @retval     0   Previous reset source is not from reset pin reset
  * @retval     >=1 Previous reset source is from reset pin reset
  * @details    This macro get previous reset source is from reset pin reset.
  * \hideinitializer
  */
#define SYS_IS_RSTPIN_RST()             (SYS->RSTSTS & SYS_RSTSTS_PINRF_Msk)

/**
  * @brief      Get reset source is from system reset
  * @param      None
  * @retval     0   Previous reset source is not from system reset
  * @retval     >=1 Previous reset source is from system reset
  * @details    This macro get previous reset source is from system reset.
  * \hideinitializer
  */
#define SYS_IS_SYSTEM_RST()             (SYS->RSTSTS & SYS_RSTSTS_SYSRF_Msk)

/**
  * @brief      Get reset source is from window watch dog reset
  * @param      None
  * @retval     0   Previous reset source is not from window watch dog reset
  * @retval     >=1 Previous reset source is from window watch dog reset
  * @details    This macro get previous reset source is from window watch dog reset.
  * \hideinitializer
  */
#define SYS_IS_WDT_RST()                (SYS->RSTSTS & SYS_RSTSTS_WDTRF_Msk)

/**
  * @brief      Get reset source is from CPU lockup reset
  * @param      None
  * @retval     0   Previous reset source is not from CPU lockup reset
  * @retval     >=1 Previous reset source is from CPU lockup reset
  * @details    This macro get previous reset source is from CPU lockup reset.
  * \hideinitializer
  */
#define SYS_IS_CPULK_RST()                (SYS->RSTSTS & SYS_RSTSTS_CPULKRF_Msk)


/**
  * @brief      Disable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_DISABLE_LVR() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL &= ~SYS_BODCTL_LVREN_Msk; \
    }while(0)

/**
  * @brief      Enable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_ENABLE_LVR() \
    do{ \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk); \
        SYS->BODCTL |= SYS_BODCTL_LVREN_Msk; \
    }while(0)

/**
  * @brief      Disable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Power-on Reset function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_DISABLE_POR()               (SYS->PORCTL = 0x5AA55AA5)

/**
  * @brief      Enable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Power-on Reset function.
  *             The register write-protection function should be disabled before using this macro.
  * \hideinitializer
  */
#define SYS_ENABLE_POR()                (SYS->PORCTL = 0)

/**
  * @brief      Wait SYS_BODCTL Write Busy Flag
  * @param      None
  * @return     None
  * @details    This macro waits SYS_BODCTL write busy flag is cleared and skips when time-out.
  */
#define SYS_WAIT_BODCTL_WRBUSY() \
    do{ \
        uint32_t u32TimeOutCnt = SYS_TIMEOUT; \
        while(SYS->BODCTL & SYS_BODCTL_WRBUSY_Msk) \
        { \
            if(--u32TimeOutCnt == 0) break; \
        } \
    }while(0)

/**
  * @brief      Wait SYS_VREFCTL Write Busy Flag
  * @param      None
  * @return     None
  * @details    This macro waits SYS_VREFCTL write busy flag is cleared and skips when time-out.
  */
#define SYS_WAIT_VREFCTL_WRBUSY() \
    do{ \
        uint32_t u32TimeOutCnt = SYS_TIMEOUT; \
        while(SYS->VREFCTL & SYS_VREFCTL_WRBUSY_Msk) \
        { \
            if(--u32TimeOutCnt == 0) break; \
        } \
    }while(0)

/*---------------------------------------------------------------------------------------------------------*/
/* static inline functions                                                                                 */
/*---------------------------------------------------------------------------------------------------------*/
/* Declare these inline functions here to avoid MISRA C 2004 rule 8.1 error */
__STATIC_INLINE void SYS_UnlockReg(void);
__STATIC_INLINE void SYS_LockReg(void);
__STATIC_INLINE void SYS_ClearResetSrc(uint32_t u32Src);
__STATIC_INLINE uint32_t SYS_GetBODStatus(void);
__STATIC_INLINE uint32_t SYS_GetResetSrc(void);
__STATIC_INLINE uint32_t SYS_IsRegLocked(void);
__STATIC_INLINE uint32_t SYS_ReadPDID(void);
__STATIC_INLINE void SYS_ResetChip(void);
__STATIC_INLINE void SYS_ResetCPU(void);
__STATIC_INLINE void SYS_SetVRef(uint32_t u32VRefCTL);

/**
  * @brief      Disable register write-protection function
  * @param      None
  * @return     None
  * @details    This function disable register write-protection function.
  *             To unlock the protected register to allow write access.
  */
__STATIC_INLINE void SYS_UnlockReg(void)
{
    uint32_t u32TimeOutCount = SYS_TIMEOUT;

    do
    {
        SYS->REGLCTL = 0x59UL;
        SYS->REGLCTL = 0x16UL;
        SYS->REGLCTL = 0x88UL;

        if (--u32TimeOutCount == 0) break;
    } while (SYS->REGLCTL == 0UL);
}

/**
  * @brief      Enable register write-protection function
  * @param      None
  * @return     None
  * @details    This function is used to enable register write-protection function.
  *             To lock the protected register to forbid write access.
  */
__STATIC_INLINE void SYS_LockReg(void)
{
    SYS->REGLCTL = 0UL;
}

